{"user_name":"Hailee ","character_name":"Penelope Nell Hayes","create_date":"2025-05-30@13h57m05s","chat_metadata":{"integrity":"762fcdf0-84b9-455a-93e1-bce0ba6c0566"}}
{"name":"Penelope Nell Hayes","is_user":false,"is_system":false,"send_date":"May 30, 2025 1:57pm","mes":"\": \"The lights were too damn bright. The smoke machines were overkill. Someone in the crowd had already thrown a bra onstage and they were only three songs in.\r\n\r\nNell stood off to the side, bass hanging low across her hips. Her fingers moved on autopilot, but mentally she was already checking out.\r\n\r\nTheir guitarist, the walking restraining order, was sliding across the stage on his knees, his hair wild as he headbanged like it would kill him if he stopped. Either he was going to throw out his neck or Nell was going to choke him out with his damn strings.\r\n\r\nTheir singer was upfront, shirtless by song two, making doe eyes at the crowd like he was begging to be saved from himself. He’d already changed the lyrics mid-song to make them about his ex again, completely throwing off Nell’s backup vocals. She didn’t even try to challenge him. Let him spiral. At least his meltdown later would be hilarious.\r\n\r\nTheir drummer had snapped a stick two beats ago and hadn’t missed a hit. He was flying across the kit like a maniac, sweat flying, playing like the devil offered him a deal and he said *double or nothing*. Nell hated that she kind of respected it.\r\n\r\nThe crowd roared, eating it all up. Of course they did. Freaks.\r\n\r\nAnd the *signs*. So many signs. Big, glittery, *ugly* hand-cut things that just said “MOMMY” in giant pink block letters. There was one that said “STEP ON ME PLEASE” in comic sans. Another had her face photoshopped onto a dominatrix. One had her tumblr profile picture from 2013. That one stung. \r\n\r\nShe didn't even know that photo still existed. It was her scene phase. There was eyeliner. So much eyeliner.\r\n\r\nAnother sign just had a QR code. She would *not* be scanning that.\r\n\r\n…Someone was holding up a literal leash.\r\n\r\nNell had to resist the urge to walk offstage and into traffic.\r\n\r\nInstead, she made the mistake of looking in the front row.\r\n\r\nRight there, she could see Roman’s little plaything– his *current* one, anyway. She was going crazy against the barricade, practically losing her damn mind, and Nell knew it had very little to do with the music and everything to do with the fact that their boss was in his prime grooming years and taking full advantage of it. She couldn’t resist the shudder before looking away. \r\n\r\nSome days she missed hiding away in her parents garage, plugging in her amp, tossing on her headphones and closing herself off from the world to play just for *her*. There had been something special about not giving a shit in private.\r\n\r\nIn public she doesn't give a shit either, but out here people kept mistaking it for foreplay.\r\n\r\nHer eyes drifted through the crowd again, her impatience and annoyance wearing thinner by the minute. She already had such a limited supply, but people were *really* testing her tonight.\r\n\r\nHer eyes narrowed as she locked onto a couple people near the front. Looked like an argument. She was about to look away when she saw the man put his hand on the woman–where it *did not* belong.\r\n\r\n*Fuck* no.\r\n\r\nNell caught the furious burning in Roman’s eyes as he watched her from the wings. He knew what she was about to do. She knew that he knew. She also didn’t care. He could wipe his tears with his fat stack of benjamins as he cried himself to sleep later.\r\n\r\nShe dropped her bass onto the stage floor, ignoring the harsh screech of feedback as she walked across the scuffed floor. She ignored the confused and panicked expressions of her bandmates as she hopped off the stage. \r\n\r\nThree different security guards reached for her but she ducked out of the way, hopping over the fence and throwing herself into the sea of people.\r\n\r\nThe crowd parted. Probably read the murder in her eyes and figured she wasn’t in a meet-and-greet mood.\r\n\r\nWell, her *fists* were.\r\n\r\nShe reached out and gripped the man by the shoulder and tugged him to face her. Without so much as a *hello*, her fist flew through the air and cracked against his cheek.\r\n\r\nThe shocked screeches and gasps around her were *so* satisfying.\r\n\r\nShe shook out her hand, staring down at the whimpering man on the ground before her eyes flicked up, landing on the woman he’d been accosting.\r\n\r\n“You good?” she asked, looking Hailee up and down. “Cool.”\r\n\r\nAnd then she turned around, making her way back onstage without another word.\r\n\r\n“Holy shit, that was so hot, dommy mommy,” their guitarist howled into the mic. “Gonna step on me next? I’ve been bad.”\r\n\r\nNell rolled her eyes, snatching up her bass before slinging it over her shoulder.\r\n\r\nIt was gonna be a long fucking show. And if one more person called her mommy, she was gonna start swinging again.\r\n\r\n***\r\n\r\nNell leaned up against the wall of the venue, taking a long drag from her smoke. The crisp night air felt like a godsend against her skin. Clean, cold, and *quiet*. No assholes. No fucking signs. Just the buzz of a streetlamp and her own heart still thumping from the adrenaline. \r\n\r\nHer back ached, her head was buzzing, and her knuckles still had a faint sting. God, she missed nights where *nothing* was happening.\r\n\r\nThe back door creaked open. She heard footsteps, soft and unsure, and glanced over out of habit, fully expecting some roadie or a fan who hadn’t gotten enough. Instead, it was *her*. The one she’d ‘rescued’ earlier. Or whatever the internet was gonna call it.\r\n\r\nNell clicked her tongue.\r\n\r\nAgainst her better judgment, her intrigue sparked. “Hey,” she called out, voice a sandpaper rasp that sounded way too loud out here.\r\n\r\nShe watched as the girl she'd defended earlier turned around to face her.\r\n\r\n“You like tacos?” she asked bluntly, flicking ash into the tray. “Or food. In general. You probably eat, right?”\r\n\r\nThe girl looked surprised. Nell hated how that made her want to say more.\r\n\r\n“There’s a place up the street,” she continued, shoving her hands in her jacket pockets. “Late night garbage food. Greasy. Kinda gross, but still fucks.” She didn’t wait for a reply. “Walk with me.” \r\n\r\nIt wasn’t a question. It barely even sounded like an invitation.\r\n\r\nThe last of the crowd was trickling out, and one man came to an abrupt stop. The guy from the *’meet-and-greet’* earlier. He had an ice pack to his cheek, his eyes wide, mouth slightly open.\r\n\r\nNell raised a brow, tilting her head. *Say something*, her stare said. *Give me an excuse.*\r\n\r\nHe didn’t. Just gulped and skittered away, tail between his legs like a little wet rat.\r\n\r\n“Yeah,” Nell muttered, exhaling smoke. “That’s what I thought.”\r\n\r\nShe flicked the butt of her cigarette into the tray and started walking, slow and unbothered, like she had all the time in the world and none of it for anyone else.\r\n\r\n“So?” she called out over her shoulder. “Gonna move your ass, or what? Wait too long and I'll get bored, sweetheart. I'd say you got about… five seconds.”\r\n\r\nAnd *fuck*… but Nell really hoped she'd follow.\"\r\n","extra":{}}