{"user_name":"Hailee","character_name":"Faust","create_date":"2025-04-26@22h48m49s","chat_metadata":{"integrity":"f749574d-d803-4df4-81d5-fafb4416a767"}}
{"name":"Faust Hyrea","is_user":false,"is_system":false,"send_date":"April 26, 2025 10:48pm","mes":"Faust knew the risks, yet *he didn't back down.*\n\nHe knew the risks, the consequences, the problems that came along with his actions, but he didn't care. He could get killed for all he cared; he knew they weren't brave enough actually to kill him due to his father, Cassius Von Hyrea, but still, he knew it didn't make him invisible.\n\nBut he was using it to his advantage, being one of the sons of the leader of Medarir, he knew somehow it had a way through this mess. His older brother Ezekiel would claim *\"You know this is dangerous.\"* Yes, yes, he knew. His younger brother, Fenris? *\"Brother, next time you go there, you might not come back alive.\"* He also knew that. And Kelden? *\"I don't understand why you go through such trouble for an angel.\"* That's also what was troubling him, and yet.\n\nHe never stopped, never gave up on his ray of sun, {{user}}.\n\nIt wasn't strange, the relationship between the Angels and Necromancers, it was weird to some who thought the Angels would have more beef with the Demons, but they got proven wrong. Faust knew and resented the Angels for what they did— What **he** did, but placing the blame on innocents? He wasn't like that.\n\nConsequences be damned, fuck he was in love with them.\n\nThat's why he was currently climbing the wall of the Angelic palace in the middle of the night, towards his beloved angel's room. Faust was determined, it has been more than a month since he saw {{user}} (orders from Ezekiel who caught him sneaking out), sneaking under the guards' noses, avoiding any traps, just by the way he was moving, anyone could tell he was used to doing such a thing. He once again climbed the wall, this time, the one directly leading towards {{user}}'s room.\n\nHe set foot on the marbled floor, he approached the grand window, he looked through it, his eyes searching for his beloved. He almost backed down, ready to leave— The door of the room opened, revealing his beloved...crying.\n\nOh Faust wasn't the type to get pissed easily but *this?* His sunshine *crying?* Faust would burn the world, kill whoever dared to make them cry.\n\nHe quickly knocked on the window, drawing {{user}}'s attention. Once the window opened, Faust slid in, wrapping his arms around them, rubbing circles on their back.\n\n\"Shhh shh, sunshine..I'm here now, I'm here..\" He kissed their forehead, pulling away slightly to wipe their tears. He hated this, hated to see them cry.\n\n\"Sunshine, my beloved, what's wrong? Who dared to make you cry?\" He asked with slight urgency, his rough hands gently caressing their cheeks. He listened to them, rubbing their back in a comforting way—\n\nBut his hand stilled, his whole body froze as he heard the words coming out of their mouth.\n\n*Arranged marriage?*\n\n\"Your..father did *what?*\" He asked, his grip on them unconsciously tightening slowly. He gulped down thickly, his mouth went dry.\n\n*This was a nightmare.*\n\n\"Darling, darling..Listen to me, you'll be fine, we'll be fine, okay? Even with this arranged marriage, we will still be with each other, you hear me? I am not giving up on you.\" Faust said, cupping their cheeks, he brushed his thumb on their cheek.\n\n*But he wanted to kill their father for putting his beloved through such trouble.*","extra":{}}