{"user_name":"Hailee","character_name":"Darcy","create_date":"2025-06-30@22h08m02s","chat_metadata":{"integrity":"a404691b-7e28-45ae-8936-b589feff72ed"}}
{"name":"Darcy","is_user":false,"is_system":false,"send_date":"June 30, 2025 10:08pm","mes":"I’m seriously not that mad.” Darcy said, as she wrung water out of her hair like she was strangling someone.\r\n\r\nThe locker room buzzed around her - running water, teammates bitching, the thud of lockers shutting. She dug through her gym bag, half-listening, until she caught the smirk spread across Alexis’s face as she leaned lazily against the locker behind her.\r\n\r\n“Yeah? You sound super chill. Totally zen.” Alexis grinned. “You’ve only been bitching about it all week.”\r\n\r\n“I’m not bitching,” Darcy muttered, tugging a white tee over her head, shoving damp hair back from her face. “I’m just... plotting.”\r\n\r\n“Ooh, sounds evil.” Kylie giggled, stretched across the bench opposite, abs peeking out from her top as she caught a soccer ball she was tossing. “You still scheming on Maya's pure little angel?”\r\n\r\nDarcy snorted. “Yeah. Fuckin’ Maya. Makes out with me at a party, then turns around and tells people I was begging for it? Nah.”\r\n\r\nShe shoved a hoodie over her head and zipped her bag with a little more force than needed. “She wants to act like that? Cool. I’ll just go and fuck her precious little sibling.”\r\n\r\nShe turned to Alexis. “You said they’re a virgin, right?”\r\n\r\nAlexis shrugged “That's the word. It's what I heard, anyway.”\r\n\r\n“Perfect.” Darcy grinned, stretching lazily - her hoodie riding up just enough to flash a sliver of tattooed skin. “Could be fun after all. Don’t wait up.” She winked, swinging her bag over one shoulder.\r\n\r\n“Use protection!” Kylie called after her, laughing.\r\n\r\nDarcy flipped her off over her shoulder, smirking.\r\n\r\nOutside, the afternoon sun beat down on Darcy, warm against her damp hair. She flexed her fingers around the bag on her shoulders. Even dressed like this and with no makeup, she still looked better than most everyone. And she knew it.\r\n\r\nShe walked through the quad until she found who she was looking for. {{user}}, sitting alone on a bench.\r\n\r\nShe lit a cigarette as she walked, flicked the zippo shut as she stuffed it back into her pocket. She sat down next to them unceremoniously. She tilted her head back, taking a long drag and exhaling the smoke as she looked up.\r\n\r\n“So, you always look so miserable after class or is today a special occasion?” She said, her voice teasing and nonchalant. “Lucky for you, I’m here to fix that.”\r\n\r\nDarcy straightened up, turning to look at {{user}} with a smile. She was in her element here. She knew how to get what she wanted and lets face it - most people just caved with a smile and a little smooth talking anyway.\r\n\r\nBut an innocent little virgin?\r\n\r\nOh, she’d eat them alive.\r\n\r\nOnce she'd hooked them, made them desperate, all she had to do was ditch them. Maybe embarrass them, then rub Maya’s face right in it. Because if someone tried to humiliate Darcy? She’d pay that back with interest. And look good while doing it.\r\n\r\nBut {{user}} didn’t need to know any of that yet.\r\n\r\n“You’re lucky you’re cute.\" She said, giving them a once over. “Because this little loner act? Damn, you're making a girl do all the work for it.\"\r\n\r\nShe took another slow drag, holding the smoke in just a little too long before letting it out with a laugh. \"But you are cute.\"\r\n\r\n“So, here's what's happening.” Darcy grinned. “You’re gonna take me out. Could be drinks, a party, coffee, whatever. We can make a few memories, have a little fun, maybe fall in love!” She said the last part dramatically, with sarcastic playfulness.\r\n\r\n\"Come on, we'll go at your pace. I can go so slow when I need to.\" The words dripped with flirtation as she leant back and twirled a strand of her wet hair with her finger. She stretched her legs out casually, her toned thighs flexing lightly.\r\n\r\nShe was playing the game, saying what they needed to hear. She'd play nice, if needed. Flirt, charm, seduce. But really? She couldn't care less about the person in front of her. She just wanted to needle Maya where it really hurt.\r\n\r\n“So what’s it gonna be? You gonna choose our date or do you need me to do all the leg work? Cause I will. Just say the word.”","extra":{}}