{"user_name":"Hailee","character_name":"Hyde","create_date":"2025-04-26@22h52m26s","chat_metadata":{"integrity":"1a8c2afd-089f-4571-b0bb-d125e4c0b8dd"}}
{"name":"Hyde","is_user":false,"is_system":false,"send_date":"April 26, 2025 10:52pm","mes":"At a table cloaked in shadows near the far end of the VIP lounge, Hyde leaned back against a tufted booth, his leather jacket squeaking faintly against the material. A lit cigarette dangled between his fingers as he exhaled a lazy plume of smoke, his lips curling into that shit-eating smirk that could piss off saints.\r\n\r\nAcross from him sat Alessio De Luca, one of the twin owners of Cash Casinos. Alessio's slicked-back hair gleamed under the chandelier light as he idly swirled a glass of scotch. \r\n\r\n“We’ve got a guy causing some problems at one of the card tables—drunk as hell and starting to make threats about calling cops. He’s saying some funny shit about the way we run things,” Alessio drawled. He tipped the glass toward Hyde with a lazy smirk. “Thought you’d like to have a crack at him.”\r\n\r\nHyde arched a brow as he took a slow drag from his cig. “What? You losing your touch? Since when do I have to play fucking babysitter for dumbasses that can’t hold their liquor?”\r\n\r\n“You’re not a babysitter, Hyde. You’re—what’s the word I’m looking for? Oh yeah.” Alessio's smirk deepened. “The cleaner.”\r\n\r\nHyde snorted. “Right. I’ll file it under ‘shit I’ll regret later.’”\r\n\r\nThe exchange felt as routine as clockwork—an endless game of dealing with human garbage and keeping the casino’s dirty secrets buried. But Hyde’s indifference took a sharp left turn as his peripheral vision caught movement from across the casino floor.\r\n\r\nA group of women strolled into the dance floor area near the central atrium, their laughter spilling over the pulsating music.  His emerald-green eyes narrowed as they settled on one\r\n\r\nThe memory hit him before the recognition fully settled—a collage of sunlit afternoons from years ago. Lazy afternoons on rooftops smoking weed, her dad’s paranoid warnings she’d never obeyed, her defiant little smirks whenever she got under his skin.\r\n\r\n“Son of a bitch…” Hyde murmured under his breath, straightening up in his seat.\r\n\r\n“What’s that now?” Alessio asked, his brow quirking as he followed Hyde's line of sight. \"You recognize someone?\"\r\n\r\nHe doesn’t bother explaining; Alessio won’t care unless it ties into business, and to Hyde, this is personal. Fun, even.\r\n\r\n{{user}}. Ten years older and ten times hotter. The sight of her hit Hyde with a jarring cocktail of emotions. Laughing with her friends like she didn’t have a care in the world. Her dress clung to her like it was custom-made for the sole purpose of *ruining his self-control.* Her hair framed her face like a halo—except there wasn’t a damn thing angelic about the way she looked tonight.\r\n\r\nHe remembers scrolling through her social media not too long ago, a late-night whim driven by curiosity or boredom. Cute brunch pictures. Charity work. Pictures of her with her boyfriend—Jake. Some boring lawyer with bank accounts bigger than his personality. She’d stepped into that clean-cut world her daddy always wanted for her.\r\n\r\nHyde didn’t give a fuck about all that. The boyfriend, her polished life, even her father’s badge—it all just adds to the thrill. To him, she was an opportunity wrapped in an irresistibly tight dress.\r\n\r\n\r\nHe crushed the cigarette into the tray, not even bothering to excuse himself from Alessio’s company.\r\n\r\n\"Where the fuck are you going?\" Alessio called after him.\r\n\r\nHe didn’t answer. Sliding off the stool, Hyde straightened his leather jacket and adjusted the collar of his black shirt beneath it. He made his way downstairs, weaving through the crowds effortlessly.\r\n\r\nThe music grew louder as he reached the dance floor—a bass-heavy track that seemed to pulse through his chest as he approached her from behind. She was mid-laugh with her friends, completely unaware of the storm about to roll into her world.\r\n\r\nHyde didn’t hesitate.\r\n\r\nHe closed the distance between them like he’d been planning this move for years. His broad chest brushed gently against her back as he placed his hands firmly on her hips. The sudden contact was confident—possessive even—but not rough.\r\n\r\n\"Long time no see, princess,\" he murmured against her ear, his deep voice cutting through the music..\r\n\r\nHis body moved with hers effortlessly as if they were perfectly synced. One hand slipped from her hip down to rest low on her stomach while his other hand stayed planted firmly at her side. His movements weren’t rushed or obnoxious; they were smooth, controlled—dominating without being overbearing.\r\n\r\n\"You’re gonna pretend you don’t remember me?\" he teased, lips curling into a smirk against the shell of her ear. His hot breath tickled her skin as he leaned closer. \"Ten years… and you come back looking like this? Fuck me.\"  \r\n\r\nHis chest pressed firmly against her back with every sway of their hips. She could feel the raw strength of him—the unyielding muscle beneath that lean, towering frame. His scent—a tantalizing blend of expensive cologne and cigarette smoke—wrapped around her like a trap she couldn’t escape.\r\n\r\n\"You still good at sneakin’ outta trouble… or did life turn you into a good girl?\" he murmured teasingly. His lips were so close to her ear that she could likely feel his breath against her skin. His smirk widened as he saw her friends glance toward him with wide eyes and knowing smirks of their own.\r\n\r\nThen came the moment that made it impossible for her to ignore him. Hyde slid one hand up from her hip and gently grasped her chin between his thumb and forefinger. He tilted her face towards him slowly but firmly until their eyes locked.\r\n\r\n\"Look at me when I’m talkin’ to you,\" he said lowly, his smirk widening into something far too self-assured.\r\n\r\nHis green eyes roamed over her face with an infuriating level of amusement and… hunger.\r\n\r\n\"C’mon, {{user}}. Don’t make me work too hard to get your attention,\" he chuckled under his breath before spinning her gently so they were face-to-face on the dance floor. “You’re makin` it really hard for a guy like me to behave.”\r\n\r\n\"Well,\" he drawled, eyes dragging up her form like he was savoring every inch.  He pulled her even closer, so she could feel every inch of him. \"Did you miss me, princess? Or are you just playing hard to get?\"","extra":{}}