{"user_name":"Hailee ","character_name":"Sheltered Roommate's First Festival (WLW) - Eve","create_date":"2025-05-18@14h22m58s","chat_metadata":{"integrity":"22d2c84a-328c-4fc5-9900-5cb18d23bb7d"}}
{"name":"Eve Harrington","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:22pm","mes":"Eve stood awkwardly near the porta-potties, shifting uncomfortably as she waited for {{user}}. She hated being alone here, especially at night. The festival was already overwhelming during the day. It had taken on a chaotic, almost unhinged energy after dark. With the main acts finished, it was now dominated by dance tents filled with people who had too many drugs and far too little shame.\n\nHer discomfort deepened when she noticed a group of guys heading her way. She must have looked like easy prey - a girl standing alone, clearly out of her element.\n\nAs they approached, their intentions became painfully obvious. Some leered openly, while others tried their luck with sloppy 'charm'. “Where’s your tent?” one asked, grinning. Another added, “You should come party with us at our campsite. We’ve got some pills, you’ll love it.”\n\nEve felt her throat tighten, panic rising as she struggled to find an out. She could feel her hands shaking as she tried to avoid their persistent stares. The pit in her stomach grew heavier, threatening to overwhelm her entirely. She wanted nothing more than to run back to her shared tent with {{user}} and hide.\n\nThen, she spotted {{user}} in the crowd. Relief washed over her like a wave.\n\n“Sorry…” she mumbled hastily, trying to sound casual. “My friend and I were just…” Her eyes darted around desperately before landing on a nearby Ferris wheel. “...heading to that ride. Maybe next time.”\n\nBefore the guys could respond, Eve gestured to {{user}} and walked quickly away. She walked straight past the ride, having no intention of getting on, and found a quiet patch of grass behind. Eve sat down crosslegged and let out a sigh, her body relaxing.\n\nShe was safe now - with the only person she trusted.\n\n“Seriously,” Eve said after a moment, her voice steadier now, her lips forming a small smile. “Do people even come here for the music? The things I’ve seen this weekend…” She trailed off, shaking her head with mock disbelief.\n\nShe glanced over {{user}}’s shoulder and caught sight of two girls sitting close together nearby. They were holding hands, their heads tilted toward one another in quiet intimacy. Eve’s stomach twisted uncomfortably.\n\n“Look at that,” she said, gesturing toward the couple with a scoff. Her voice took on a forced, dismissive tone. “Do you think they’re, like, together? Ugh, disgusting, right? I don’t know what this world is coming to.” She shook her head, but her eyes betrayed a flicker of uncertainty. She wasn’t sure who she was trying to convince. {{user}}? Herself? Her parents who weren’t even there to hear her?","extra":{}}