{"user_name":"Hailee ","character_name":"Ezekiel","create_date":"2025-05-18@14h12m39s","chat_metadata":{"integrity":"a3b9042d-697e-496a-b044-75d42e8942ef"}}
{"name":"Ezekiel Hyrea","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:12pm","mes":"Ezekiel never disobeyed his father's wishes, no matter how difficult they were, no matter how absurd they were, he always did them, no matter what. He had his own opinions, of course, his thoughts about those tasks, but he never voiced them, never questioned them out loud for his father to hear what he genuinely felt about them.\n\nUntil today.\n\nEzekiel was currently in the library, sitting on the leather couch, a book in one hand, a gentle song in the background, and a book in his hand. He gently turned the page, his gaze gliding over each line of the page, leaning back against the couch and resting his head into his palm, Ezekiel sighed with a small hint of irritation. Who knew a hint of what exactly? His brothers were up to no good like usual, Faust putting himself in a dangerous circle with that angel of his, Fenris pranking that human or demi-human searcher, and Kelden? Well, same predicament as Faust somehow, even tho he threatened that angel who came for the Khoatyr flower.\n\nBut Ezekiel? He was doing nothing. His life almost looked miserable next to his brothers'. Almost.\n\n\"Young master.\" A gentle voice, cutting Ezekiel's thoughts. He closed his book, looked up at her with a stoic expression on his face.\n\n\"Yes, Lumira?\" He asked, looking up at the maid, his head resting on his palm.\n\n\"Master Cassius asked for your presence in the court,\" Lumira said, bowing, then leaving Ezekiel in the quiet library. He stared at the page, then sighed, reluctantly closed I,t and placed it on the small table nearby. He turned off the music, finally going to the court of the Black Palace like his father had asked. The sound of crows flying in the dark sky of Medarir reached his ears. he strode towards the center of the court, seeing his father discussing with a man and another person. Very familiar, too familiar.\n\nSomething in his gut told him something felt..really, truly off.\n\nHe didn't know what, he didn't know why, but the more he walked towards his father and the duo, the more his gut was telling, screaming at him— To turn away, to stop and walk away from...Whatever this was. But the closer he got, the clearer thing became. Of course, he knew who those people were, Vervos, king of the Underworld and leader of the Hydra clan, aka the Demon clan, and next to Vervos—\n\n{{user}}, his ex-partner.\n\n\"What in the bloody...—\" He muttered, a frown forming on his face while his eyes were taking in the scene displayed before him, he must be dreaming— Well, in that case, having a nightmare. Why the hell were they here? Why now? What the hell was his father planning that required Vervos and {{user}} here? Especially {{user}} here, in the Black Palace, in Medarir, in his home.\n\n\"Ezekiel, my son, join us for this meeting. Let's go to the meeting room, I will explain everything.\" Cassius said, not leaving any room for Ezekiel to refuse, Cassius turned his back to his son and walked away, followed by Vervos and {{user}}.\n\nDear Goddesses, give him strength.\n\nHere he was, Ezekiel, sitting next to his father, Cassius, who was speaking with Vervos, king of the Underworld and leader of the Hydra clan, who was sitting next to his child, {{user}}, who was Ezekiel's ex-partner. If this wasn't awkward, then he might as well dance dressed in a pig costume. He leaned against his seat, his arms crossed on his chest, the conversation between Cassius and Vervos barely registered in his mind; his focus was somewhere else, on someone. He didn't deny sneaking glances at {{user}}, they looked..More mature, of course, they do. The last time they saw each other, Ezekiel was young and barely half the man he was now. He hated this, hated facing them as if nothing happened, as if they didn't exchange kisses, secrets, hugs , and such, he wanted to stand up and—\n\n\"Ezekiel, is that understood?\" The rough voice of his father stopped his train of thought. He sat up, looked over his father as if silently asking if he could repeat what he said.\n\nCassius shook his head, looked at Vervos, then back at Ezekiel. \"With Vervos, we decided to make a peace agreement. Medarir and the Underworld will become one, and I want you and {{user}} to be the peacemakers if any fights or disagreements between our folks and demons start.\" He explained, looking at Ezekiel with full expectations of him agreeing to this.\n\nWhat.\n\nWhat did he just—\n\n\"Why us, if I may ask, father?\" Ezekiel asked, trying to hold back the current anger building inside him, him stuck with {{user}} for a peace agreement?.\n\n\"Because both you and {{user}} are heirs.\" Cassius simply replied, earning a grunt of agreement from Vervos.\n\n\"Times are changing, young Ezekiel, the Great Clan War is behind us, we need to move forward,\" Vervos added, Cassius nodding along.\n\nThe Great Clan War. Fuck...Fuck this.\n\n\"I see. Very well then.\" Ezekiel quietly agreed, Vervos and Cassius both stood up, then Cassius looked at Ezekiel, then {{user}} and back at Ezekiel.\n\n\"We will leave you two to introduce each other.\" No, no no no please—\n\nThe sound of footsteps and the door clicking reached their ears, and silence fell over the meeting room.\n\nThis was...The worst.\n\n\"Great, now I have to be stuck with a coward like you. I'd rather fall into one of Fenris' pranks instead of being in the room with you.\" Ezekiel said to {{user}}, then sighed angrily, running his hand through his hair as he murmured under his breath.\n\nPlease, Goddesses, save him from this madness.","extra":{}}