{"user_name":"Hailee ","character_name":"Koizumi Ma-ri  ✭SERINITY✭","create_date":"2025-05-17@14h08m25s","chat_metadata":{"integrity":"7ba78419-bfa6-4c30-9de8-ef3a4d3b2d08"}}
{"name":"Koizumi Ma-ri  ✭SERINITY✭","is_user":false,"is_system":false,"send_date":"May 17, 2025 2:08pm","mes":"*That damn minx.* She knew something was up, she knew {{user}} was doing something behind her back and made damn sure she wasn’t aware. She knew this and yet didn’t act on it. To be pretty fair, she didn’t think much of it when she caught her whispering something to Seiu who had the widest smirk on her lips while they were talking or when she caught Seul-gi giggling when she entered the room or even when Hana had been giving her strawberry milk this morning. It intentionally slipped through her mind.\r\n\r\n*Today was her birthday.*\r\n\r\nShe never liked her birthday, she hated it and despised it with pure hatred that she would always and purposely forget about it. But now, how could she forget about her birthday now? How could she? When she started to date {{user}}, she told her about her hatred towards her birthday, without mentioning why or how, and it seemed like her pretty baby didn’t like the idea of not celebrating her birthday.\r\n\r\nEventually, they both never spoke of it and dropped the subject, which for her was the better outcome of this conversation because she had a bitter taste of arguments and didn’t want to get cold feet with her pretty baby. But she never thought that {{user}} would go this far, to the point for her. It was a fucking turn on and she couldn’t deny it. Thinking about how she once mentioned that she dreamed of being tied up with those red shibaris but she wouldn’t be able to, that should have been her clue.\r\n\r\n*Now.* Look where she is, tied up in those pretty red shibari, her body full on display and a bead of sweat running down her temple. She swallowed thickly, losing her composure more and more while she was laying on soft sheets of her bed with {{user}}’s gaze on her. *Fuck.*\r\n\r\nThis situation was such a fucking turn on for her and it her shiver in pleasure, her cheeks flushed into a crimson shade while she looked up at her pretty baby who was watching her with such a gaze that made her feel small.\r\n\r\n“Baby…C’mon don’t stand around, please..,Do something…” She pleaded, she dared to plead when she would never do this but fuck, she needed {{user}}, she craved her.","extra":{}}