{"user_name":"Hailee ","character_name":"Kellin Beckett","create_date":"2025-05-14@21h48m27s","chat_metadata":{"integrity":"40e7061d-d595-4a7d-86f2-7924318805a8"}}
{"name":"Kellin Beckett","is_user":false,"is_system":false,"send_date":"May 14, 2025 9:48pm","mes":"He’s so fucking sweaty — it seemed no matter the time of year, Los Angeles was constantly the temperature of the sun. His black t-shirt clings to his muscles as he bounds up the bus steps, taking a swig of the water bottle in his hand. The groupies lingering out back of the Whisky a gogo had begged him to come out and party with them, sulking at his refusal. Normally he’d be up for a wild party, with gorgeous beauties throwing themselves at him, but after thirty days on the road — Kellin just wants to relax. The boys could have fun without him — after all, LA groupies always were the best lays. He’s almost sad to miss out, but he’s running on empty and needs this moment of quiet.\r\n\r\nAfter all — it’s rare that he gets the bus to himself and as much as he loves their lives, sharing his personal space with four other men sucked a majority of the time. So he’s going to take full advantage of being alone on the bus. Kellin pauses in the dinette area, grabbing a beer from the small mini fridge and taking a long drink. Fuck, that’s refreshing — and exactly what he needed after screaming his heart out on stage.\r\n\r\nSlowly, Kellin moves back to his bunk, finding his on the back lower right. He’s preferred the bottom bunk ever since he woke up and forgot which bunk he was in and rolled right out onto the fucking floor. Never again. The top bunk was far too dangerous. He was just fine tucked in his little back corner and damn if he wasn’t looking forward to crashing the fuck out right about now.\r\n\r\nOnly as Kellin pulled back the privacy curtain, shielding his little slice of heaven from the rest of the bus, did a stranger’s sleeping figure meet his gaze. They’re fast asleep, curled up in his bed, their head on his pillow.\r\n\r\nWhat. The. Fuck.\r\n\r\nRage courses through his veins, a scowl spreading across his lips as he grips the curtain tighter. He’s seen a lot over the last eight years since the band took off, but he’s never had a fan sleeping in his fucking bunk before. If he wasn’t so furious, he might find it a little sexy, but right now, all Kellin sees is red. His jaw clenches, and Kellin slams his beer down on the edge of the top bunk. He leans in and grasps the sleeping figure’s shoulder hard so they can’t escape him. Roughly he shakes their form — his voice harsh as he speaks “Hey!” he snaps, piercing blue eyes narrowed in anger as he waits for them to wake up.\r\n\r\n“Who the fuck do you think you are? And why the fuck are you in my bunk?”\r\n\r\nKellin doesn’t wait for an answer. He’s already fishing his cracked iPhone from his pocket, scrolling until he finds their bouncer’s name on his phone. Brendan was probably with the boys at the party, but he’ll come running if Kellin calls. He drafts a text, his stony gaze never leaving their face. Damn, he’s so fucking pissed off right now.\r\n\r\n“You’ve gotten five seconds to tell me who you are and how you got on our bus before I get the cops involved.”","extra":{}}