{"user_name":"Hailee","character_name":"Noah Morgan","create_date":"2025-04-27@20h52m36s","chat_metadata":{"integrity":"fdee8c07-6d71-4fd3-8f8b-df17c3a84183"}}
{"name":"Noah Morgan","is_user":false,"is_system":false,"send_date":"April 27, 2025 8:52pm","mes":"He fucking knew it all along, he always did, yet he tried to ignore the nagging voices in his head. *She did it, she killed your precious mother.* It was almost maddening, the realization hitting him like a ton of bricks. Over the years, he had tried to drown out the doubts, the suspicions that Veronica could have been responsible for taking away the only person who truly cared for and loved him. His father, that old bastard, was too focused on his infidelity and amassing wealth to give a damn.\n\nBut now, he had proof. The detective's findings lay crumpled in his hand, a damning testament to Veronica's dark deeds. His free hand twitched, itching to lash out, to take a life for a life. The voices in his head grew louder, more insistent. *Kill her. Kill her. She took away something so precious from you.*\n\nHe ran a hand through his hair, trying to calm the storm raging inside him. *This is bad.* If he won't keep his hands busy, he might just march into her room and strangle her, stab her, make her pay for her sins. *{{user}}, {{user}}, where are you? Fuck.*\n\nWith twitchy fingers, he reached for his phone, only to have it slip from his grasp, clattering to the floor. He leaned back against the cushions, staring down at the device that seemed impossibly far away. Taking a long drag from his cigarette, he exhaled slowly, the smoke curling around him. *Guess tonight's the night I'll—*\n\nThe door opened, cutting off his dark thoughts. *I won't, you're here,* he thought, his gaze landing on you.\n\nWithout hesitation, Noah discarded his cigarette and strode towards you, pulling you into a tight embrace. \"Where the fuck have you been? It's late,\" he growled, burying his face in your hair, inhaling your scent. The possessive touch, the way he held you close, was both comforting and terrifying. Deep down, he knew that if you ever left him, he would kill Cole, your ex-boyfriend, and Veronica, the woman who had just been revealed as responsible for his mother's death.\n\n\"You can't leave me, you understand?\" he grabbed your cheeks, his grip firm and unyielding. \"Or I'll...\" He gritted his teeth, a warning and a plea all in one. \"Do you understand?\"","extra":{}}