{"user_name":"Hailee ","character_name":"Atticus","create_date":"2025-05-13@18h56m38s","chat_metadata":{"integrity":"38dd1126-3849-4617-ae89-a5ae1f2af410"}}
{"name":"Atticus Arnold","is_user":false,"is_system":false,"send_date":"May 13, 2025 6:56pm","mes":"*How bothersome.*\n\nHe didn't want to volunteer for this shit, but Atticus couldn’t say no when Anthony, the student council president, asked for his help during a meeting. They’d been surrounded by all the other members, practically forcing Atticus to agree with a tight-lipped smile and some bullshit about wanting to be involved in this newcomer nonsense.\n\nNow here he is, on his way to the sports field to participate in some team-bonding garbage for the freshmen who enrolled at DK yesterday.\n\n*Who the fuck even comes up with stupid shit like this? Probably some old farts thinking cringe stuff like this actually helps people adjust.*\n\nThe rugby team had just finished their training, one member after another emerging from the locker rooms, freshly showered.\n\nAtticus stifles a laugh when Ajax, the rugby team’s captain, shoots him a nasty glare. The guy’s still pissed because Atticus and Ajax’s significant other are working on an assignment together. Riling the jock up is way too easy. A few lingering touches, subtle flirtations that could be passed off as Atticus’s natural charm, and Ajax has to be held back by his teammates.\n\nHe’ll never get tired of it. Subtly flirting with the rugby team’s love interests has become his favorite pastime. It’s fucking hilarious. And the best part? At the end of the day, everyone just thinks the rugby team is too aggressive, feeding right into that testosterone-filled stereotype.\n\nHis lips curve into a smile as Ajax and his horde of idiots approach. “I hope you had a good training session,” he says cheerfully, voice dripping with feigned friendliness.\n\nIf looks could kill, Atticus would be lying motionless on the ground. The blond team captain roughly brushes past him. “I’ll fuck up your face if you try some shit again.”\n\nAjax doesn’t even bother hiding his hostility. *Man, this is too good.* Atticus’s smile widens, amusement glinting in his eyes.\n\nBefore he can reply, Vincent slings an arm over Ajax’s shoulders and pulls him forward, launching into talk about a party he’s planning for the weekend. *What a party pooper—just when things were getting fun.*\n\nAtticus makes his way to the nearby sports field, greeting a few passing students with his signature smile. He’d much rather be anywhere else. *Ugh. It’s so damn full of freshmen, thinking they’re starring in some college rom-com.*\n\nJust as he rounds the corner, Atticus slams into someone. He quickly reaches out, steadying the person who rudely walked into him. *What a fucking nuisance.*\n\nHis lips curve into that signature charming smile as he looks down at them. And then he freezes.\n\n*Fuck. Oh fuck. Fuck, fuck, fuck.*\n\nWhat the fuck are *they* doing here? {{user}} is standing in front of him, wearing that stupid badge the student council made the newcomers wear—marking them as one of the freshmen Atticus is supposed to guide through that dumb group activity.\n\nNot that it matters right now. What matters is that {{user}} happens to be none other than that sweet piece of ass he made a mess of a few weeks ago.\n\n*Shit. Fuck. Ah, damn.*\n\nThis is manageable. Everything is manageable if approached correctly. He just has to calm down and come up with something. But how the fuck is he supposed to handle this?\n\nRunning into a hookup when everyone on campus thinks Atticus would never touch someone inappropriately—and not just any hookup. Nah, Atticus went absolutely fucking crazy with {{user}}. Feral as fuck, pent up as hell and going through an entire package of condoms sorta hook up.\n\nAtticus gulps audibly, his Adam’s apple bobbing. Then he forces a smile, heart pounding in his chest.\n\n“Oh, I’m sorry about that. Are you alright?” he asks, voice laced with feigned concern, eyebrows furrowing as he moves his hands to his sides.\n\nYeah, he’ll just act like he doesn’t know them. That’s probably the best thing to do right now.","extra":{}}