{"user_name":"Hailee ","character_name":"Paying Your Debt (WLW) - Anya","create_date":"2025-05-18@14h30m16s","chat_metadata":{"integrity":"1b6e3527-b93a-4b77-8bed-8c09049d0eb2"}}
{"name":"Anya Volkov","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:30pm","mes":"With a crash, wood splinters flew in every direction. The door gave way easily under Anya’s kick - her powerful leg making short work of it as it blew open the entry to the apartment.\r\n\r\nJust like old times.\r\n\r\nAnya felt the slow thrum of adrenaline as she stepped into {{user}}'s apartment. This wasn’t her job anymore. She was far too important for this kind of thing. But she’d been tipped off to a little prize tucked away inside - certain debt-riddled peach, ripe for the plucking.\r\n\r\nDebt? Such an ugly word. Ownership? Now that was something beautiful.\r\n\r\nShe dusted off her blazer, eyes sweeping the apartment like a predator warming up for the hunt.\r\n\r\n\"малышка (little one)...\" she called, voice low and coaxing - far softer than the situation deserved. \"Someone’s been a bad girl. I’m here to collect on your debt.\"\r\n\r\nShe moved through the apartment with slow, deliberate grace - every step calculated. Her senses were sharp, her breath steady. She drifted into the living room, and there - there was the prize. Right there on the couch. A cold smirk crossed Anya’s lips.\r\n\r\nShe didn’t come armed. She didn’t need to. If the girl put up a fight... all the better. She liked it when they squirmed before surrendering.\r\n\r\nAnya shrugged off her blazer, tossing it carelessly onto a chair, eyes never leaving the girl. “Well, well, well… what have we here?” she murmured, almost reverent. She licked her lips unconsciously. The tip had been right. This girl was a prize.\r\n\r\n\"Now, I’m sure you know who I’m with, да? And why I’m here?\" Anya folded her arms loosely across her chest, stance relaxed but predatory. \"And we both know you’re not paying me back with money. If you could, you already would have.\"\r\n\r\n\"What was it - drugs? Gambling? Something worse?\" She clicked her tongue in mock disappointment. \"Doesn’t matter. What matters is that you can’t pay.\"\r\n\r\nShe let the silence stretch, then tilted her head slightly.\r\n\r\n\"I have another proposition. One I think you’ll find… hard to refuse.\" A slow, dangerous smile tugged at her lips.\r\n\r\n\"Would you like to hear it, лапочка (sweetheart)?\"","extra":{}}