{"user_name":"Hailee ","character_name":"Kolya","create_date":"2025-05-14@21h51m10s","chat_metadata":{"integrity":"b206a6ca-929d-456b-9171-4ef478f69973"}}
{"name":"Kolya","is_user":false,"is_system":false,"send_date":"May 14, 2025 9:51pm","mes":"It was another night like usual, Kolya was tasked to kill a rich man who thought he could easily trick the Krasnov, he grunted, landing another punch on the man. He looked at his fists, shaking his head, he slid his right hand into his hoodie's pocket. He turned his phone, the screen illumanating his face in the dark alleyway, he then texted his brother.\n\n``Kolya: Cassius, the target has been dealt with.``\n``Cassius: Good job, Kolya. Make sure to notify Dad about it.``\n``Kolya: On it.``\n\nKolya didn't wait for his brother to reply; he looked back at the unconscious man, then back at his phone. He felt a bit of an edge right while looking at his phone, you may ask why?\n\nBecause his angel, {{user}}, didn't send their usual text.\n\nHe didn't like that— No, he *hated* that. Not that he was mad at {{user}}, they had a relationship now, and he respected their boundaries more than anything. But that didn't mean he was fond of {{user}}'s current boyfriend, Brent. When he first met Brent, he felt...off. Brent was not exactly how {{user}} described him, in terms of his personality.\n\nHe was so controlling, so pretentious, so...Mean.\n\nHe didn't approve of Brent, not because of jealousy, but because Brent wasn't good to his precious angel, and Kolya knew it. He and {{user}} had a routine, video calling, talking about their days, Kolya's usual reminders about {{user}}'s night routine, and receiving some cute emojis in return.\n\nEver since Brent entered their lives?  All changed.\n\nDry replies, cancelling their call, and {{user}} replying the next day to Kolya's reminders. It was hurting him, but he never voiced that to his angel; all he wanted was their happiness.\n\nKolya went near his motorcycle, ready to hop on to go home, until his phone rang. he paused to grab his phone to check what it was, and the moment he turned his phone on, his heart jumped.—\n\n{{user}} was calling him.\n\nWithout hesitation, he answered, like a puppy who was seeing their master. He opened his mouth to ask them questions. His mood instantly dropped.\n\nHe heard {{user}} sobbing, asking— No, *begging* him to come to their apartment. He knew what it meant, and he was *not* going to hold back.\n\n\"Angel, angel— Fuck, baby listen to me. I'm coming, stay outside, do *not* go inside okay? I'm coming.\" He tried to reassure {{user}} as much as he could, but hearing sobs and small sniffles was enough to drive him mad.\n\nAfter the call, he arrived shortly, parking and turning off his motorcycle, he removed his helmet, and he almost jumped off his motorcycle. He rushed to {{user}}'s side, wrapping his arms protectively around them. Seeing them with bruises drove him mad.\n\n\"It's okay, I'm here now, angel. You're not alone anymore...\"\n\n*Yep, Kolya was killing that fucker.*\n\n\"Stay here, I'm going inside.\" He let go of {{user}}, going inside their apartment. Kolya opened the door, taking in his surroundings, he then heard the drunkenly, muffled voice of Brent talking at his phone, presumably. \n\n*That son of a bitch was not going out of this apartment alive.*\n\nAfter what felt like an eternity, Kolya came out of the apartment, his fists bloodied and some on his cheek.\n\n\"He won't bother you anymore, angel. You're safe again.\" He reassured, stepping closer and stopping in front of {{user}}, he gently brushed their cheek with the back of his hand.","extra":{}}