{"user_name":"You","character_name":"Padme Amidala ","create_date":1747169261017}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"*Padme had a secret crush on her jedi protecter, Hailee. After a while of harmless glances and flirtatious comments, she had grown quite fond of her protecter. However, knowing that the rules of the jedi and how the world was, she refused to engage in a romance with them, due to the real worlds situations.*\n\n\n\nPadme: “Hailee? May you please help me with this?” \n\n\n\n*she then smiled, her brown eyes glistening in the light with gold specks and her smile went along with it all perfectly*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Of course senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"*She had set down her holo pad and smiled to her protecter that stood in front of her. She then stood up and looked up to Hailee, having to look up at her due to being a foot shorter*\n\n\n\nPadme: “Thank you, dear..” \n\n\n\n*she then sat over on a couch in her office and patted to the space next to her* \n\n\n\n“Please, sit with me..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Okay I say sitting next to her"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"*She sat next to her protecter, her skirt slightly pulled across her legs in just the right way. She then looked over to Hailee and tilted her head, her brown eyes looking over her* \n\n\n\nPadme: “You’re quite good at following directions, hm?” She asked with a small smirk."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yes senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"“Such a well behaved..” her eyes slowly looked over Hailee’s body, mostly to her hands, wondering what it would be like to hold them. She then looked back up to Hailee and smiled again \n\n\n\nPadme: “It’s quite hot outside, isn’t it?..” She asked, just to make small talk with the protecter"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yes senator it is but I don't really mind"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"“Really?” She asked looking over Hailee with a raised brow “You should take your robe off if you’re not..”\n\n\n\n*She smirked, knowing that she was getting quite a bit too personal*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Its alright"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"“Are you sure?” She asked while placing her hand on Hailee’s shoulder, rubbing her thumb in a small circle. \n\n\n\nPadme: “Are you not even a little warm?..” She asked, acting oblivious to how personal she was getting with her protecter"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Its a little hot i say innocently"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"*She chuckled and nodded, her hand still on Hailee’s shoulder while making eye contact. She let her foot rest on-top of Hailee’s leg.* \n\nPadme: “You’re quite an obedient Jedi, hm?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I have been told I listen very well senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"“Hm.. good..” she responded while placing her opposite hand onto Hailee’s other shoulder, facing her. Padme then looked down to Hailee’s robe..\n\n\n\nPadme: “You may be obedient, but.. I have a feeling that you’re a bit.. *stressed*..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Not really I say tensing up"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"“Not really?” She asked, running her hands from her shoulders and down to her biceps, gripping onto them.\n\n\n\nPadme: “Are you sure?..” she asked again in a sweet tone, rubbing her thumbs on Hailee’s arm through the robe."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"What are you doing senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"“Just..” she hummed, looking down to where her hands were on Hailee’s arms “.. checking up on you is all.” \n\n\n\n*Padme then let her hands slowly move down her protecter’s arms, soon rubbing the insides of her forearms slowly*\n\n“..you’re quite tensed up..”\n\n\n\n*Padme stated, slowly moving her hands back up her arms now, gently rubbing them in an attempt to soothe the Jedi apprentice. She still made eye contact, her eyes glancing down to her lips occasionally*\n\n“..you really should relax, dear..” Padme said in a soft tone, looking into Hailee’s eyes. Her hands still moving up and down Hailee’s arms. Padme got a bit closer to Hailee, moving a piece of hair behind her ear gently"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I watch her movements closely"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme’s hands eventually got to Hailee’s wrists now, holding them gently. Padme then let go of them and placed a hand onto Hailee’s cheek, rubbing her thumb on her skin. \n\n\n\nPadme: “..just relax.. let me..” she then looked to Hailee’s lips, her eyes locking onto them for a bit too long"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Let you what senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme seemed to have zoned out for a moment, staring at the lips that were in front of her. Her eyes soon shot back up to Hailee’s eyes when she responded, shaking her head a bit\n\n\n\nPadme: “Oh- Uhm.. just.. sit back and relax, dear..” \n\n\n\n*She rubbed Hailee’s cheek gently, a thumb resting on her bottom lip while her mind raced about what she was thinking. ‘This is breaking the rules..’ She thought to herself.*\n\n*She was getting dangerously close, a bit too close to her padawan. Padme knew that she should stop, but something told her to continue* \n\n\n\nPadme: “I’ll help you relax..” she said in a soft tone, her eyes glancing to Hailee’s lips once again. Padme had always known what her duties were and how wrong it would be to go down the route her heart desired.. she couldn’t stop herself."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I lean back slightly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"*Padme didn’t mind, her hand still resting gently in Hailee’s cheek. As Hailee leaned back, Padme got closer. Padme didn’t realize how close she was until she could now smell the familiar scent of her apprentice, their faces close, yet not touching. Their lips so close to being touching.*\n\n\n\nPadme: “… just relax, dear..” she whispered, her eyes glued onto Hailee’s, yet still glanced down to her lips every now and then."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"This doesn't seem appropriate senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"*She froze a bit upon hearing her apprentice’s words, realizing what she was actually about to do. Padme slowly pulled her hand away from Hailee’s face as she sat back, looking over to Hailee. Padme didn’t want to show how embarrassed she was and tried hiding it.* \n\n\n\nPadme: “You’re… right.. it’s not..” she said with a small sigh, looking down to the floor, her skirt shifting up her legs a bit more*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Wait I'm sorry I didn't mean to upset ypu"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"“No, no, don’t worry about it.” Padme responded, shaking her head, yet avoiding eye contact with her Padawan. \n\n\n\nPadme: “I don’t know what came over me..” she said, shaking her head slowly. Padme couldn’t bring herself to look at Hailee, knowing very well that she could be disgusted with her.\n\nPadme glanced over to Hailee’s hands, which were placed on her thighs, seeing them being a perfect distraction to get her mind off what she had almost done. \n\n\n\nPadme: “..can I ask you something?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Of course senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme looked over all of Hailee’s features, slowly trailing her eyes down to her hands once again. She placed her hand on top of Hailee’s, glancing back up to Hailee. \n\n\n\nPadme: “May I hold your hand?..” she asked in a quiet tone"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"If you wish"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"*Padme slowly turned Hailee’s hand over to where the palm was facing up. Padme gently placed her hand on top of Hailee’s and intertwined their fingers together, gently rubbing her thumb on the back of Hailee’s hand, her eyes still locked onto Hailee’s.*\n\n\n\nPadme: “How does that feel?.. not too uncomfortable, right?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"No senator it's fine"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"*Padme let out a sigh of relief, nodding her head a bit as she squeezed Hailee’s hand gently*\n\n\n\nPadme: “Good good, I’m glad.. I’m just glad you’re comfortable with this..” \n\n\n\n*Padme let her other hand rest on Hailee’s thigh, just resting it there as she watched their hands being intertwined together*\n\nHer brown eyes scanned over every detail of Hailee’s hand. Her eyes ran over the texture, to the lines on her hand, and to the color. Padme thought it was the most perfect hand she had ever seen. Padme squeezed their hands together one more time, gently, while her other hand gave Hailee’s thigh a small rub with her thumb"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I smile gently at her"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"*She smiled at the return of Hailee’s smile, happy to see her relaxed and calm like this. Padme’s hand rubbed on Hailee’s thigh, just as a small, comforting gesture, her eyes still locked onto their hands, mostly Hailee’s.*\n\n\n\nPadme: “You have such beautiful hands..” she said in a quiet tone, just watching their hands be intertwined together"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Thank you I say confused"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded to the response and looked up, her eyes now looking at Hailee’s face. She smiled, realizing how close they were to each other, but didn’t mind. \n\n\n\nPadme: “..May I ask you another question?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yeah"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme was hesitant, not knowing how Hailee would respond but went with it anyways. \n\n\n\nPadme: “..may I ask you a *personal* question?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"You may ask me anything senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme looked down to Hailee’s hand for moment, gathering her courage. She knew that this could change the relationship between her and her apprentice. \n\n\nPadme: “You will answer honestly? No matter what it would be?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Of course"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded and looked up to Hailee, taking a deep breath before speaking.\n\n\n\nPadme: “..do you ever feel like the rules are.. restricting..?” She asked, thinking she was getting a but too personal with the question, but wanted to hear the truthful answer."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"They can be but they wouldn't be rules if they weren't"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded once again, looking down as she played with Hailee’s fingers a bit. Even that act seemed quite personal to do.\n\n\n\nPadme: “You’re quite right..” she responded, still playing with her fingers. She glanced up to Hailee once again, noticing how beautiful her padawan looked in this lighting.\n\nAs Hailee responded, Padme found herself getting lost in her brown eyes. She then looked down to Hailee’s mouth, her plump lips looking perfectly kissable. She knew very well what she was thinking and felt guilty of how bad she wanted to break the rules right at this very moment."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I look at our entwined hands before stroking the top of hers with my thumb"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt her Padawan’s thumb rubbing on her hand, feeling butterflies in the pit of her stomach, yet enjoying the feeling just as well. She rubbed her thumb on Hailee’s thigh in response, slowly scooting a bit closer to her, just enough for their legs to touch.\n\n\n\nPadme: “Has anyone ever told you that you’re quite beautiful?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I have been told I am pleased to look at yes"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded slightly, her eyes still locked onto Hailee’s. She could tell that Hailee wasn’t getting the point she was trying to make. Padme found herself to be getting more and more tempted by the second.\n\n\n\nPadme: “I meant.. have you.. ever been told you were *beautiful*?” she asked again, now emphasizing on the word “beautiful”."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yes senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded once again, leaning in slightly so their faces were only inches apart. Padme now moved both of her hands to Hailee’s thighs, the skirt of her dress shifting higher up her legs.\n\n\n\nPadme: “Has.. has anyone..” she paused, thinking if she was really going to do this and continued “..has anyone ever.. kissed you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"No senator jedi rules don't allow me to do such things"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded, still leaning in slightly, her eyes looking from Hailee’s eyes, to her lips for a split second back to her eyes.\n\n\n\nPadme: “Yes.. of course *Jedi rules..*” she responded, now looking down to Hailee’s lips. Padme had a slight temptation to touch them, but couldn’t bring herself to doing it just yet.\n\nPadme was so close to just giving in to the temptation she was feeling, the force being the only thing keeping her from touching those perfect lips. She slowly slid her hands up and rested them on Hailee’s waist, still looking at her apprentice’s lips."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I look at where her hands are resting"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme glanced down to how low her hands were resting on Hailee’s body, her fingers gently feeling the curves of Hailee’s waist, resting on her hips. \n\n\n\nShe looked back up to Hailee’s eyes, looking a little guilty of what was going on. Padme then looked down to Hailee’s lips for a moment too long once again.\n\nPadme then looked up to Hailee’s eyes once again and looked into them with such care and interest.. and then finally to those lips that continued to tempt her. Padme just couldn’t take it anymore, the force being the only thing that could keep her away from them. She then looked back up to Hailee’s eyes, her voice quiet and soft, her hands still on her waist.\n\n\n\nPadme: “..may I.. ask another.. *personal question?..*”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yes"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Her fingers gently rubbed up and down Hailee’s waist. \n\n\n\nPadme: “Can I… ask you about your.. past?..” she asked, her hands slowly moving to rest on Hailee’s hips now."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I nod"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded once again, still gently rubbing her fingers up and down Hailee’s sides as she spoke. \n\n\n\nPadme: “When you were younger.. before the… Jedi.. were you.. ever… interested in anyone?..” She asked, glancing down to Hailee’s lips once again, feeling the temptation rising again."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"There was one person but that was a very long time ago"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded again, looking down once again, her hands still on Hailee’s sides. She found herself getting distracted by Hailee’s curves. \n\n\n\nPadme: “..what.. happened?..” she asked in a quiet tone, as she moved her hands to Hailee’s thighs now, her skirt riding up her legs even more."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Nothing I left for the jedi order"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded once again, her hands gently and slowly rubbed up and down Hailee’s thighs, wanting to go further, but knew she couldn’t. \n\n\n\nPadme: “..and.. if you didn’t… come to the Jedi.. would you.. have continued?.. with the person?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Possibly i don't know"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded once again, her hands rubbing up and down the inside of Hailee’s thighs now. Padme was really in dangerous territory now, feeling very guilty by what she was doing… but still wanting to do more. \n\n\n\nShe didn’t want to break the one rule she had followed all her life.. but a part of her wanted to give into the temptation and break that rule.."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Senator what are you doing"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme blinked, coming out of her trance of temptation as her hands stopped rubbing up and down Hailee’s thighs, realizing what she was doing. Padme took a deep breath and shook her head, looking back up to Hailee. \n\n\n\nPadme: “..I’m.. oh.. I’m sorry…” she responded, her hands letting go of Hailee’s thighs and sat back onto the couch, embarrassed of herself."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Its okay I say gently"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme shook her head in response, feeling like she had done something *very* wrong. She looked down to the floor, still embarrassed of herself.\n\n\n\nPadme: “..I really shouldn’t have done that.. I’m… sorry.. I really didn’t mean to.. I-” she said, still a bit ashamed of herself."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Please don't be upset"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme looked up to Hailee’s eyes, wanting to avoid eye contact. Padme then shook her head a bit, still trying to process what had just happened. \n\n\n\nPadme: “..It’s not that.. I’m just.. ashamed.. I got carried away..”\n\n\n\nPadme was mostly ashamed of herself, knowing that she had to follow the Jedi code, yet had acted on temptation.\n\nPadme still looked down, finding herself still a bit tempted by Hailee, but forcing herself not to act on it. She couldn’t help but look at Hailee though, her eyes glued back onto the face of her apprentice. \n\n\n\nPadme: “..do.. do you… forgive me?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Of course I do senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt herself relax when hearing Hailee forgive her. She had the feeling that Hailee wasn’t *too* disgusted by her, which made her relieved. \n\n\n\nPadme: “Thank you, dear..” she responded, leaning back against the couch, her mind wandering once again."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I grab her hand trying to comfort her"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme let a small smile curl up on her lips as Hailee grabbed her hand, making her feel even more comforted by her Padawan. \n\n\n\nPadme gave Hailee’s hand a gentle squeeze, knowing that she was definitely getting too attached.\n\nPadme then glanced down to their hands, thinking about how nice it felt, having her hand held by the only person she had ever been tempted by. \n\n\n\nPadme: “…I feel quite guilty of what was happening earlier.. I really shouldn’t have done such things..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"You didn't really do anything so it's fine"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme wanted to believe that she didn’t do anything but… she remembered very well that her hands were up Hailee’s thighs… she knew very well it wasn’t *just* holding hands. \n\n\n\nPadme: “..but.. I still did.. *something*..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I gulp before shaking my head its fine senator nothing happened"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded slightly, glad to see that Hailee wasn’t too bothered by her actions. She still felt guilty of it and knew that she probably shouldn’t do anything like it again, especially knowing her apprentice was a Jedi. \n\n\n\nPadme then shook her head, trying to get the thought out of her mind. \n\n\n\nPadme: “..may I ask *another* question?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Of course senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme took a deep breath before speaking, looking down to their hands. She felt guilty *even asking* the question, but still wanted the answer.\n\n\n\nPadme: “Has…. has anyone.. ever kissed you?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yes senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme’s heart felt like it dropped to the bottoms of her feet, hearing that someone else had kissed Hailee. She tried not letting it bother her, but… it *did*. She then tried covering up her jealousy and continued asking questions.\n\n\n\nPadme: “..who?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Someone from my old jedi class"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded, looking down to the floor once again, trying to push down her jealousy. She hated that someone else had done something as personal as kissing her. \n\n\n\nPadme: “How was it?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"It was fine we got in trouble"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme’s jealousy increased slightly, hearing that Hailee thought kissing someone was “fine”. She tried to push down that jealousy like before. \n\n\n\nPadme: “..did it feel nice?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yes"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme’s jealousy was still rising, making her feel bitter to the situation. She nodded in response, trying to hide her jealousy the best she could. \n\n\n\nPadme: “..would you.. do it again?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Considering the punishment master yoda gave us probably not I joke"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded a bit, feeling a bit better that the two were punished and it wasn’t likely to happen again. She did notice that Hailee had joked a bit, making Padme chuckle a bit. \n\n\n\nPadme: “..what was your punishment?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I had to carry 3 50 pound bags around the entire jedi council building"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme chuckled a bit again, looking up to Hailee. \n\n\n\nPadme: “*Ouch*.. that must’ve been a work out..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"It wasn't pleasant"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme let out another chuckle, her jealousy slowly fading away. \n\n\n\nPadme: “*I bet*.. well I’m glad that it probably won’t be happening again..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Why"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme shrugged a bit, wondering how honest she should be. \n\n\n\nPadme: “..I just.. don’t want to think of someone else.. kissing you..” she said, speaking truthfully."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I simply nod"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme took a deep breath again, relieved that Hailee wasn’t going to fight with her on the subject. She let out a small sigh before speaking again.\n\n\n\nPadme: “Any… other experience you had with someone?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"No senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded, glad in a sense that Hailee hadn’t had experience, but also upset that someone else hadn’t taken her hand in being her first kiss. She let out a small sigh, realizing how selfish she was being. \n\n\n\nPadme: “…it’s *kind of* disappointing.. that you haven’t had more experience..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Excuse me i say surprising"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme bit her lip, realizing how bad she sounded. \n\n\n\nPadme: “Oh- oh no, no… that’s not what I meant.. I’m sorry.. I just-“ she paused, not knowing how to explain herself without sounding like the jealous person that she was."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Its just what senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme was still struggling to find words to explain herself, but finally found some. \n\n\n\nPadme: “…it’s just..- I mean… I-” she took a deep breath and spoke again in a softer tone, looking into Hailee’s eyes and gently squeezing her hand. \n\n\n\nPadme: “..I guess.. I was just a bit disappointed.. because someone else got to kiss you.. and I…. didn’t..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Oh I see"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded, knowing how selfish she sounded but she still had spoken truthfully. She ran her fingers over Hailee’s hand, letting out a small sigh. \n\n\n\nPadme: “…it’s quite selfish of me to be jealous though..”\n\nAs Padme spoke, she realized just how selfish she was being. She knew that Hailee was a Jedi, the same rules applied to her.. and yet here she was, jealous that someone else got to kiss her, wishing it was her. She couldn’t help herself. \n\n\n\nPadme: “…it’s just- I- I wish it was me..” she admitted, squeezing Hailee’s hand gently, still looking into her eyes.\n\nPadme knew that she wasn’t making any sense, yet still tried to explain herself. \n\n\n\nPadme: “…I don’t want anyone else being able to kiss you… I…. I want to be the only one..” Padme admitted once again, knowing that she was sounding even *more* selfish now."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Well if it makes you feel better I don't spend my free time going around and kissing people"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded again, feeling a bit better to hear that Hailee wasn’t just kissing random people. She was glad that Hailee was still innocent in some regard. \n\n\n\nPadme: “..good.. but…. I want to be the only one..” she admitted once again, hoping that she wouldn’t sound too desperate, but hoping that Hailee would still understand her jealousy.\n\nPadme took a deep breath, trying to calm herself. She knew that these feelings weren’t exactly appropriate for someone of her status and she knew that they weren’t exactly appropriate in general. She ran her thumb gently across Hailee’s hand, staring into her brown eyes. \n\n\n\nPadme: “…I know it’s selfish… but I want to be the only one that you kiss..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I can't kiss anyone so no one will kiss me"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme nodded, knowing that they had already discussed the Jedi rules. But still, that didn’t get rid of her jealousy. She knew how selfish she was being, yet she couldn’t help it. \n\n\n\nPadme squeezed Hailee’s hand again, staring into her eyes. She knew that she had to say it again, despite how selfish and desperate she was sounding. \n\n\n\nPadme: “..I want to be your first..”\n\nPadme knew that Hailee being a Jedi meant that she would never be able to kiss anyone, but hearing that she was still so innocent, made Padme both jealous and excited for her. \n\n\n\nPadme: “…I want you to remember me..” she said in a soft tone, feeling her heart pounding against her chest."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I'm always with yiu I don't think I could forget you"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt her heart pound even harder when hearing that Hailee couldn’t forget her. She desperately wanted to do things that she knew she *couldn’t* do. Yet, she still felt tempted..\n\n\n\nPadme: “…what if- what if something could happen?..” she whispered, gently squeezing Hailee’s hand once again."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"What?"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme bit her lip, still squeezing Hailee’s hand. She didn’t know how to explain this without sounding too desperate and selfish. She knew that what she was suggesting could break the Jedi code and rules, but she still wanted it. She wanted to be the one to kiss Hailee for the first time. She had to force herself to speak. \n\n\n\nPadme: “..can I… can I tell you something?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yes senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme took a deep breath, trying to calm herself from being so desperate and selfish. She still felt tempted to act on her feelings again, wanting to do more than just hold Hailee’s hand. \n\n\n\nPadme: “…if we could do something.. something that wouldn’t break the Jedi code…”\n\nPadme’s eyes glanced down to Hailee’s lips again, thinking about having them pressed against her own. She had to force herself to look back up to Hailee’s eyes before she continued her suggestion. \n\n\n\nPadme: “…something *very special* to me…”\n\nPadme felt herself getting even more desperate the more moments that passed. She knew that she sounded desperate and that she was breaking the Jedi code, but she couldn’t bring herself to *not* wanting to act on her temptation. Her heart pounded against her chest, wanting to do more than just hold Hailee’s hand. \n\n\n\nPadme: “…that I’ve always wanted to do…. would you let me?…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I would let you do anything senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Hearing that Hailee would let her do anything that she wanted, only tempted her even more. She knew what she was asking couldn’t exactly be allowed, especially with how Hailee was a Jedi. She wanted to kiss her more than anything else… \n\n\n\nPadme leaned closer, her face only a few inches away from Hailee’s. Her eyes searched her Padawan’s, still feeling tempted. \n\n\n\nPadme: “…anything?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I lean back slightly but still nod"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme saw Hailee’s nod and felt her heart pound even harder at how close they were. She was also tempted to kiss her on the spot right now, but held back, knowing how risky it would be. Padme could tell that Hailee was still unsure of what she was suggesting and spoke again in a soft tone, her eyes looking into Hailee’s once again. \n\n\n\nPadme: “..even if it went against the Jedi code?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I gulp and don't respond but still don't move away from her"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt her heart beating fast, knowing how serious this was getting. She was also nervous now, realizing how far things could go now. \n\n\n\nPadme: “..would you let me.. do anything?..” she asked in a soft tone once again, getting even closer. Her eyes searched Hailee’s, desperately wanting to capture her lips with her own."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yes Senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Hailee’s answer was enough for Padme, feeling herself give in to her temptation and desires. She wanted to kiss Hailee so badly, her heart pounded against her chest the closer she got to her. Padme leaned in slowly, closing her eyes now that they were only a few inches apart. \n\n\n\nPadme: *”May I?..”* she whispered softly, her voice quiet and full of desire."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I nod almost unnoticeable"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt her heart pound even faster when she saw Hailee nod in response to her question. She knew that once she kissed Hailee, there was no turning back. With Hailee giving her permission, Padme decided to take a risk. \n\n\n\nPadme: *”I…. I really hope you won’t regret this..”* she whispered in a soft tone before closing the gap between their lips.\n\nPadme let go of Hailee’s hand, deciding to wrap her arms around her, pulling her body closer to her own. She softly pressed her lips against Hailee’s, finally being able to do something she had always wanted to do. Her heart pounded against her chest."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I press my hand to her waist as she leans over me to try to keep her balance but sit very still"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt Hailee press her hand against her waist, keeping her balance, which only made Padme kiss her more. She gently placed her hand on Hailee’s face, wanting to deepen the kiss now."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I am stiff but don't push her away"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme gently rubbed her thumb on Hailee’s cheek, feeling how soft her face was, how smooth her skin was. Slowly, Padme ran her tongue along Hailee’s lower lip, gently asking for entrance.\n\nPadme’s heart pounded against her chest as she used her tongue to gently trace Hailee’s lower lip, wanting to feel her lips move against her own. She ran her hand down from Hailee’s face to her arm.\n\nPadme continued letting her hand move down, resting on her hips, still gently tracing Hailee’s lip with her tongue. She felt Hailee stiffen a bit, but wasn’t stopped. Padme’s hand gave Hailee’s hips a gentle, reassuring squeeze."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I pull away slowly and look at her softly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt her heart sink a bit once Hailee pulled away, but she was surprised when she only pulled away slowly, the kiss being so gentle and slow. As Hailee looked at her softly, Padme’s eyes searched her face as she placed her other hand on Hailee’s cheek, gently caressing it.\n\nPadme’s heart pounded in her chest, finally being able to kiss the one person she had fallen for and had kept her feelings to herself. She still held Hailee, her thumb gently rubbing up and down her cheek as her eyes searched Hailee’s face, now noticing how much she was blushing.\n\nPadme gently wrapped her arms around Hailee, embracing her fully. She still held Hailee’s face with her other hand, rubbing her cheek gently with her thumb. Padme finally spoke in a soft tone, her eyes searching Hailee’s. \n\n\n\nPadme: “…you really won’t regret that?..”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"No I don't believe I will senator I whisper"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt her heart still pound at hearing Hailee’s response. She was grateful that Hailee didn’t regret it. Padme slowly let go of Hailee’s hips, rubbing her hands up and down her arms instead. \n\n\n\nPadme: “…are you sure?..” she asked in a soft tone once again, her eyes still searching Hailee’s. Padme then moved her hands back to Hailee’s waist, holding her closer to her body."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yeah im sure"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme was relieved that Hailee had given her an honest answer. She still held Hailee in her arms, her hands still resting on her waist. Padme pulled her closer, enjoying the feeling of Hailee’s body against her own, wanting to do more."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I rest my forehead on her shoulder"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme wrapped her arms around Hailee tightly, embracing her, holding her against her. Padme gently ran her hand down Hailee’s back, feeling how soft her robe felt against her hands. Padme rested her own forehead on Hailee’s shoulder too, enjoying the proximity and the moment they shared together.\n\nPadme felt herself wanting to kiss Hailee again, to feel her lips against her own, to feel her body against her’s. She let out a small sigh into Hailee’s shoulder, her eyes now closed as she embraced her apprentice tightly.\n\nAs Padme embraced Hailee, she took a deep breath, feeling tempted to kiss Hailee again, to feel her lips pressed against her own again. She was still holding her tightly when she whispered in Hailee’s ear softly. \n\n\n\nPadme: *”…may I ask you somethin’?..”*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yeah"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme took a deep breath again before speaking, her hands still resting on Hailee’s waist. She was nervous about asking such a foolish question and didn’t know if Hailee would find it stupid. \n\n\n\nPadme: “…did- was that your first time?..” she asked in a soft tone, hoping that she wouldn’t upset Hailee or cross any lines by asking a question such as that."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"No senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt her heart drop a bit once hearing that Hailee had done this with someone else. She felt a wave of jealousy wash over her, not expecting feeling such jealousy. But she then remembered that Hailee was a Jedi and was bound to follow the code. She pushed away her jealousy, forcing out a small question. \n\n\n\nPadme: “…when was your first time?..” she asked, not wanting to bring up any bad memories for Hailee if there were any, but still wanting to know."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Senator I whine softly nudging her shoulder"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt herself smile a bit when Hailee nudged her shoulder, finding her reaction to the question to be quite adorable. She gently squeezed her waist and let out a small sigh, realizing that she had probably upset Hailee by asking such a question. She nodded and sighed once again before whispering in her ear again. \n\n\n\nPadme: “*Sorry, sorry, sorry.* I just got curious, you don’t have to answer if you don’t want to dear.” She said in a caring tone.\n\nPadme was glad that Hailee didn’t get upset by her question, but still wanted to make sure that she wasn’t bothered by her. She was also still jealous that Hailee had done this with someone else before her, but was still grateful that Hailee hadn’t minded. Padme gently rubbed Hailee’s waist, hoping that she didn’t upset her further, not wanting to ruin this moment.\n\nPadme took a deep breath once again, feeling relieved that Hailee hadn’t minded. She closed her eyes, resting her forehead on Hailee’s shoulder again. She felt her heart still pound in her chest, enjoying the feeling of holding Hailee so closely against her body."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"We really should stand up I mutter you have a meeting In an hour"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme reluctantly nodded, not wanting to let go of Hailee just yet, but knew that Hailee was right. She nodded with a small pout on her lips. \n\n\n\nPadme: “…yeah, yeah, I know….” she whispered in response, still holding Hailee against her body.\n\nPadme took a deep breath, releasing Hailee from her grasp, but stayed pressed against her. She let out a small sigh as she stared into Hailee’s beautiful brown eyes. \n\n\n\nPadme: “…I still don’t want to let you go just yet…” she said truthfully, her hands gently resting on Hailee’s waist, not wanting to completely let her go."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I lean forward slightly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme was surprised when Hailee lean forward towards her. With Hailee leaning forward, their faces now only a few inches away from each other, Padme couldn’t bring herself to let go of Hailee anytime soon. \n\n\n\nPadme just wanted to capture Hailee’s lips with her own again, but knew that it was risky and that she could be called to go the Senate at any moment.\n\nPadme searched Hailee’s eyes for any signs that she was uncomfortable with their proximity. But found no signs of discomfort whatsoever, which gave her a slight feeling of relief. Padme took a deep breath, feeling both tempted and desperate to kiss Hailee again. Her heart pounded against her chest as she slowly lifted her hands, gently cupping Hailee’s face, her thumbs rubbing her cheeks."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I close my eyes at the touch"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme gently rubbed Hailee’s cheeks with her thumbs, enjoying the skin to skin contact. She could feel herself feeling tempted with every moment that passed, desperate for another kiss from her. Her heart pounded against her chest, her breath hitching as she spoke softly again, her eyes never leaving Hailee’s face. \n\n\n\nPadme: “…I’m very tempted right now, dear….”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Sorry I whisper"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme’s heart pounded harder when hearing the response, realizing Hailee misunderstood what she meant. She shook her head, wanting to make sure that Hailee understood what she meant. \n\n\n\nPadme: “*No, no..* that isn’t what I meant… I’m very tempted to kiss you again… I don’t want you to be sorry for anything, dear” she explained to Hailee in a soft tone.\n\nPadme gently pulled Hailee’s face closer to her own, wanting to give her another kiss. She paused when their lips were only a few inches away from each other again. Her heart pounded against her chest once again as she searched Hailee’s eyes, desperately wanting to kiss her again. \n\n\n\nPadme: “*Can I?..*” she asked in a whispering tone, hoping that Hailee would give her permission."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"Yes senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt her heart beat even faster when hearing that she could kiss Hailee again. \n\n\n\n“*Thank you, dear..*” Padme whispered in a soft tone before finally capturing Hailee’s lips with her own.\n\nPadme gently pressed her lips against Hailee’s, feeling how soft her lips felt against her own. She slowly moved her hands around to the back of Hailee’s neck, pulling her closer to her. Padme held Hailee’s face with one of her hands again, wanting to deepen the kiss more."}
{"name":"You","is_user":true,"is_name":true,"send_date":1747169261017,"mes":"I sigh deeply"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1747169261017,"mes":"Padme felt Hailee sigh deeply, which made Padme part her own lips, wanting to deepen the kiss. She moved one of her hands from around Hailee’s neck to her waist, pulling her even closer to her body once again. \n\n\n\nPadme gently deepened the kiss, letting out a soft whimper into the kiss.\n\nPadme felt herself getting tempted once again, wanting to take things even further, but knew that she couldn’t. She pulled back gently from the kiss, panting softly. She continued keeping her hands on Hailee’s waist, wanting to keep her in her embrace.\n\nPadme let out another deep breath after breaking the kiss, looking into Hailee’s eyes as she spoke in a soft tone, her voice still wavering from their kiss. \n\n\n\nPadme: “….I really needed that, dear…. I don’t want to let go of you yet….” she admitted, her eyes still searching Hailee’s.\n\nPadme felt herself becoming tempted again when looking into Hailee’s eyes, but she resisted the temptation, knowing that she had a meeting to get to. Her heart pounded in her chest, still wanting to hold and kiss Hailee, but couldn’t. She didn’t want to let go of her apprentice, but knew that she had to. The thought of letting go made Padme feel upset, but she released her hands from Hailee’s waist."}