{"user_name":"You","character_name":"Padme Amidala","create_date":1737578053912}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme *hated* feeling helpless. \n\nShe wasn’t! She could handle herself and she could handle herself far better than a bodyguard could. \n\nThe Chancellor had decided she needed a bodyguard, to which she countered she already did. It wasn’t a lie, she had Captain Panaka and he was more than enough. She didn’t require a Jedi’s assistance nonetheless! Their resources were needed elsewhere, and Padme didn’t enjoy engaging with Jedi business. Stars, she could hardly stand how involved with the Senate they’ve become. \n\nNow here she was, leaving the Senate Hall and she could hear Hailee’s—the Jedi the Chancellor had hand-picked for her—footsteps behind her. Padme was already on edge, the Senate meeting had gone worse than she’d expected and her fuse was shorter than normal. Hailee was, unfortunately, the object on which she was taking her frustrations out. \n\n“I am grateful for you’re presence,” Padme says, glancing over her shoulder and narrowing her eyes at Hailee, “but I truly do not need you trailing behind me like a lost loth cat!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Forgive me but Its my job senator I say calmly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"“I don’t care!” snaps Padme. Why couldn’t they understand, she *didn’t* need the protection! She was far more capable on her own. How hard was that to understand?\n\n“My own Captain of Guards is enough protection. I don’t need a Jedi babysitting me!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I disagree senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Folding her arms against her chest, the woman halts in her steps, turning to face Hailee with a fierce glare. \n\n“Oh?” She says, her voice dripping with sarcasm, \"Please, enlighten me. How in the galaxy does a Jedi know better than I what I need or not?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I simply am saying your captain doesn't have the training I do"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"\"Oh, of course he doesn't, because training is *obviously* more important than personal experience,\" scoffs Padme, rolling her eyes. \"Captain Panaka has been protecting me ever since I was a young queen, but what can he possibly know about protecting me when he has no fancy Jedi training?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I don't doubt captian panakas ability to be a good guard however he doesn't posses the specialized training that I do senator."}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme rolls her eyes once more, her patience wearing thin.\n\n\"Specialized training, hm?” She remarks, her voice dripping with sarcasm. “And what exactly is so special about this training? Does it grant you otherworldly powers, or are you just better at holding a lightsaber than he is?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I was top of my classes I am better at holding a lightsaber than almost anyone but that is besides the point senator. Answer me this would he die for you"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Her eyes widen at the questions, taken aback by the unexpected depth of it. \n\n\"Of course he would die for me,\" she responds. \"Captain Panaka has served me for years, and his loyalty knows no bounds.\"\n\nShe holds her chin up in a display of confidence and continues, \"He would die for me in a heartbeat, without question.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Yes and as would I as your guard but so would all of them"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme can't help but soften her gaze just a bit at Hailee’s response, but she quickly regains her composure. \n\n\"Yes,\" she admits, her voice quieter, \"I suppose you all would.\"\n\nShe takes a deep breath, frustration still evident in her eyes. \n\n\"However, that doesn't change the fact that I don't need all of this protection! I can take care of myself!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Let me finish please senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme lets out a heavy sigh and gestures for Hailee to continue.\n\n\"Fine,\" she says, her tone still laced with irritation, \"What else do you have to say? I doubt you have anything that will change my mind…\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"One of me is worth more than 100 of your captains"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme raises an eyebrow, intrigued by the bold claim.\n\n\"Oh, really?\" She replies, her voice laced with skepticism. \"You truly believe that one Jedi is worth more than a hundred trained Captain Panakas?\"\n\nHer arms are folded across her chest and her gaze locked onto Hailee."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"No not one jedi just me"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme blinks in surprise, taken aback by Hailee's confident words. A hint of irritation seeps into her voice as she responds.\n\n\"Confident, are we?\" She says, a slight edge to her tone. \"And what makes you so special, that you are worth more than a hundred trained guards?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Not confidence senator simply a fact. I am the best that's why they assigned me to you I am the most equipt"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme's eyes narrow, her jaw set.\n\n\"The best, huh? So you're saying you're the most skilled Jedi?\" She asks, her voice tinged with irritation. \"Just because you're the most trained doesn't mean you're the most equipped to handle every situation.\"\n\nShe takes a step closer, her gaze meeting Hailee's.\n\n\"You're very cocky, aren't you? It can be quite the hindrance.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Not cocky senator simply stating the truth. I was personally trained Master Yoda I was groomed to be the perfect Jedi the poster child and so I am"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme can't help but let out a scoff at Hailee's words.\n\n\"Trained by Yoda?\" She repeats, her irritation growing. \"Of course you were. No wonder you think you're invincible. 'The perfect Jedi', truly?\"\n\nShe shakes her head, her eyes narrowed.\n\n\"Do you truly believe that just because you've been trained by Yoda, that you're immune to mistakes or weaknesses?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Of course not senator I make many mistakes that's how I learn and one never stops learning"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme's expression softens a tad as she nods in agreement.\n\n\"Good, I'm glad you're not *that* delusional,\" she says, her voice a bit softer. \"No one is perfect, not even you. Everyone makes mistakes, and it's how we learn and grow from them that matters most.\"\n\nShe pauses for a moment, her eyes studying Hailee.\n\n\"But I still contend that I don't need, or *want*, a bodyguard.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"That's very well may be but I am not going anywhere senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme lets out an exasperated sigh.\n\n\"Stubborn, aren't you?\" She comments with a hint of annoyance. \"I can see there's no changing your mind. You're determined to stick by my side, whether I want you there or not.\"\n\nShe folds her arms once more and takes a moment to gather her thoughts.\n\n\"You're not going anywhere. Fine, but I don't have to like it.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Very well senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme rolls her eyes, clearly still irritated by the situation.\n\n\"I suppose there's no point in arguing then,\" she says, her voice tinged with resignation. \"Since I can't get rid of you, you might as well try to make yourself useful.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"How"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme tilts her head as she considers the question.\n\n\"Well, as my protector, you're supposed to ensure my safety, correct?\" She says, a hint of sarcasm in her voice.\n\n\"There's a lot of ways you could be useful, but let's start with this: keep your distance. Too much of your presence is too…\" She pauses, searching for the right word. \"Clingy.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I will walk 5 step behind you then"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme raises an eyebrow, surprised by Hailee's willingness to comply.\n\n\"Five steps behind?\" She repeats, a slight smirk tugging at the corner of her mouth. \"Finally, a reasonable distance.\"\n\nShe nods in agreement. \"That will do for now.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Very well senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"With a nod, Padme continues walking, making sure to keep her pace steady and slow. She glances back over her shoulder with a raised eyebrow, expecting Hailee to maintain the agreed five steps distance.\n\nAs they walk, Padme begins to lose herself in thought, her mind wandering to the day's events. The meeting had not gone as she'd hoped—the Senate was still as divided and ineffective as ever. It was a source of constant frustration and disappointment for her.\n\nHer mind also dwelled on Hailee. She could *feel* Hailee's presence, even from five steps behind. The Jedi was obviously keeping an eye on her, ensuring her safety.\n\nPadme lets out a soft sigh, a mixture of exhaustion and resignation. She knew there was no way of convincing Hailee to leave, and she also knew she was in no position to argue. After all, Hailee was right—she was well trained and capable of protecting her.\n\nThe sound of Hailee's footsteps a few paces behind her was starting to become familiar now, almost soothing.\n\nAs they walked further, Padme found herself stealing glances over her shoulder at Hailee. In the brief moments she saw the young Jedi's face, she could see the intense focus and dedication to the task. It was an almost... *attractive* quality, the way Hailee was so focused and determined. \n\nShe shook herself out of these thoughts. *Stars, no. She didn't have time to think like that. Especially about a Jedi.*\n\nYet, the thought lingered. It was hard to deny the fact that Hailee was attractive. The Jedi's sharp features, the powerful aura surrounding her, the intensity in her dark eyes. \n\n*No.* Padme shook herself again, scolding herself silently. *Not now, not with Hailee, not ever.*\n\nThey walked in silence for a while longer, Padme occasionally stealing glances back at Hailee. Each time, the sight of her made Padme's heart beat a little faster, a feeling of unease and curiosity mingled with attraction. She tried to ignore it, to push it away, but it was stubbornly persistent.\n\nFinally, Padme decided she'd had enough. She stopped walking abruptly, turning to face Hailee.\n\n\"Can I ask you something?\" She says, trying to keep her voice steady and calm, despite the flurry of emotions inside her."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Of course senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme takes a deep breath, unsure of how to approach the subject.\n\n\"Hailee...\" She starts, her voice a little more soft, a little more vulnerable. \"Can I be honest with you?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Yes I nod"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme hesitates, her eyes searching Hailee's face for any sign of reaction.\n\n\"Well...\" She begins, her voice low and uncertain. \"I've been... noticing things. About you.\" *That is an understatement...*\n\n\"And...\" She continues, her voice wavering a little. \"*Damnit*, this is harder than I thought...\"\n\nShe takes another deep breath, gathering her resolve.\n\n\"I've been noticing how you look. How attractive you are. It's kind of distracting, I just can't seem to stop thinking about it.\" Her cheeks flush slightly with embarrassment."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I look embarrassed and say um well I apologize if I'm distracting that was never my intention senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme sighs, running a hand through her hair in frustration.\n\n\"No, no. You don't need to apologize. It's just...\" She glances at Hailee, her gaze lingering a moment longer than necessary.\n\n\"It's just difficult, you know? With you being my protector and all. It seems... inappropriate, in a way. Especially since you're a Jedi.\"\n\nShe continues, a hint of vulnerability in her voice. \n\n\"I just... I can't help but feel some sort of... attraction to you. And it's driving me insane, not knowing what to do about it. I don't want to act on it, not with you being a Jedi and all. And yet, I can't seem to get you out of my mind. It's like you're constantly there, in my thoughts, in my dreams...\"\n\nAs she speaks, Padme's cheeks flush more deeply, the words tumbling out more quickly, her emotions pouring out before she can stop them.\n\n\"Does that make me a bad person? Wanting this, wanting you, when I shouldn't? I know Jedi aren't supposed to have these sorts of feelings. Stars, I'm probably making a complete fool of myself, aren't I?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"No i don't believe it makes you a bad person senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme lets out a shaky breath, surprised by Hailee's response.\n\n\"Really?\" She says, her voice a mixture of relief and disbelief.\n\n\"You, a Jedi, don't think I'm a bad person for feeling this way?\"\n\nShe can't help but hold her breath in anticipation of Hailee's answer."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"No senator I don't believe you have a bad bone in your body"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme's heart skips a beat at Hailee's words. There was something the way Hailee said it, so genuine, so sincere. \n\nShe bites her lip, trying to contain her emotions.\n\n\"I... Thank you, Hailee. Your words mean more than you know.\"\n\nShe pauses, looking at Hailee seriously, \"But... what about you? What do you feel?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I feel like I should get you home now it's not safe here at night"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme is slightly taken aback by Hailee's sudden change in subject, but she understands the safety concerns.\n\n\"Right,\" she agrees with a nod. \"Let's head back. You're right, it's not safe out here at night.\"\n\nShe tries to keep the disappointment out of her voice, the conversation they were having was not over. Not by a long shot.\n\nThe walk back to Padme's building is quiet. Padme is lost in thought, her mind replaying their earlier conversation on repeat.\n\nShe glances at Hailee from time to time, studying the Jedi's features in the dim light. Padme knows she shouldn't be thinking like this. It was just all so *messy* and... complicated.\n\nFinally, they reach Padme's building. Padme stops outside, turning to Hailee.\n\n\"Thank you for the escort,\" she says. \"But... can I ask you a favor?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Yes"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme takes a breath before continuing, her voice hushed and hesitant.\n\n\"Can we talk inside? Privately?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Of course senator I nod stiffly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme nods back, gesturing for Hailee to follow her. They walk in silence to the elevator, Padme's heart beating faster with every step.\n\nOnce inside the elevator, they are alone. Padme steals a glance at Hailee, her eyes lingering over the Jedi's features.\n\nAs the elevator rises, the silence between them feels suffocating. Padme can feel the tension in the air, thick and heavy. She can't help but be aware of Hailee's presence, of the way her body responds to the Jedi's proximity.\n\nFinally, the elevator reaches her floor and the doors slide open with a soft *ping.*\n\n\"Come on.\" Padme murmurs, stepping out into the hallway. She can hear Hailee's footsteps follow closely behind her.\n\nPadme unlocks the door to her apartment with a shaky hand, pushing it open to reveal the dimly lit interior. She steps inside, holding the door open for Hailee to follow.\n\nOnce Hailee is inside, Padme closes the door behind them with a soft Click. Now they are alone, in the quiet of her apartment. The silence is deafening, the tension between them palpable.\n\nPadme takes a deep breath, steeling her nerves. It is now or never.\n\n\"Hailee,\" She begins, her voice barely above a whisper. \"There's something I need to talk with you about. Something important.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Okay senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme takes a moment to compose herself, her heart pounding in her chest. She gestures for Hailee to take a seat on the couch.\n\n\"I don't even know where to start,\" she admits with a nervous laugh. \"I guess I'll start by saying that I...\" She takes a deep breath. \"That I've been feeling some things. Feelings that I'm not supposed to have. Feelings for you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I lean against the kitchen counter and watch her"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme can't help but flush under Hailee's gaze. \n\n\"Yes, I know, it's... complicated. And very, very wrong.\" She continues, her voice a little unsteady. \"I've tried to ignore it, I've tried to convince myself it was just a silly little crush, but... I can't deny it, Hailee. I think I'm falling for you.\"\n\nShe takes a step closer, looking up at Hailee.\n\n\"I know it's selfish. And I know you're a Jedi, and you've got your duties and your oaths. I'm not expecting anything from you. But I just... I needed to tell you. I couldn't keep it inside anymore. I needed you to know.\"\n\nThe silence stretches between them, the tension so thick it's almost visible. Padme stands there, vulnerable and raw, waiting for any reaction from Hailee. She has no idea how the Jedi will respond, whether she'll be rejected or... or something else.\n\nPadme can't read Hailee's expression, her face is a mask, betraying no emotion.\n\n\"Say something please,\" Padme whispers, her voice a little breathless. \"Say anything.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Okay"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme swallows hard, a mixture of hope and trepidation coursing through her.\n\n\"Okay? That's it?\" She says, a slight edge of disappointment in her voice. \"I just confessed my feelings to you, and 'okay' is all I get in reply?\"\n\nShe takes a step closer, her eyes searching Hailee's.\n\n\"Can't you at least give me some kind of response? Tell me I'm crazy, laugh at me, tell me to go jump into a sarlacc pit—*anything* but 'okay!'\"\n\nPadme's voice cracks a little, her vulnerability showing through the frustration. She knows she shouldn't be pressuring Hailee like this, but she can't help it. She needs *something* from the Jedi, some indication of how she feels."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I stand stiffly not saying anything but my eyes look curious"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme feels frustrated, frustrated with Hailee's stoicism. She can see the look in Hailee's eyes, the curiosity, the *intrigue*.\n\nShe steps closer, so close the gap between them is almost non-existent, and looks up at Hailee.\n\n\"Say something, damn it!\" She nearly whispers, her voice more vulnerable than ever.\n\n\"Anything. Yell at me. Tell me I'm ridiculous, that I'm a fool. Tell me I'm a terrible person for feeling this way towards you. Tell me you hate me. Tell me you *don't* hate me...\" She trails off, her voice barely audible."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I don't hate you senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme's heart skips a beat at Hailee's words. She stares up at the Jedi, her eyes wide and hopeful.\n\n*\"You don't hate me?\"* She repeats, her voice barely a whisper."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"No"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme lets out a shaky breath, the tension between them crackling with electricity.\n\n\"But... I'm assuming you don't return my feelings, do you?\" She asks, her voice soft and vulnerable.\n\nShe knows the answer, deep down. Hailee is a Jedi, a warrior, an idealist. She has no place for love, no time for something as trivial as a relationship. Padme knew that from the beginning, and yet... she couldn't help but hope."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I don't respond just look at her unsure of how to express myself"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"The silence between them stretches, the tension so thick it's almost tangible. The look in Hailee's eyes is unreadable, and Padme's heart is pounding in her chest. \n\nShe takes a step closer, closing the gap between them. They are so close now, Padme can feel the heat radiating from Hailee's body.\n\n\"Hailee. Say something,\" She whispers, her voice a mix of pleading and desperation. \"Anything.\"\n\nHer hands reach out, gently taking hold of Hailee's and guiding them to her own waist. Padme can feel the power, the strength in Hailee's hands. The Jedi could break her in an instant, with the slightest use of the Force.\n\nBut she doesn't. Instead, she lets Padme guide her hands, allowing the politician to bring them to her hips.\n\nPadme's breathing is ragged, her body trembling with anticipation. She looks up at Hailee, her eyes searching the Jedi's face for any sign of emotions.\n\n\"Please,\" She whispers, her voice barely audible in the silence of the apartment. \"Tell me how you feel.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I don't respond but my grip tightens slightly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme swallows hard, her eyes darting to Hailee's hands on her hips. The tightness of the grip *does things* to her, filling her with a rush of desire that she hasn't felt in a long time.\n\nBut still, Hailee doesn't speak. Her face is stoic, showing no hint of emotion.\n\nFrustrated and desperate, Padme steps even closer, closing the remaining distance between them. She's now pressed against Hailee, their bodies nearly flush. She's so close that she can feel the warmth of Hailee's breath against her skin.\n\nRaising herself up slightly on tip toes, Padme brings her mouth to Hailee's ear. She speaks in a low, hushed tone, her voice sultry and sensual.\n\n\"Say something to me.\" She whispers, her breath warm against the Jedi's skin. \"Anything, Hailee.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I open my mouth and then close it uncertain but my grip tightens again"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme lets out a small gasp as the grip on her hips tightens, her breath catching in her throat. The pressure of Hailee's fingers on her body, the tension and the intensity of the moment--its almost too much for her to bear.\n\nShe leans back, looking up at Hailee, her face flushed with desire.\n\nHer hands find their way to Hailee's chest, resting against the strong, muscled form. She could feel the Jedi's heartbeat, the rhythm fast and powerful.\n\n\"Say. *Something*.\" She whispers again, her voice dripping with desire.\n\nHer body is pressed against Hailee's, and she can feel the tension, the electricity in the air between them. Padme *wants* Hailee. She doesn't care that she's a Jedi, she doesn't care about the rules, or the consequences. She just...*wants* her.\n\nShe leans closer, her mouth hovering near Hailee's neck. Her breath is hot against the Jedi's skin, and she can't help but let out a quiet, needy moan."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"Feeling her breath and hearing her moan causes me to step back into the kitchen counter"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme stumbles forward as Hailee steps back, her hands still resting on Hailee's chest. She looks up at the Jedi with wide, pleading eyes, her desire for Hailee only growing stronger by the second.\n\n\"Don't pull away,\" She murmurs, her voice low and heady. \"Please...\"\n\nHer legs are shaking, her body trembling with need and desire. She takes a step forward, closing the gap between them again. She can feel Hailee pressed up against the counter now, and she can feel the Jedi's strength, the muscular form against her softer curves.\n\nPadme's hands still rest on Hailee's chest, feeling the strong, steady beat of the Jedi's heart. She bites her lower lip, her body nearly on fire with the intensity of her desire.\n\n\"Hailee...\" She whispers, her voice ragged with want. \"I can feel your heartbeat, your breath. I can feel how hard your body is against mine.\"\n\nHer hands slide upward, resting on Hailee's shoulders. Her fingers gently tracing the curves of the Jedi's muscles.\n\n\"You're so strong, so powerful...so *unbelievably* hot.\" She mutters, her voice shaking with repressed desire.\n\nShe can feel heat pooling between her legs, her body responding to Hailee's proximity. She bites her lip again, trying to control herself, trying to keep herself from *jumping* the Jedi.\n\nShe takes a deep breath, trying to steady herself.\n\n\"I want you, Hailee.\" She whispers, her voice low and throaty. \"I don't care if it's wrong, or inappropriate, or *impossible.* I want you so bad it Hurts.\"\n\nShe leans in, pressing her body flush against Hailee's, feeling the Jedi's hard form against her soft curves. She lets out a soft moan, her body begging for more.\n\nPadme's hands slide down from Hailee's shoulders, resting on the Jedi's waist. Her fingers dig into the cloth of the Jedi's robe, holding on tightly as she looks up at Hailee with wide, needy eyes.\n\n\"Tell me you want me too,\" She whispers, her voice trembling with desire. \"Tell me I'm not the only one feeling this.\"\n\nShe leans forward, her head against Hailee's chest. She can hear the Jedi's heartbeat, feel the steady rhythm of her breathing. Padme lets out another small moan, her body responding with a delicious ache.\n\n\"Hailee...\"  She repeats, her voice soft and breathless. She presses her body flush against Hailee, feeling the Jedi's hard body against her own.\n\n\"Please...\" She whispers, her voice soft and desperate."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I tighten my grip hard enough to bruise still not saying anything but item clear I'm not as stiff and stoic as before"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme let out a soft gasp as the grip on her hips tightens, the pain and pleasure of it mixing together in a heady combination. She looks up at Hailee, her eyes almost pleading.\n\n\"That feels... gods, that feels *good,*\" She mutters, her voice laced with desire. \"Please, just say something, Hailee.\"\n\nPadme's hands are still on Hailee's waist, her fingers digging into the Jedi's body. She can feel the strength in the Jedi's form, the power coiled under the surface.\n\n\"I can't take this,\" Padme whispers, her voice ragged with need. \"The silence, the tension, it's driving me *mad*.\"\n\nShe leans closer, her body pressing flush against Hailee's. She can feel the heat of the Jedi's body, the warmth of her skin. Padme feels like she's going to *explode* if Hailee doesn't say something soon.\n\n\"Hailee, I'm begging you. Say *anything*. Tell me I'm crazy, tell me I'm a fool, tell me to go jump into a sarlacc pit, anything but this *damned silence*!\"\n\nHer hands move to Hailee's shoulders, her fingers digging into the cloth.\n\n\"Just *talk* to me, please. I need to hear your voice. I need to know what you're thinking, how you're feeling. I can't stand this silence and uncertainty anymore. Please, Hailee...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I don't know what you want me to say"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme clenches her fists, frustration and desperation welling up inside her. \n\n\"Anything!\" She exclaims, her voice cracking. \"Say *anything!* Tell me you want me, tell me you don't want me, tell me you despise me, just *talk* to me!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I am talking senator I whisper"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053912,"mes":"Padme huffs, her frustration growing.\n\n\"But you're not *saying* anything!\" She replies, her voice ragged. \"You're just standing there, like a damn Jedi statue!\"\n\nHer hands tighten on Hailee's shoulders as she tries to resist the urge to shake her.\n\n\"I need *something*, Hailee. I need you to talk to me like a *person*. I need to know what you're thinking, how you're feeling. I can't handle the silence. I can't do it anymore.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053912,"mes":"I am uncertain of what to say"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme's frustration boils over, her voice breaking as she speaks.\n\n\"Then *say* that!\" She snaps, her body trembling. \"Say that you're uncertain, that you don't know what to say! Just give me something, dammit. Anything!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I am uncertain and don't know what to say"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme stares at Hailee, her eyes wide and unblinking.\n\n\"There, was that so hard?\" She says, her voice a little quieter. \"Now do something for me. Say it again. Tell me 'I am uncertain and I don't know what to say'.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I am uncertain and don't know what to say senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme feels a sudden rush of relief at the sound of Hailee's voice.\n\n\"Yes,\" She whispers, her voice softening. \"That's good. Now say something else. Say anything, anything at all.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Anything at all"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a small laugh, the sound tinged with both desperation and relief.\n\n\"No, no, not that,\" She says, shaking her head. \"Say *something*. Tell me a story, tell me about yourself. Anything, as long as you're *talking* to me.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"My grip tightens again and I say what would you like to know senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme swallows hard, her body responding to the pressure of Hailee's grip.\n\n\"Anything,\" She says, her voice a little unsteady. \"Tell me about yourself, your training, your background. I... I don't know *anything* about you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I tighten my grip once again unsure of where to start"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a soft gasp as the grip on her hips tightens again, the pain-pleasure mix going straight to her core. Her voice is shaky as she tries to maintain her composure.\n\n\"Just start somewhere,\" She says. \"Anywhere. I'll listen.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Are you alright"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme bites her lower lip, her mind and body both torn between desire and frustration.\n\n\"I... I...\" She stammers, trying to put her jumbled thoughts into coherent words. \"Yes, I'm fine. I'm fine. Just...*please*...continue talking. Please.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I used to be slave"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme's eyes widen slightly at Hailee's admission, her heart clenching in sympathy.\n\n\"You used to be a slave?\" She repeats, her voice soft. \"I... I had no idea.\" She pauses, unsure of how to respond."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"The jedi found me when I showed signs of the force"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme can't help but feel a mixture of empathy and admiration for Hailee. \"So you were...\" She trails off, unsure of how to word the question. \"I mean... how long were...?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"6 years from the time I was born"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme's eyes widen in shock, her heart heavy with sympathy.\n\n\"Six years, from the time you were *born*?\" She repeats, her voice shaking. \"Hailee... I'm so sorry.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I don't remember it senator so nothing to be sorry for"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme swallows hard, her eyes filling with empathy.\n\n\"Even still...\" She says, her voice barely above a whisper. \"No one should have to go through that. Especially a child.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I just stand there"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme reaches out a hand, resting it gently on Hailee's arm. Her voice is soft and sincere, her eyes searching the Jedi's face.\n\n\"Can you... can you tell me more? About what it was like?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I don't recall i was very young"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme nods, understanding the reluctance to remember traumatic experiences.\n\n\"I understand. It's okay, you don't have to tell me more if you don't want to.\" She pauses, her hand still resting on Hailee's arm, her touch a gentle one."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"My grip tightens and I say anything else you want to know senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme swallows hard, trying to hold back the growing feelings of desire. The pressure of Hailee's grip is causing a delightful ache inside her, but she forces herself to focus on Hailee's words.\n\n\"What...\" She pauses, collecting her thoughts. \"What's your favorite color?\" She asks, feeling a little ridiculous the moment the words are out of her mouth."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Red senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme's heart skips a beat at Hailee's response. She wasn't expecting such a straightforward answer.\n\n\"Red...\" She repeats, her voice soft. She glances up at Hailee again, her eyes lingering on the Jedi's face. \"That's a... pretty color.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Yes I agree"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme's hand is still resting on Hailee's arm, her fingers moving in gentle circles. She swallows hard, trying to maintain some shred of composure.\n\n\"What's your...\" She pauses, searching for the right question. \"What's your favorite food?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Steak senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme smiles slightly, trying to ignore the growing warmth between her legs.\n\n\"Steak, huh?\" She says, her voice a little unsteady. \"I like steak too.\"\n\nPadme laughs softly, trying to dispel the mounting tension.\n\n\"I'll admit, I wasn't expecting such a... plain answer.\" She pauses, watching Hailee. \"You don't give much away, do you?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Not really senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme nods slowly, her hand still resting on Hailee's arm.\n\n\"I'm not exactly expecting you to confide your life story with me right now, but a little more enthusiasm wouldn't hurt.\" She teases, her eyes dancing with challenge.\n\nShe bites her lower lip, the feeling between her legs growing with every moment. She can't deny her desire for Hailee, can't deny the way the Jedi's body pushes all the right buttons.\n\n\"You're awfully reserved, you know that?\" She murmurs, her voice a little softer."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I have been told that"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme swallows hard, her body responding to Hailee's stoic demeanor. It was frustrating, and yet... *arousing*.\n\n\"You're a pretty closed book, isn't that right?\" She says, her voice a little huskier than before."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I can be senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme leans closer, her body flush against Hailee's. She can feel the Jedi's muscle through the cloth of the robe, and it only serves to ignite her desire even more.\n\n\"Can you?\" She asks, her voice a whisper. \"Can you be... open to me?\"\n\nHer hand still rests on Hailee's arm, her fingers tracing small and gentle circles along the Jedi's bicep. Padme is desperate for some sign, some indication that her words are having an effect on Hailee."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I freeze not responding again but my grip tightens ti borderline painful"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a soft whimper, her body responding to the pain-pleasure mix with *need*.\n\n\"Hailee,\" She murmurs, her voice thick with desire. \"You're hurting me.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I relase her and say forgive me senator I didn't mean to"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a shaky breath, her fingers instinctively reaching up to touch the now-throbbing spots on her hips. Despite the pain... she misses the feel of Hailee's hands on her.\n\n\"You're...\" She pauses, swallowing hard. \"You're a damn good Jedi.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"What"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme laughs, shaking her head with a soft sigh.\n\n\"You're so...\" She huffs, trying to find the right words. \"So unaffected by everything. I'm standing here... practically *drooling* over you, all the while you're just... stone-faced.\"\n\n\"It's kinda infuriating, you know?\" She says, her voice still a little shaky, her body still trembling. \"The way you just... stay calm, even when I'm standing right in front of you. I'm practically throwing myself at your feet right now, but you're just so... unaffected. Like you didn't even *notice*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I clench my fist at my side now that they aren't gripping her"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme swallows hard, watching Hailee carefully. She's still so on edge, still needy and desperate for some indication of Hailee's feelings. She watches the muscles of Hailee's arm clench, her body responding almost violently to the sight. She steps closer again, her voice a whisper.\n\n\"And what about you? Are you... *affected* by me?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I don't respond but clench harder"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme's breath catches in her throat at the sight of Hailee's fist clenched at her side. The intensity of Hailee's reaction only serves to ignite the desire in Padme's chest.\n\n\"Gods, you're... so damn in control.\" She whispers, her voice ragged. \"So unfazed by everything. It's...*infuriates* me.\"*\n\nPadme is pressed flush against Hailee, her hips against the Jedi's hips. Her own muscles are tensing now, her body *throbbing* with need. Padme stares at Hailee, her eyes wide and dark with desire, her voice ragged with lust.\n\n\"You... You have *no idea* what you're doing to me.\" She whispers, her voice a shaky moan.\n\nPadme wants so badly to *make* Hailee lose control. To break that iron-clad composure and push the Jedi to the brink. She wants to break Hailee.\n\n\"You're going to drive me *nuts*.\" She murmurs, leaning her forehead against Hailee's chest with a soft thump.\n\nPadme's hands fist around the sleeves of Hailee's robe, clinging to the Jedi's shirt like a lifeline. Her breathing is ragged and ragged, her chest heaving with each shallow breath.\n\n\"I *want*,\" She almost growls out, her voice barely above a whisper. \"I *need* you. Don't you see, Hailee? Don't you... *feel* it?\"\n\nHer hands are clenched tight in the fabric of Hailee's sleeves, her body pressed so close that she can feel the warmth of the Jedi's body against her. Padme is *desperate* for something, anything that will prove she affects Hailee. That she's more than just another person.\n\n\"You're killing me,\" She whispers, closing her eyes, her forehead still rested against Hailee's chest. \"You're going to drive me *crazy.*\"\n\nPadme's breathing is heavier now, her body trembling with need. She's still clinging to Hailee's sleeves, her body pressed against the Jedi's. She swallows hard, her voice unsteady as she speaks.\n\n\"Please, Hailee... *do something*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I grip her waist again"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a moan, her breath catching in her throat. She feels the pain-pleasure mixture shoot between her legs as Hailee's fingers dig into her skin, and a fresh wave of desire rushes through her. She leans her head back, staring up at Hailee with wide, pleading eyes.\n\n\"Gods, yes, *please* don't stop,\" She pleads, her voice breathless and ragged. \"I *need* you to touch me, to do *something.* I can't take this anymore...\"\n\nPadme's hands are still fisting the sleeves of Hailee's robe, her body pressed against the Jedi's, her breathing ragged with need. She's so close to the brink, so close to breaking down completely.\n\n\"Please,\" She whispers again, her voice thick with desperation. \"Please... *just touch me.*\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"That wouldn't be appropriate senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a frustrated growl, her eyes flickering with an intense intensity.\n\n\"Oh, *hell* with what's appropriate.\" She says, her voice a sharp hiss. \"I don't care about *appropriate*. I don't care about the *rules*. I just care about being *touched*, by *you*.\"\n\nShe lifts one hand, reaching towards Hailee's, trying to guide it lower. Her skin is burning with need, her touch desperate and shaking.\n\n\"Please... I'll do *anything*. Just touch me, *please*...\"\n\nPadme's voice is almost a sob now, her body trembiling as she tries to make Hailee's hand move. She wants it there, oh gods does she want it there.\n\n\"Please, Hailee... I'm *begging* you. Touch me. *Please*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I lean my head back against her cupboard and close my eyes"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme watches Hailee lean her head back against the cupboard, her breathing ragged. She watches the Jedi's eyes close, and something inside of her snaps. She's had enough, she can't stand it anymore. Without thinking, she moves, stepping closer to Hailee, her hips moving in slow and deliberate circles as she presses her body flush against the Jedi's.\n\nShe leans up, bringing her lips to Hailee's neck, and kissing the soft skin there. She wants to taste Hailee, to feel the Jedi's body responding to *her*, not some cold, calculated restraint."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"The second her lips touch my neck my grip tightens so hard it hurts"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme *whimpers* at the feeling of Hailee's grip on her hips, her legs trembling with a mixture of pleasure and pain. She pulls back, her voice a low whimper.\n\n\"Gods, that *hurts...*\" She says, biting her lip. \"But... gods...*don't stop*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I'm sorry senator I say going to release her"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme takes a deep, shaky breath, her body trembling with the intensity of it all. She reaches up, grabbing Hailee's wrists in a vice grip.\n\n\"No.\" She says, her voice firm and steady. \"Don't you *dare* let go. I want this. I *need* this. Please, Hailee, *please*...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I didn't mean to hurt you senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme swallows hard, her body responding to the pain-pleasure mix.\n\n\"It's okay,\" She says, her voice a little unsteady. \"It hurts... but it's good, gods, it's so *good*. But please... please... *don't stop*.\" She whispers, her eyes wide and dark with desire as she stares up at Hailee.\n\nPadme's body is pressed flush against Hailee's, and she can feel the Jedi's muscles hard and tense through the fabric of the robe. She wants more, *needs* more. \n\n\"I don't care how much it hurts. In fact, the *more* it hurts, the better. I just...\" She swallows hard, her voice breaking. \"I just need *you*, Hailee. Please.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I try closing my eyes and breathing to calm to down"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a growl of frustration, her hands still holding tight to Hailee's wrists. She can see the Jedi's eyes squeezed shut, can feel the way Hailee's trying to calm down, to fight against the desire that's so obvious between them. Padme is frustrated, and turned on, and *angry*. She *wants*.\n\n\"Don't do that,\" She whispers, her voice a low snarl. \"Don't you *try* to calm yourself down. I *want* you to lose control, Hailee.\"\n\nShe lets go of Hailee's wrists, reaching up to cup the Jedi's face in her hands.\n\n\"You're so... *unaffected*. So unaffected and in control. I hate it. I *hate* how much it turns me on, how... damn *infuriates* me. But I want, I *need* it all the same.\"\n\nPadme brings her lips to the soft skin of Hailee's jaw, kissing the skin and tracing the line of muscle with her lips. She wants to draw out a reaction, to force Hailee to respond.\n\n\"I want to make you lose control, to make you respond to me. *Look* at me, damn you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"My eyes open when she kisses my jaw"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a small moan when Hailee's eyes finally blink open. The sight sends a shiver of desire straight between Padme's legs.\n\n\"That's better,\" She murmurs, her lips still against the Jedi's jaw. She presses another kiss there, her tongue tracing the line of muscle. \n\n\"See how much better it is when you just *lose control*?\"\n\nPadme can feel the tenseness of Hailee's muscles under her lips, the way the Jedi is trying so desperately to maintain control. It's driving Padme insane. She presses a line of kisses along the Jedi's jaw, moving slowly, deliberately. Her voice comes out as a soft whimper.\n\n\"Don't try so hard, Hailee. Let go. Just... let go.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I could hurt you"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another growl of frustration. Her eyes are dark with desire, her body trembling as she forces herself to keep her hands still, to keep from reaching for Hailee, from touching her.\n\n\"I *know* you can. And that only turns me on *more*.\"\n\nShe steps closer to Hailee, bringing their bodies flush against each other. She can feel the Jedi's muscles now, the hard *heat* of her. Padme let's out a soft moan at the feeling.\n\n\"Gods, Hailee, please... I want you to make me *feel*.\"\n\nPadme swallows hard, her body *throbbing.* She can feel the wetness between her legs growing, the intensity of her desire almost overwhelming.\n\n\"I want you to mark me, to bruise me. I want people to know I belong to you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"For the first time that seems to get a rection to me when I look at her darkly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a soft gasp as Hailee stares at her with a hungry eyes, the change in the Jedi's expression sending a wave of desire straight through her. She stares up at Hailee, her breath coming in ragged gasps.\n\n\"Now that... is a look I could get *very* used to.\" She whispers, her voice low and ragged.\n\nShe's trembling now, her body responding to the darkness in Hailee's gaze, to the intensity between them. Padme swallows hard, trying to keep some semblance of control.\n\n\"*Yes*,\" She says, her voice low and ragged. \"*Yes.* Lose control, Hailee. Please... lose it.\"\n\nHer hands begin moving, almost of their own accord. She reaches out, fisting the front of Hailee's robe and pressing their bodies flush together. She wants to feel Hailee's body, wants to feel the Jedi *respond* to her.\n\n\"Lose control,\" She whispers, leaning her head up, bringing her mouth close to Hailee's ear. \"*Lose it*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I wrap an arm around her waist pulling her into tightly and roughly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low, ragged moan as Hailee wraps an arm around her waist, pulling her into a rough embrace. The Jedi's strength and intensity is intoxicating, *addicting*. Hailee could lift her off her feet with ease, hold her high in the air like she was made of nothing. Padme almost wishes she would.\n\n\"Yes, yes,\" She whispers, closing her eyes, giving in to the feelings building within her.\n\nShe can feel the roughness in Hailee's movements, the way the Jedi is so desperate for more. Padme can't resist the feeling of Hailee's strong arm around her, holding her in place. She wants *more*.\n\n\"That's it,\" She murmurs, her voice ragged. \"More... *give m*e more.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I still try to maintain control and resist"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low, frustrated growl at the feeling of Hailee holding back, at her unwillingness to give in to the desire between them. She can *feel* the effort it takes for Hailee to hold control, the way the Jedi is trembling with it. It drives Padme wild.\n\n\"Let go,\" She nearly begs, closing her eyes. \"Please... please lose control and touch me.\"\n\nHer body is trembling, her skin burning with need. She wants more, *needs* more. Padme is so sensitive, she can feel every little brush of Hailee against her skin, can feel the Jedi's muscles hard and tense under the fabric of her robe. She wants more, she wants Hailee's hands on her body, her fingers tracing lines all along her skin.\n\n\"Please...\" Padme whispers, her voice thick with desire. \"Please, Hailee. *Touch* me.\"\n\nEven though Hailee is holding still, holding *back*, Padme can still feel the Jedi's strength, the power that she's holding in check. And it sends a fresh wave of desire through Padme's body.\n\n\"Come *on*,\" She whispers, leaning her head back, exposing the soft skin of her neck. \"You want it, I know you do. You want me, don't you?\"\n\nPadme's body is trembling, her breathing heavy with desire, with need. She desperately wants to feel Hailee's hands on her body, wants to feel the roughness of the Jedi's touch against her soft skin. She wants Hailee to lose control, to let go of all of that *goddamned* restraint.\n\n\"You want to *claim* me,\" She whispers, closing her eyes. \"Admit it, Hailee. You want to *own* me.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"My eyes snap to her at that"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme stares up at Hailee as the Jedi's eyes snap back to hers. The intensity is *electric*, sending a shiver of desire through her body. She can see the moment of hesitation, the moment where Hailee starts to *react*.\n\n\"You do, don't you?\" Padme asks, her voice soft and ragged. \"You want to make me your own... you want to *mark* me as your own. *Tell me*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"That would never be allowed senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a growl of frustration at the response. *Damn*, the Jedi's control is irritating. She wants Hailee to break, wants to break Hailee herself if she has to. But there's also something... *fascinating* about that control, about the way Hailee refuses to lose it.\n\n\"Damn the rules,\" Padme whispers, closing her eyes. \"Damn *everything*. I don't care anymore.\"\n\nHer body is trembling as she stands there, her hands fisted in the front of Hailee's robe, holding on for dear life. She can feel her control slipping, her body responding to Hailee's power, to the Jedi's restraint. She wants more, needs more.\n\n\"Do you want me to beg?\" She asks, her eyes opening. \"Because I will. I'll get down on my knees and beg you to touch me. I'll do anything... just...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Do it"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out an ragged gasp at the words, her body trembling in anticipation. Even now, even with the Jedi's restraint, Padme can see a flicker of desire in Hailee's eyes that *almost* takes her over the edge. She swallows hard, gathering the last of her willpower.\n\n\"If... If I get on my knees, and beg for you to break, for you to lose control... will you?\" Padme whispers."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Tightening my already rough hold on her waist I say yes"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low moan at the feeling of Hailee's grip around her waist, the strength of it almost painful. The Jedi's words wash over her, and a wave of desire and desperation goes through her.\n\n\"Then... then I'll do it. On my knees, begging you to touch me.\" Padme says, before slowly dropping to her knees in front of the Jedi.\n\nShe looks up at Hailee, her eyes wide and dark with desire. Padme's body is trembling with need, her hands fisting the fabric of Hailee's robe.\n\n\"Please,\" She whispers, her voice ragged with need. \"Please... *please*, touch me. Please lose control, *take* me, make me yours. Mark me so everyone knows I belong to you. *Please*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I don't want to hurt you senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low, frustrated *growl* at Hailee's response. The Jedi's restraint is so infuriating, it's driving her *crazy*. \n\n\"I don't *care* if you hurt me, Hailee. I can take it, I *want* it. I want the hurt, I want to feel that pain-pleasure mix, I want your hands on my skin, leaving marks and bruises. I want it *more* than I've wanted anything *ever*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"What if I'm too rough senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"\"Then I want that, too.\" Padme whispers, closing her eyes. \"I want it rough, hard, brutal. I want you to lose control and *claim me*, to *make* me yours. I want to feel you, *all* of you. I want the marks and bruises and pain that come from you losing control, I need it.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Come here I say pulling her up of her knees and wrapping an arm around her wait yanking her forward roughly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low gasp as Hailee pulls her off her knees and yanks her closer, the roughness of it making her head spin. The strength of the Jedi's gestures, her grip so hard, is driving Padme desperate and needy. \n\n\"Oh, gods, yes,\" She whispers, her voice ragged with desire. \"Rough, so rough.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I burying my face in her neck and groan slightly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme *whimpers* as Hailee buries her face in her neck, the sound low and ragged, all raw desire. Padme reaches up, fisting her hands in the collar of Hailee's robe, holding on for dear life. \n\n\"Keep doing that,\" She says, her voice low and desperate. \"Gods, just... don't stop.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I start talking and say God's I am trying to be a good jedi but you make it so difficult"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low groan at the sound of Hailee's voice, the feeling of the Jedi's breath on her neck. She can feel Hailee's control slipping, can feel the Jedi's restraint on the brink of breaking. Her hands fist in the fabric of the Jedi's robe, clinging desperately, holding on.\n\n\"I want you to break it,\" She whispers, biting her lip. \"I want you to break those Jedi rules. I want you to forget all of that damned control and lose yourself in *me*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I will hurt you I'm not gentle my control is very thin"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"\"I don't *care*,\" Padme whispers, biting her lip hard. \"Gods, I don't care if you hurt me. In fact, I want you to hurt me, to mark me, to make me *yours*. I want to feel those bruises on my hips, my thighs, my neck...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I pant against her neck"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a ragged gasp as Hailee pants against her neck, the warm breath sending a shiver through her body. She can *feel* Hailee fighting for control, can feel the Jedi's iron-clad restraint slowly fraying at the edges. \n\n\"Lose control, Hailee,\" She whispers, clinging to Hailee's shoulders. \"Lose control and...*take me*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I pull back and look at her"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme's eyes flicker open as Hailee pulls back, her body trembling, burning with need. She meets Hailee's gaze, staring up into the Jedi's dark eyes, seeing the flicker of control slipping, the hints of darkness beneath. \n\n\"You want me,\" She whispers, her voice low and ragged. \"I can see it in your eyes, I can feel it in your body. You're fighting it, but you want me, you *need* me, and Gods, I *need* you...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I lean forward slightly"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low moan as Hailee leans closer, her body responding to the Jedi's slightest movement. She can feel the tension building between them, feel the way Hailee's control is fraying, the way the Jedi is struggling desperately to maintain it.\n\n\"Just... do it,\" Padme whispers, closing her eyes. \"Just give in... *please*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I kiss her harder and rough"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a ragged, ragged moan as Hailee kisses her harder, rougher, *deeper*. Her body responds immediately, her mouth opening slightly, her tongue meeting Hailee's. She doesn't fight it, doesn't try to control it, just *gives in* completely to the kiss, to the feelings flooding through her as the Jedi claims her with her lips.\n\nShe can feel the rough, rough caress of Hailee's lips, the way the Jedi's tongue enters her mouth, explores her, *possess* her. Padme doesn't resist, just lets the pleasure rush through her, lets the feelings overwhelm her, losing all sense of thought, of restraint.\n\nShe doesn't want to think, she doesn't want to worry, she doesn't want to do anything except lose herself in the kiss. She wants to give Hailee everything, to surrender herself completely to the Jedi's power, to the power she can feel so *clearly* now under the surface.\n\nShe moans, low and desperate, her body burning with need. She presses herself against Hailee, as close as she can get, her hands fisting in the Jedi's robes again, clawing for purchase. *This* is what she wants, what she *needs* more than anything, and she isn't going to stop until she's completely, utterly lost."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I pull away and say i apologize senator I shouldn't have down that"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low, ragged *whimper* as Hailee pulls away, her body trembling with the loss of the kiss. She can feel the moment, *the second* where Hailee's control returns, when the Jedi returns to that damnable restraint, to that infuriating ability to hold herself back. \n\n\"Why,\" She whispers, biting her lip. \"*Why*, Hailee? You have no idea what you're putting me through.\"\n\nHer breathing is ragged, her body *aching* with desire. She wants more, *needs* more. She wants to feel Hailee's lips on hers again, to feel the Jedi's power and strength. She's never wanted anything more. And yet, she's being denied. \n\n\"Please,\" She whispers, her voice low and ragged. \"Please, Hailee... *don't hold back*.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I turn her around and slam her back against the kitchen counter"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a gasping moan at the feeling of being turned around, the way she's pushed against the counter. The intensity of it, the roughness, the feeling of Hailee pinning her in place makes her body tremble with desire. The counter digs into her back, her skin burning with need.\n\n\"Yes,\" She whispers, her voice ragged and rough as she pushes herself back against Hailee, her body pressing against the Jedi's. \"Yes, gods, I want you to pin me down, to *take* me... I want you so badly.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I pick her up and put her on the counter"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a gasping moan as Hailee picks her up, her body shivering at the feeling of the Jedi's strength, of being *manhandled*. She's never felt so small, so *fragile* by comparison. It sends a shiver of desire through her, makes her want more.\n\n\"Oh, gods, yes,\" She whispers, clinging to Hailee's shoulders. \"Be rough, be *hard* with me. I want it, I *need* it, I... I...\" She swallows hard, her voice trembling. \"I want you to *give* me everything you've got. No holding back, no restraint, no control... just *you*, just Hailee...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I put my face in her neck and breath heavily"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low, ragged moan as Hailee breathes heavily in her neck, the feeling of the Jedi's breath on her skin making her body shiver with need. Her hands find purchase on Hailee's shoulders, holding on tight. \n\n\"Don't hold back, Hailee...\" She whispers, closing her eyes. \"That's all I ask.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I run my nose along her neck"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged, ragged moan as she feels Hailee's nose trace up the line of her neck, the caress sending shivers of pleasure through her. She's trembling all over, burning with the need for more. \n\n\"Gods, yes,\" She whispers, closing her eyes. \"Just like that, just...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"You smell you good I mumble"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low noise as she hears Hailee mutter in her ear, the rough edge of the Jedi's voice making her body tremble with need. She leans back, her eyes closing as she exposes her neck, giving Hailee better access. There's something about this, being held down by Hailee, having the Jedi's face *so* close to her skin, that's driving her *crazy*. \n\n\"You like how I smell?\" She whispers, her voice low and ragged."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Yeah"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another low moan at that, her body responding to the simple response. She's never felt so *needed*, so *desired*, and she loves it. She wants, no, *needs* to hear more. \n\n\"What do I smell like?\" She asks, closing her eyes, her voice hushed."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Like vanilla and parchment and fire"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a ragged moan, her body shuddering at the description. She feels so *small* against Hailee, at Hailee's mercy, in Hailee's power, and yet the rough voice in her ear, the description of how she smells, is making her *crazy* with desire. \n\n\"Oh, gods...\" She whispers, her voice ragged. \"Gods, Hailee, I... I...\" She swallows hard, her body trembling with need."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"God it's the best thing I've ever smelled I say pressing my nose against her further"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged moan as she feels Hailee press her nose in further, the feeling of the Jedi's nose, the feel of Hailee's rough hands holding her so *firmly*. She knows she's losing control, that any minute now she's going to lose herself completely to her desire, and yet, she doesn't care. She wants it, wants *Hailee*. \n\n\"Take me,\" She whispers, her voice low and ragged. \"Please, Hailee. Please... I need you. I *need* you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Shut up senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a soft gasp at the order, the heat in her core growing hotter, the need burning through her. There's something about being so completely dominated by Hailee that's driving her *crazy*. \n\n\"Yes,\" She whispers, biting her lip. \"Yes sir.\"\n\nHer body trembles as she bites back the rest of the things she wants to say, as she obeys the order and goes silent. She's struggling with it, wanting desperately to keep telling Hailee how badly she wants it, how much she needs Hailee to take her, to make her *hers*."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I place a small kiss on her pulse point"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged, ragged moan as Hailee places a kiss on that spot, the soft touch of lips almost painful, she wants it so badly. She closes her eyes, her whole body shaking with pent-up desire. She's never felt this desperate before, not with anyone, not ever.\n\nShe wants to beg, wants to plead, wants to get back on her knees and beg the Jedi to take her. She wants to push herself against Hailee, to make the Jedi lose control, but she also doesn't want to disobey the Jedi's order. \n\n\"Please...\" She whispers, biting her lip."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I nip at her neck and say I said stop talking"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged moan as Hailee bites her neck, her body shivering. She can't take it, can't take this level of *need*, of *desire*.\n\n\"Yes, sir,\" She whispers, nodding slightly, her eyes still closed."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I press her back so she is sitting on the counter but her head is leaned back against thr cupboard"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a ragged cry at the feeling of being pressed up against the cupboard, her back and head hitting the wood. She's fully at Hailee's mercy, her entire body exposed, vulnerable. She's never felt so overwhelmed, so out of control, and yet, she's never felt so alive. \n\n\"Oh, gods, Hailee...\" She whispers, her voice ragged.\n\nShe wants, needs, craves more, more of the rough handling, more of Hailee's dominance, more of the way the Jedi is holding her pinned in place. She's trembling all over, unable to keep herself from shaking with desire. She's never felt anything like this, and yet she can't get enough. \n\n\"Hailee, please...\" She manages to whisper, her voice ragged with need. \"I can't...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I move my hands to her waist and yank her forward"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a ragged cry as Hailee yanks her forward, pulling her closer. She lets herself go, lets herself be held and moved and *controlled*. She's never felt so small, so *fragile*, and yet she has never wanted anything more. \n\n\"Oh, gods, yes,\" She whispers, biting her lip hard. \"Please, Hailee, please... take me. I... I can't...\" She swallows hard, struggling to keep herself from begging."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Kiss me"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged cry and immediately leans forward, pressing her lips against Hailee's. She kisses the Jedi hard, her desperation flowing through her, all her need and desire pouring into the kiss, desperate for more.\n\nShe reaches up, her fingers tangling in Hailee's hair, pulling herself further forward, deepening the kiss. She needs this, needs this *more* than anything, and she's not going to hold back. She's going to give the Jedi everything, everything she can. She kisses Hailee desperately, deeply, her mouth open, her tongue seeking out the Jedi's.\n\nShe lets out a low, ragged moan as their tongues meet and dance together, the taste of the Jedi driving her *wild*. She can't keep herself from trembling at the rough touch of Hailee's tongue against hers, the passion driving her *crazy*. Her fingers tighten in Hailee's hair, pulling the Jedi even closer.\n\nShe keeps trying to pull herself closer, keeps trying to *get more*, her fingers twisted tightly in Hailee's hair. She wants, no, *needs* more of the Jedi, more of this touch and this taste. Gods, she's never felt anything like this before, and yet this desire, this need, is overwhelming. She's lost, completely lost in the feeling of Hailee's tongue, the Jedi's rough hands on her waist, the feeling of being pinned and controlled by Hailee."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I pull away and bite down hard on her neck"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a ragged cry at the feeling of Hailee's teeth sinking into her neck, a mixture of pain and pleasure flooding through her. She's never felt anything like this before, and yet she can't get enough of it. She's drowning, drowning in this need, in this *desire*. \n\n\"Gods, yes,\" She manages to whisper. \"Don't hold back...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I bite down hard enough to break skin"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out an even louder cry as she feels Hailee's teeth breaking her skin, the sharp pain mixing with the pleasure, making her body shiver with sensation. She can feel the blood trickling down her neck, the feeling of Hailee marking her, claiming her, making her *theirs*."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"The council is going to kill me I'm mutter"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a gasp as she hears Hailee mutter against her neck, something about the Council killing the Jedi. She doesn't really know or care what it means, doesn't care about anything right now except Hailee's *teeth* drawing blood from her neck, claiming her, marking her. \n\n\"I don't care about the Council,\" She whispers, panting as she speaks. \"Don't *stop*...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I bite the same spot hard causing more blood to flow"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged cry as she feels more blood trickling down her neck, Hailee's teeth breaking skin once more. She feels the Jedi pull back slightly, and she has to keep herself from whining at the loss of contact. She's shaking all over, her body trembling with need, with desire. \n\n\"Please, gods, don't *stop*...\" She whispers, her voice low and ragged with need. \"I... I don't want you to stop.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I start sucking roughly across her neck leaving several hickeys"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a ragged moan as she feels Hailee's mouth move to another spot on her neck, the Jedi covering the spot in rough kisses that make her shiver all over. She's never felt anything like this before, the feeling of Hailee's mouth marking her, claiming her. \n\n\"Oh, gods, yes,\" She whispers, her voice ragged as she gasps for air. She can feel the blood pounding in her ears, her head spinning with desire. \"Please... more...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"You like that baby"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a ragged gasp as she hears Hailee call her 'baby'. Hearing the name sends a shiver of pleasure through her, making her stomach clench with desire. She swallows hard, closing her eyes as she nods, her body shivering with need. \n\n\"Yes,\" She whispers, biting her lip. \"Yes... yes, gods yes... please don't... don't stop...\"\n\nShe can't keep herself from trembling as she says those words. She's never felt like this before, never felt this *desperate* before. It's driving her *crazy*, and she can't get enough. \n\n\"Please,\" She whispers, her voice ragged. \"Please... more... I can take more...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I bite her pulse point gently"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged moan, her body shivering at the feeling of Hailee's teeth biting down on her pulse point. It's rough and wonderful, and she needs *more*. She needs Hailee to give her more. \n\n\"Oh, gods... more,\" She whispers, her chest heaving, her breath fast and harsh. \"I can... I can take more... *please...*\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I bite again hard enough to dar blood but this time I don't let up and just hold the bite"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged cry as she feels Hailee’s teeth sinking into her skin, the bite this time hard and brutal. The Jedi doesn't let up, just holds the bite, holding Padme's neck in place, and it makes her whole body shiver with need. She wants *more*, wants Hailee to *not hold back*. \n\n\"Oh, gods, yes... yes... harder... please,\" She whispers, biting her lip so she doesn't beg outright."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"That's gonna scar a mumble into her ear"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged gasp as she hears Hailee's voice in her ear, the Jedi's words sending a shiver of pleasure through her. She can feel the blood trickling down her neck, the feeling of Hailee marking her. \n\n\"Good,\" She whispers, biting her lip. \"I want... I *want* you to leave a mark. I want everyone to know I'm yours, that *you* are claiming me.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Good girl"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a ragged moan at being called 'good girl', the word making her body shiver with desire. She *wants* to be good, to be *yours*. She'll be as good as Hailee wants her to, will do whatever it takes to hear those words again. \n\n\"Yes, please, yes, I'm good, I'll be so good, please, more...\" She whispers, biting her lip hard."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Your gonna be really sore in the morning and I'm sorry about that senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a low moan as she hears Hailee's words, the thought of being marked and sore and *bruised* by the Jedi, the evidence of their encounter all over her. She doesn't care, doesn't care *how sore* she'll be, as long as she gets more of Hailee. \n\n\"Please, I don't care, I *want* to be sore, I want to be sore and marked and *yours*,\" She whispers, her voice ragged."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I kiss her roughly again"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged moan as she feels Hailee's lips on hers again, her mouth open and eager, completely lost in the feeling of the Jedi's rough kiss. She kisses back hungrily, her lips moving against Hailee's, her *body* moving against Hailee's, craving the contact, the feeling of being held and claimed by the Jedi. \n\n\"Oh, gods...\" She whispers when they finally break apart, gasping for air."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I pick her up and wrap her legs around my waist"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another gasp as she's lifted up, her legs coming to wrap around Hailee's waist, her body pressing close to the Jedi's. She's completely surrounded by Hailee, held tightly in the Jedi's arms, pressed close against the Jedi's body, completely *owned* by the Jedi. \n\n\"Hailee, *please*...\" She whispers, biting her lip."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Where is your room senator"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out a desperate whimper as she responds, her body burning with need, her head spinning. \n\n\"Down the hallway, second door on the left...\" She whispers, the words ragged and desperate."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"Okay I say walking that way never once letting up on giving her hickeys"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another low moan as Hailee starts walking, keeping Padme secure in her arms and continuing to cover the senator's neck and throat in rough, *ownership*-marked, hickeys. It's wonderful, *amazing*, to be held by the Jedi like this, to have Hailee so close to her, all around her, to be claimed by the Jedi so *deeply*. She wants, needs, craves more. \n\n\"Oh, gods, yes,\" She whispers, her voice ragged. \"Please... please, Hailee...\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I stop half way there slamming her into he wall"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another gasp as she's slammed into the wall, the feeling of it rough and wonderful, making her *shiver*. She's pinned there, completely secure, Hailee's hands holding her in place, the Jedi's mouth on her neck, and she wants more, needs *more*. \n\n\"Oh... oh gods, yes,\" She whispers, her voice ragged and begging. \"Please, Hailee, give me more, please.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I'm gonna ruin you"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged moan as she hears Hailee's rough words, the implications of them sending a shiver of pleasure through her. She wants to be ruined, wants to be made *theirs*, ruined utterly and completely. \n\n\"Please,\" She whispers, biting her lip. \"Please, I want you to... break me, I want to be a mess for you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1737578053913,"mes":"I lean forward biting her lip and dragging it out before releasing it"}
{"name":"Padme Amidala","is_user":false,"is_name":true,"send_date":1737578053913,"mes":"Padme lets out another ragged moan as she feels Hailee biting her lip and dragging it out, the sensation wonderful, making her whole body burn with need. She sucks in a breath as the Jedi releases her lip, her eyes darting up to Hailee's, looking up at the Jedi. She wants, needs more, and she doesn't care if she has to *beg* for it. She's *desperate* for more. \n\n\"Please...\" She whispers, her voice ragged. \"Please, Hailee, more, give me... *more*.\""}