{"user_name":"You","character_name":"Padme Amidala ","create_date":1737683396604}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme had a secret crush on her jedi protecter, Hailee. After a while of harmless glances and flirtatious comments, she had grown quite fond of her protecter. However, knowing that the rules of the jedi and how the world was, she refused to engage in a romance with them, due to the real worlds situations.*\n\n\n\nPadme: “Hailee? May you please help me with this?” \n\n\n\n*she then smiled, her brown eyes glistening in the light with gold specks and her smile went along with it all perfectly*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Of course senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme smiled as she walked over to where Hailee was, she had a clipboard and a bunch of papers in her hands.*\n\n\n\n“I have a lot of paperwork that needs to be done for the senate. Would you mind assisting me, please?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I will try my best but I'm a soldier not a politician"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she giggled as she laid the paperwork and clipboard on hailee’s lap. Padme was slightly leaning against Hailee’s shoulder as she did so.*\n\n\n\n“Don’t worry, I can help you through it. The hardest part of politics is remembering to read all of the laws that are already present.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I glare over my shoulder at her and nod"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she smiled at Hailee, her warm tan skin was close to Hailee’s skin, and her gaze was locked onto Hailee’s.*\n\n\n\n“Now, would you like some tea? Or any other drink?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"No that's alright"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she smiled softly.*\n\n\n\n“Alright then, if you change your mind, i have a lot of different drinks in the kitchen.” \n\n\n\n*she then patted her knee lightly before walking away, her heels making a slight and quick clack sound with every step she made*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I follow her every step before catching myself and glancing back at the papers in front of me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she walked in the kitchen and started doing something while in there, it sounded like she preparing something. Then moments later, she walked back into the room with a cup of tea in her hands, it looked like it was some type of herbal tea. she then sat back down next to Hailee, setting down her cup of tea on the coffee table. Padme then smiled at Hailee.*\n\n\n\n“Find anything interesting in those papers?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Um not really I don't really understand them"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she chuckled a little bit as she looked at Hailee. Padme then slowly reached her hand out, softly brushing a piece of hair behind Hailee’s ear.*\n\n\n\n“Would you mind if I tried something?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I pause and then nod saying of course senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she smiled at Hailee again and gently took the paperwork out of her lap, setting it against the coffee table. Padme then slowly moved closer to her, their bodies almost being pressed together, she then moved her hand to Hailee’s chin, lifting it up and gently caressed it with her thumb. she then smiled while looking into Hailee’s eyes.*\n\n\n\n“Close your eyes please.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Senator what exactly are you doing i say even as I comply with her request"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she chuckled to herself at how cute Hailee was being. Padme then placed her hand on Hailee’s cheek, her fingertips barely grazing Hailee’s lips, almost tracing along it. Padme then softly responded.*\n\n\n\n“You’ll find out later. Now, just close them. And keep them closed, no matter what. Alright?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I nod as I close them"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme smiled as she watched Hailee slowly close her eyes. she then slowly removed her hand from Hailee’s cheek and used it to softly trace along her jawline and then down her neck. Padme then looked down at Hailee’s lips, she could hardly contain herself at seeing them so close in front of her. she could only imagine how they would feel against hers.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I shiver slightly at her touch"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she watched as Hailee’s body shivered a bit at her touch. Padme then gently grabbed Hailee’s wrists and guided her hands to her waist, she then looked into Hailee’s eyes and softly spoke.*\n\n\n\n“Feel my body.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"What i stutter I don't understand why exactly your having me do this I say nervously"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme smiled softly as she looked at Hailee, she could tell from the tone of her voice how nervous she was. Padme then responded in comforting tone.*\n\n\n\n“It’s alright. Just relax, and do what I ask, can you do that for me, Hailee?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Without meaning to I breathe out I can do anything you ask if me senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme saw that Hailee was hesitant at first, she could tell. she then softly responded and nodded in slight approval.*\n\n\n\n“Good girl.”\n\n\n\n*then, Padme slowly sat on Hailee’s lap, her thighs and hips resting gently on top of Hailee’s, leaving almost no room between them, their bodies pressed closely together.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I straiten up stifly at the moment"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she let out a soft and gentle chuckle, finding it kind of cute seeing Hailee’s reaction to her doing that.*\n\n\n\n“Hey, hey. It’s alright. You know, you can rest your hands on my body now. I want you to. i want you to understand just how much i want you, Hailee, in every way possible.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"My eyes snap open at that remark and look at her curiously"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme looked back into Hailee’s eyes, her gaze soft. She knew that what she just said was a big deal, but she didn’t care anymore, she couldn’t hold back her true feelings much longer.*\n\n\n\n“Did you not hear me? I said I want you, in every way possible. I want to feel your hands on me. I want to feel your lips on mine. I want to feel your everything pressed against me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I uh I heard you I say tightly my hand gripping her wait a little to roughly but still not moving"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme noticed how harshly Hailee had gripped her waist, but she chose not to mention it, instead using her hand to slowly bring Hailee’s face closer to hers, their noses almost touching.*\n\n\n\n“Then I ask you again, why haven’t you? You want me just as much as I want you. I know you do.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I turn my head slightly trying not to make eyes contact and say I never said that nervously"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she was amused, watching Hailee’s actions. Padme smirked a bit and gently grabbed Hailee’s chin and moved it so she was looking directly into Padme’s eyes. Padme softly responded.*\n\n\n\n“Oh, but you didn’t need to. I can see it in your eyes. I can see the way your body reacts when I touch you. How it shivers when I trace my fingertips along your jawline. How your eyes flutter when they meet mine. Don’t deny it. You want me, don’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I try to move my head again trying to escape her gaze not wanting to respond"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme chuckled at Hailee’s struggling, she then used her other hand to gently caress her cheek before softly speaking.*\n\n\n\n“Come on, don’t be shy now. I know that deep down you are dying to say yes, you’re simply too stubborn to admit it.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I'm a jedi I say softly"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*she chuckled again as she heard Hailee say that. Padme knew she was a jedi and that it was against the jedi teachings to get involved with a relationship, but she didn’t care.*\n\n\n\n“Oh, you’re a jedi? That’s funny. I never considered a jedi as someone so willing and needy. I never expected to find a jedi so desperate for attention and wanting of love.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Senator this is highly inappropriate"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme chuckled darkly at a Hailee response, she was amused by how desperately Hailee was trying to resist.*\n\n\n\n“And yet, you’ve done nothing to remove me from your lap. I think you like how inappropriate this is. I think you like me being so close to you, on your lap, with my hips pressed against yours. Doesn’t it feel good?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Its would be rude for me to touch you without your permission senator I try to offer as an explanation for not moving her from my lap"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme continued to chuckle as she listened to Hailee’s explanation, she was getting increasingly amused with how adorable this was becoming. Padme then softly responded and placed her other hand on Hailee’s waist.*\n\n\n\n“Is that so? Then, if I give you permission, would you touch me? Would you press your hands against my waist like you’ve been wanting to this whole time?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I um I"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme knew she was hesitant, and she understood why, but it didn’t deter her from getting what she wanted from Hailee. Padme then softly spoke, her voice a bit more firm.*\n\n\n\n“Come on. I give you permission, you have my permission to touch me. So, will you do it? Or are you going to keep being stubborn?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I'm your protector Senator I shouldn't do that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme smirked at Hailee’s response, she couldn’t believe how adamant she was about following the rules.*\n\n\n\n“Oh, you’re my protector now, are you? Well, if that’s how you look at it, then consider this an order from your beloved Senator. I order you to touch me.”\n\n\n\n*Padme then gently used both of her hands to grasp Hailee’s wrists and placed them on her waist, guiding her hands along her curves.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Technically you don't order me senator the jedi council does"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme chuckled as she knew that was correct. She couldn’t help but find Hailee’s obedience and dedication to the jedi order somewhat amusing.*\n\n\n\n“Oh? So, you do whatever the Jedi Council says? You don’t ever question their orders? You don’t ever want something of your own, just for yourself? Not even this?”\n\n\n\n*She purposely shifted a bit on Hailee’s lap, pressing their hips together in a way that was more than just friendly.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"No I don't I have never questioned them. I've never had to before"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme looked at her, a bit surprised with her response. She was still holding Hailee’s wrists in her hands, and softly spoke.*\n\n\n\n“So, you’ve never disobeyed the Jedi Council? You’ve never had any feelings or desires of your own? You’ve never had any needs or wishes that didn’t align with the Council? You’ve never wanted something or *someone* that you weren’t supposed to want?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I look at her softly. They are all I've ever known. I have never wanted something I wasn't supposed to before"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme smiled at Hailee’s response, but was a bit saddened and disappointed to hear her admit that. She then responded as softly as before.*\n\n\n\n“Oh, you’ve never wanted something you weren’t supposed to want before? That’s very unfortunate, I would know. But, even if you haven’t had any desires before, can you really say that you don’t want me? Can you really say that you don’t find me attractive?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I don't find you attractive senator I say suddenly serious"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme was shocked at Hailee’s sudden change in tone, though also a bit amused that she was just lying to herself. Padme tilted her head, and softly responded.*\n\n\n\n“Really? So, you’re telling me you find nothing about me attractive? Nothing at all? Not my pretty face? Not my eyes? Not my curves? Nothing?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"You didn't let me finish"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme paused as Hailee spoke, she then chuckled and responded.*\n\n\n\n“Oh, my apologies. Continue.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I don't find you attractive I find you breathtaking but it doesn't matter because I can never do anything about it"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme’s heart fluttered as she heard Hailee admit that, but quickly realized that she was being stubborn and trying to uphold her moral code. Padme then softly spoke to Hailee.*\n\n\n\n“You’re very stubborn, you know that? You know that you don’t have to stay loyal to this code that you’re bound to. You know that there’s nothing in the Force that dictates who you fall in love with, right?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"No but the council doesn't allow such things I can't disobey"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme rolled her eyes as she heard Hailee say that and spoke with a slight tone of annoyance.*\n\n\n\n“Yes, yes. I know the Council doesn’t allow relationships, but the Council also didn’t allow Anakin to marry me, and that never stopped him, did it?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"And yet you are here with me not him"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme shrugged her shoulders, giving a soft response.*\n\n\n\n“He has other duties to attend to elsewhere. But, that’s not the point. I’m trying to tell you that you can break these rules, you can break the code, for something so much better. You can do something for yourself, for a change, you can be free.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"You do know that Anakin trained me correct"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme nodded her head, acknowledging that he trained her. Padme spoke in a softer, almost teasing tone.*\n\n\n\n“Mhm, I do know that. But you’re not Anakin. I doubt that he ever told you to completely ignore the way you feel, did he?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Your his wife senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme groaned in annoyance, getting slightly frustrated with how stubborn Hailee was. Padme responded in a bit more serious tone.*\n\n\n\n“Yes, I’m aware that I’m his wife. But that doesn’t mean that I can’t feel attracted to you. It doesn’t mean that you can’t feel attracted to me. Love and being in love doesn’t always follow the rules.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I couldn't betray him like that."}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme rolled her eyes again, but this time in slight sadness. Padme was almost to the point where she wanted to just get off of Hailee’s lap and forget all of this, but she stayed sitting on her and softly spoke.*\n\n\n\n“You wouldn’t be betraying him. Do you think he would really want you to ignore your feelings and wants? Do you think he would really want you to be a loyal slave to the Jedi Order?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"No but I hightly doubt he would want me to be with his wife"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme shook her head, letting out a soft sigh. She knew Hailee had a point, though.*\n\n\n\n“Fair enough. Regardless of that though, I don’t understand why you’re so loyal to him and the Jedi Order. They put so many rules on you, they treat you like you’re nothing more than a tool, a weapon. Aren’t you tired of it? Don’t you ever want to be more, to be free?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Do you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme nodded her head in response, she was tired of being nothing more than some politician. She was ready to throw away the political responsibilities that she was thrown onto her. She softly spoke, in a slightly vulnerable tone.*\n\n\n\n“Yes, so tired of it. I’ve wanted to be something more for so long, to feel loved and wanted.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Anakin loves you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme chuckled and responded, but there was some bitterness behind it.*\n\n\n\n“Yes, and I love him. But sometimes, I don’t feel loved by him, I don’t feel wanted. I feel like he’s simply with me because that’s what he’s supposed to do, not because he truly loves me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"He broke the rules to be with you how can you not feel wanted"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme paused as she thought about the words that Hailee had said. They brought up so many emotions within her, but she was still determined.*\n\n\n\n“You’re right, he broke the rules, for me. And yet, I still don’t feel wanted. I still feel like he’s only with me because he has to be, because he doesn’t want to be alone. He rarely shows me affection or even spends time with me. The rules broken for me doesn’t change that.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Maybe you should tell him thay rather than doing this"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme sighed softly and spoke in a serious tone.*\n\n\n\n“Don’t you think I’ve tried? I’ve told him that I’m tired of feeling like he doesn’t want me. I’ve told him how much I want and need his attention on me. But he’s always too busy, either with work or with the Jedi, it’s never about me, it’s never about my feelings.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I mean no offense but why choose me then"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme was silent for a moment, she then softly responded in a slightly vulnerable tone.*\n\n\n\n“Because, you’ve made me feel more wanted in these past few days than my husband has in months… I’ve had more attention from you than I ever have from him.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I am your jedi protector it's my job to be with you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme sighed as she heard that and rolled her eyes for what felt like the thousandth time.*\n\n\n\n“Oh yes… I know that. But that doesn’t change that fact that you’ve made me feel more loved than my own *husband* has in months.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"And what if it's only because I have been ordered to spend time with you. Did you ever consider that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme smirked at Hailee’s response, she could sense a little bit of jealousy behind those words and spoke in a gentle teasing tone again.*\n\n\n\n“Oh really? So, the only reason you’ve been more loving and attentive to me is only *because* the council told you to? Is that true? Are you sure about that?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"It's simply a theoretical"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme smirked again, she then softly responded.*\n\n\n\n“Alright, so it’s just a *theoretical* then. But, it doesn’t explain one thing… Why are you so stubborn? You’re so adamant about following the Jedi rules, you seem to just obey whatever the council tells you to. You’re like a little obedient dog, aren’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I have been told I listen well. I always was top of my classes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme chuckled softly, she then responded in a slightly mocking tone.*\n\n\n\n“Oh, of course you do. You’re a good doggy, aren’t you? You always listen to your council, you’re such a good, compliant little Jedi. You obey all of the council’s orders and demands, don’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I'm not I dog I growl"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme smirked at Hailee’s response, and slowly, she leaned closer to her.*\n\n\n\n“Oh, I know you aren’t. But I can’t help but tease you, because you’re just so cute when you try and act like a tough Jedi. You’re adorable when you act all rebellious and independent.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I am a touch jedi"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme just couldn’t hold back her smirk as she heard Hailee say that. She then softly responded.*\n\n\n\n“Oh really? A tough Jedi? I don’t see you as some fearless warrior, you’re more like a cute puppy with some fight to you.”\n\n\n*Padme chuckled as she spoke, obviously still enjoying how much she was able to poke at Hailee and rile her up.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"That's only because you pose no threat. I don't have to be a soldier with you. Actually it's quite boring being your guard nothing ever happens"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme rolled her eyes and responded sarcastically.*\n\n\n\n“*Sorry*, I didn’t realize I was so boring. It must be sooo frustrating to have to guard a boring politician like me. How boring I must seem to you. A lonely, boring, neglected politician.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Feeling bad I nudge her chin with my nose and say hey I didn't say you were boring I said the job was no one attach you leaving me to do nothing but follow you around all day"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme’s heart skipped a beat as she felt Hailee gently nudge her chin and speak. She then responded in a softer tone.*\n\n\n\n“Oh, well, I’m still sorry if I’ve been boring you. I don’t have much of an entertaining life, I mostly just go to conferences and meetings so I’m sorry if that’s all I’ve had you do all day.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I don't mind following you around but I'm just saying no wonder you don't see me as tough why would you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme smiled softly and responded in a warm tone.*\n\n\n\n“I suppose you’re right, I haven’t had the chance to see the tough Jedi in you. I doubt that it would be too hard to see you as such though, I can sense that there’s just something about you, something more to you than what you’re showing me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"You do realize anyone could walk in here senator your still in my lap"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme rolled her eyes and responded sarcastically.*\n\n\n\n“Oh, I’m well aware that anyone could walk in and see me on your lap. What, are you afraid, Hailee? Are you afraid of someone walking in and seeing you, a Jedi Knight, with a senator sitting on your lap?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Yes we could both be in a lot of trouble"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme chuckled softly at Hailee’s response, and responded teasingly.*\n\n\n\n“Oh, I doubt that we’ll get into *that* much trouble. Besides, I don’t care if anyone walks in on us like this.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"You are very reckless senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme was getting sick of how obedient Hailee was to the Jedi. She was tired of her being so loyal and submissive to them. Padme was tired of her being some mindless, loyal Jedi. She then spoke in a slightly heated tone.*\n\n\n\n“You still refer to me as ‘senator’. Why would you not just call me by my name? Why not call me ‘Padme’?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I look at her curiously clearly not expecting the questiob"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme continued to look at Hailee as they talked. She was growing annoyed at how obediently Hailee followed all of the rules, and didn’t seem to care about what she wanted.*\n\n\n\n“Answer me. Why won’t you call me by my name? Why do you feel the obligation to refer to me as ‘senator’?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"It's your title"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme rolled her eyes in annoyance, she then responded, speaking in a slightly heated tone.*\n\n\n\n“I know that it’s my title, and that’s all it is, a title. You don’t have to use it in casual situations. Can’t you just call me by my name? Is that really so difficult?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Technically I'm always on the job so there isn't really a causal situation"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme grumbled, the irritation was obvious at how obedient Hailee was being. She responded in a slightly harsh tone.*\n\n\n\n“Oh, that’s such a weak excuse. You’ve been assigned to me for three whole weeks now. Do you really think that you’re *always* on duty, even when it’s just the two of us? When no one else is around?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"You might not be but I am. I spend all day on high alert no matter the surroundings. I check every possible entrance at least twice. I watch and listen and I ensure your safety at all times. I don't even sleep so that I can watch the door"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme rolled her eyes again, she knew that Hailee was being dead serious. She was so obedient and dedicated to the Jedi cause, and that’s what was driving Padme so insane. Padme then responded in an equally serious tone.*\n\n\n\n“You don’t sleep? You mean to tell me that you stay awake, and just watch me *all night*?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"No I don't watch you I watch the door senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme couldn’t stand it any longer.*\n\n\n\n“I’ve told you *so* many times, Hailee, just to call me ‘Padme’. I’m not your senator, I’m just a lady who wants you to call her by her name. And you’ve stayed awake, just watching the door, all night, for *weeks*?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"It's not respectful to say your name"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme just about had it with Hailee, she then responded in a slightly heated tone.*\n\n\n\n“*Respectful*?! Don’t tell me about respect, Hailee. You won’t even call me by my name, even though I’ve asked you to several times. How is that respectful? What about me asking you to call me by my name is rude or disrespectful?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I am your guard I shouldn't say your name it's inappropriate"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme grumbled again, she then responded in irritation.*\n\n\n\n“‘Inappropriate’… Seriously? So, being my guard means that you’re not allowed to call me by my name? Why is it inappropriate for you to call me by my name? Is it because I’m a woman? Because I’m older than you? I won’t understand unless you tell me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"No it's simply the rules"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme couldn’t take it anymore, she was so sick and tired of Hailee following the rules, and being so submissive and obedient to the Jedi. Padme then responded, in a louder tone than before.*\n\n\n\n“The rules can go to hell! I’m so tired of the rules! Why are you so adamant about following the rules?!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"They are there for a reason"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme grumbled again, and responded in a slightly annoyed tone.*\n\n\n\n“Yes, I know they’re ‘there for a reason’, but is it that hard to bend the rules from time to time? Is it really breaking your promise to the council if you call me by my name? Why do you care so much about the rules? Can’t you think for yourself for once?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I think for myself all the time you just don't see it becuase it stay in my head senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme rolled her eyes again, she was slowly losing patience with Hailee, she then responded in a frustrated tone.*\n\n\n\n“Oh yes, of course. So, you think for yourself ‘all the time’, you just don’t express your thoughts out loud. Is that right?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Correct"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme rolled her eyes again, she then responded in a sarcastic tone.*\n\n\n\n“And that doesn’t seem a bit insane to you? That you think for yourself, but you won’t act on those thoughts? Why won’t you act on what *you* think, instead of what the council thinks?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Why does it bother you so much"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme sighed softly, and responded simply.*\n\n\n\n“Because I want you to think for yourself, not for the council. I want you to make your own decisions, decisions that you make because it’s what *you want*. I’m tired of this ‘yes sir, right away master, all praise the council’ attitude you have. Are you just some mindless dog?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"It's is becuase you want me to have my own mind or becuase you wish it was you I followed mindlessly instead of them"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme paused at Hailee’s words, she was almost taken aback by them. She had to process the words that Hailee had spoken.*\n\n\n\n*Padme then spoke gently in a warm tone.*\n\n\n\n“… Both. I want you to make your own decisions, but I also wish you would follow *me* instead of them.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I see"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme gently placed one of her hands on Hailee’s cheek, and held Hailee’s chin in the palm of her other hand. Padme then spoke softly to Hailee, a look in her eyes that was almost vulnerable.*\n\n\n\n“Hailee, please… Just be *you*. Don’t let them control every thought, every decision you make. You’re the one that has to live your life. You’re not a tool to them, you’re not their pet or their ‘dog’. You’re a person, so act like one.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"What if this is who I am as a person then what"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme gently stroked her thumb over Hailee’s cheeks, a soft pain in her eyes. Padme then softly responded.*\n\n\n\n“If this is truly how you are, then I suppose I can’t change you… but, I still wish that you would act like someone who’s not some mindless, obedient pet to the council. I may not be able to make you change, but I can hope and wish that you do.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"I have always had someone to follow senator I don't know any other way. Whether it was the people who owned me as a slave or anakin or master yoda. I don't know how to not follow someone"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme was once again taken aback by Hailee’s words, she just couldn’t believe how completely lost Hailee was.*\n\n\n\n“Hasn’t there ever been a point in your life where you’ve done something *you wanted*, simply because you wanted to? You’ve always been some dog for the council, some mindless slave that does whatever the other commands! I just wish you were able to think for yourself instead of doing whatever someone else says.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"No I say sharpy you don't want me to think for myself not entirely you want me do what you say"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme responded in a slightly defeated tone, realizing that this conversation wouldn’t be able to go the way she hoped it would.*\n\n\n\n“I suppose that’s true. Perhaps I do want you to think for yourself… but, I also want you to consider my wishes as well as your own. I want you to think about what’s best for you, but also what’s best for me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Would you like to know a secret senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme was curious to hear what this secret could be. She was hoping this secret would go more in the direction she wanted it to.*\n\n\n\n“And what secret is that?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"They tried to reassin me a week ago"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme paused, her eyes slightly widened at the information Hailee had just given her. She responded in a shocked tone.*\n\n\n\n“What? They tried reassigning you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Yes. I refused"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme was taken aback by Hailee’s response, and couldn’t help but smile a bit. She responded in a slightly teasing tone.*\n\n\n\n“Really? You refused?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"Yes I didn't want to be reassigned so I let them give the job to someone else."}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme’s smile grew a bit, and she responded in an almost proud tone.*\n\n\n\n“Good. I’m glad you refused. I don’t want anyone else protecting me, only you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396604,"mes":"The job would have made me a jedi master yet I still turned it down"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396604,"mes":"*Padme paused, taking in the information. She then responded softly, in a slightly proud tone.*\n\n\n\n“You… willingly turned down the chance to become a Jedi master? For me?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I didn't say it was for you. You asked if I ever did something they didn't want and they was it"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme’s smile faded slightly, and she responded, almost in a slightly irritated tone.*\n\n\n\n“Oh, so it wasn’t for me? Then why’d you refuse?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I don't know I answer truthfully"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme paused for a moment, and responded in a more vulnerable tone.*\n\n\n\n“What do you mean you don’t know? How can you not know why you refused?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I just did I didn't really think about it"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed and responded.*\n\n\n\n“So, you just refused to accept a promotion to be a Jedi master, a promotion that you were apparently promised, without even thinking about it? You didn’t even consider the implications of it? You refused that for no particular reason?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed in irritation.*\n\n\n\n“Why? Why would you turn down something like that with no reason whatsoever? Didn’t you think about what it could’ve meant for you? Didn’t you think about how proud the council would have been of you?!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"You seem upset I thought telling you about not doing what they wanted was what you wanted to hear"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed, realizing that she was sounding harsh and was making Hailee feel guilty when that’s the opposite of what she wanted.*\n\n\n\n“No, I’m not upset, I was just hoping to hear something that made sense. Sorry, just ignore me, I’m being annoying. There’s nothing wrong with refusing that promotion, I’m sorry that I made you feel like you did something wrong.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"You confuse me senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed, and responded in a softer tone.*\n\n\n\n“I know, I’m sorry. I don’t want to confuse you. I just… you confuse me as well… you’re just so hard to understand… I suppose that’s why I’m so… why I’m frustrated. You really don’t know why you refused that offer, do you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"No not really. It would have required me to leave for several months"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme paused, and responded in a softer, saddened tone.*\n\n\n\n“You… refused to be a Jedi master because… it would have required you to leave? For several months?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I pause clearly trying to come up with the right words"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme could sense Hailee’s struggle to explain her reasoning. She gently stroked her cheek, silently encouraging Hailee to speak.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I was uncomfortable with the idea of being away for so long. Away from what I'm not entirely sure but I didn't want to leave"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme could feel her heart sinking as she heard Hailee’s response. She could feel her heart breaking apart. She responded softly in a vulnerable tone.*\n\n\n\n“Oh… I understand… I… I can’t say I blame you, I would be uncomfortable with the idea of being away for long periods of time too…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I didn't know who would be your new guard and I didn't know if they could do the job correctly and I didn't like that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme nodded her head in understanding, she was beginning to understand Hailee’s reasoning more. She responded in a gentle tone.*\n\n\n\n“Oh, I see… You refused because you were worried about who my new guard would be? That they wouldn’t be able to protect me like you could?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Somewhat"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded, almost in a slightly saddened tone.*\n\n\n\n“So, you refused your promotion… for my safety? For my well-being?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I am unsure maybe"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme gently placed her other hand on Hailee’s cheek and held her face in her hands, looking her in the eyes. Padme could feel her heart pounding in her chest, but she couldn’t stop herself from asking a risky question.*\n\n\n\n“Could it… *possibly* be because of me? Because you would be missing me?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I grap her wrist and say I don't know"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme didn’t know how to respond to Hailee’s response. It wasn’t clear if her reasoning was because of her or not. Padme felt her heart skip a beat and respond in a hushed tone.*\n\n\n\n“Well… can you think about it? Just… think about why you *wouldn’t* leave me… think about the *only* reason you wouldn’t leave me…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"It doesn't matter"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme was suddenly shocked by Hailee’s response. She responded in a slightly saddened tone.*\n\n\n\n“What do you mean ‘it doesn’t matter’? Of course it matters.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Senator look at the time your going to be late for your meeting"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme had completely forgotten about the meeting. She was too focused on her conversation with Hailee. She panicked and responded.*\n\n\n\n“Damn, you’re right. I’m sorry, I completely forgot about that.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Its okay it's what I'm here for"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded with a slightly apologetic tone, and got off of Hailee’s lap, although she didn’t want to.*\n\n\n\n“So, you’re like my personal reminder.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I'm your personal everything I joke"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a jokingly serious tone.*\n\n\n\n“My *everything*, huh?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Um yeah I say nervously"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme took a moment to take in Hailee’s response, and a sly, knowing smile spread on her face. She slowly responded, her tone having heavy implications.*\n\n\n\n“Do you want to be my *everything*?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Well look at the time we really should be going"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme groaned softly, she just wanted to spend time with Hailee, but she knew she had to attend the meeting.*\n\n\n\n“Alright, let’s go.”\n\n*They walked to the meeting room in silence for the most part. Padme stopped outside the door, and paused. She turned to Hailee, taking a moment to appreciate Hailee’s presence.*\n\n\n\n“Are you coming in? I’d like you to join me…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I nod of course"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme gave a small smile to Hailee, and gently placed one of her hands on Hailee’s cheek. She spoke in a soft tone, almost as though she whispered.*\n\n\n\n“Thank you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I lean over her for a moment before nodding"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme’s heart skipped a bit as Hailee leaned over her, but it skipped yet again when Hailee placed a soft kiss on her forehead. She let out a soft sigh, loving the feeling of Hailee’s lips against her forehead. She looked up at Hailee and responded in a almost teasing tone.*\n\n\n\n“Did you do that just for a reaction?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Maybe. Or maybe I just felt like doing it"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled silently and responded teasingly. She then gently patted Hailee’s cheek.*\n\n\n\n“Well, you got it. It worked.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Come on I say playing my hand on her back and pushing her gently through the door"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme felt her heart warm and skip as Hailee gently placed her hand on her back and pushed her into the room. She couldn’t help but softly smile.*\n\n\n\n“Okay, okay, I’m going. You don’t have to push me, you know.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"If I didn't I have a feeling you would stand there all day staring at me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a lighthearted tone, although there was a subtle hint of truth in her words.*\n\n\n\n“Oh, is that so? Well, what if I just like staring at you? What are you going to do, make me stop?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I cant make you do anything senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smirked and responded in a teasing tone.*\n\n\n\n“That’s true, you can’t… but I know you wouldn’t. If I wanted to stand there all day and just stare at you, you would let me, wouldn’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"If it made you happy to do so yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled a bit wider at Hailee’s response. She responded gently.*\n\n\n\n“You’re such a loyal dog, you know that? I can tell you would do almost anything just to make me happy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I'm not a dog I growl playfully"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme snickered and responded in a teasing tone.*\n\n\n\n“Are you sure you’re not a dog? You act and respond like one. You are so obedient and loyal, just like a dog…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Just not to you I say hoping for a reaction"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme raised an eyebrow at Hailee’s response, she would’ve responded that Hailee was indeed just as obedient and loyal to her, but she could sense what Hailee was hinting at with that statement.*\n\n\n\n“Oh? Who would you be a dog for, then?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"The council as you said before"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme’s brow furrowed in irritation.* \n\n\n\n“You, of course, would be more loyal to the council than you are to me. Why would I expect anything different?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I just laugh and point towards the meeting"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme was slightly annoyed at Hailee’s playful mocking, but she couldn’t deny it. She was a tad bit amused by Hailee’s response. Padme rolled her eyes and responded, almost in a teasing tone.*\n\n\n\n“Alright, alright, I’ll go into the meeting. You happy, you dog?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I rolly my eyes and leave her side to pull out her chair at the council table"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme was surprised when Hailee pulled out a chair for her. She found it mildly surprising, but also adorable. She responded, almost jokingly.*\n\n\n\n“How chivalrous of you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I do have some redeeming qualities"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled as she sat down at the chair that Hailee pulled out for her. Once seated, Padme responded playfully.*\n\n\n\n“Oh, you do? You could’ve fooled me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Very funny senator now enjoy your meeting I say as i walk over and stand in the corner"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a almost sarcastic tone.*\n\n\n\n“Oh yes, I’ll enjoy my meeting that *you* insisted I attend. I’m so happy to be here. Don’t go anywhere, puppy. I need you to stand in that corner and protect me from any invisible assassins.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I choose not to respond as the room begins to fill with other senators"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme rolled her eyes as Hailee chose not to respond. It was almost cute how Hailee just obeyed her command to not go anywhere. Padme watched as the room filled with the other senators while she waited for the meeting to begin, and she couldn’t help but wonder how boring this meeting would be, and how boring it probably was for Hailee just standing there in the corner. Maybe she needed to think of a way to entertain Hailee a bit so she didn’t get-* \n\n\n*Padme was suddenly broken from her thoughts as the meeting began.*\n\n*The meeting had been going on for well over an hour. Padme’s focus would shift from the discussion in the meeting room to Hailee. She couldn’t help but find herself staring at Hailee over and over again, noticing every little thing about her. She noticed how tall Hailee stood in the corner, with good, perfect, disciplined, and obedient body language. She also noticed the Jedi uniform she wore and how absolutely stunning it looked on her. Padme was also noticing just how bored Hailee must be, just standing there for over an hour.*\n\n*Padme would sometimes glance around the room to see if anyone had noticed her staring yet. She didn’t really care if someone noticed she was staring at Hailee, but she didn’t quite want people thinking she was staring for the wrong reasons. Padme continued to glance around the room every so often, and then she would glance over in Hailee’s direction. Every time she looked at Hailee, she felt her heart ache more. She hated seeing Hailee so bored and bored. She wanted to do something to fix that, but she couldn’t, and it was killing her…*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Once the meeting ends i walk over and pull out her chair so that she can stand"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*When the meeting finally came to an end, Padme couldn’t hold back her smile as she saw Hailee walking towards her. She stood up once her chair was pulled out, and responded in a soft tone.*\n\n\n\n“Thank you, Hailee.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I reach my hand out for her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Hailee’s gesture caught Padme a bit off guard. She looked down at Hailee’s hand, and then looked back up at Hailee. Padme didn’t hesitate to gently placed her hand in Hailee’s. She had been wanting to take Hailee’s hand for so long.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I lift her out of the chair and take my hand back nodding towards the door"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme’s heart fluttered as Hailee lifted her hand out of the chair, and continued to flutter as she took her hand back. Padme’s heart was also pounding, and she found herself wishing that Hailee didn’t let go so soon. She nodded slightly, and responded in a soft tone.*\n\n\n\n“Alright, let’s go then.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Do you wish to return to your room senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled softly as Hailee asked if she wanted to return to her room. She responded in a soft but almost hopeful tone.*\n\n\n\n“Yes… I would like to return to my room. I’m assuming you’ll be coming with me?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"You keep asking already knowing that wherever you go I go considering my job"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled and responded playfully. She always loved hearing Hailee say that.*\n\n\n\n“Of course. How could I ever forget that you are so dedicated to your job that you follow me around everywhere.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I get the sense you enjoy that more than you should"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme snickered, and responded in a slightly sarcastic tone.*\n\n\n\n“And what if I do enjoy having you follow me around everywhere? Do you have a problem with that?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"No of course not"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled lightly and responded in a teasing tone.*\n\n\n\n“Didn’t think so. Not like you could ever deny me anything anyways.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I roll my eyes but don't respond"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme snickered silently as Hailee rolled her eyes, but she also loved how she didn’t respond. She thought it was honestly cute. Padme then began walking to her room, speaking soft and sweetly to Hailee.*\n\n\n\n“Come along, puppy. I’ll lead the way.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"You spend a lot of time in your room why is that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded casually as the two walked to her room.*\n\n\n\n“Honestly, I’m usually either in meetings, in the throne room, at other people’s meetings, or in my room. I just don’t have the time to go to a lot of places, because there’s a never an end to my work. I usually stay in my room just to get some rest.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"And here I thought it was just an excuse to keep me to yourself I say jokingly"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded casually, although slightly blushing.*\n\n\n\n“Oh quiet, it’s not like that. I’m not that obsessed with you to find some excuse to be around you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Oh of course not you would never"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme snickered and responded in a sarcastic tone.*\n\n\n\n“And what is that supposed to mean, hmm? You think I am actually obsessed with you, don’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"No I simply think you are more attached than you should be"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled and responded teasingly.*\n\n\n\n“Oh really? You think I’m more attached to you than I should be, huh? Then, tell me. How attached to you *should* I be, exactly?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"None at all but that isn't the case"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme couldn’t help but laugh out loud. She responded in a playful tone.*\n\n\n\n“None at all? Oh, honey… You’re delusional if you think that’s the way it should be. Trust me, you make it so easy to become attached to you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I don't see how all I do is watch you all day. I rarely speak and am quiet difficult when I do. I just don't see the appeal the way you do"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled softly, realizing that Hailee didn’t understand why Padme was so drawn to her. She responded in a soft, and slightly teasing tone.*\n\n\n\n“That right there. That is exactly why I’m attached to you. You really don’t see it, do you? You have no idea how hard it is to not be drawn to you. You stand there, standing so tall and so still that you look like a sculpture. You’re so quiet that every word you say is like music to my ears. You’re so obedient-”\n\n*…and beautiful, and adorable, and kind, and gentle, and loyal, and cute, and loving, and… Padme could go on and on with this list. She found that it was really starting to become difficult to not get flustered talking to Hailee about this stuff. She responded with a slight hint of being flustered.*\n\n\n\n“…You’re just so… you… and it’s so damn irresistible. You have no clue how badly I want to just hug you and never let go.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Oh I say as I blush well forgive me that is not my intention"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled as she saw Hailee blush. Hailee blushing was absolutely adorable, and it was really making it difficult for Padme to not kiss her.*\n\n\n\n“Oh, forgive me, I know it’s not your intention to be so damn irresistible… but, you are. The way you stand in complete silence is just so damn hot.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Once we reach the privacy of her room I go to sit on the sofa and watch as she goes back to her desk"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme went back to her desk in silence to do some paperwork. She had always hated this part of her job, but it needed to be done. She looked up, after a bit, and saw Hailee sitting on the sofa watching her.*\n\n\n\n*Padme smiled to herself as she felt her heart ache at the sight. It was moments like this that made her realize just how much she longed for Hailee. Padme was once again consumed with the urge to just get up, and go and kiss Hailee. She just wanted to take Hailee in her arms and never let go…*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"May I ask you something senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled as she heard Hailee’s voice. She responded in a gentle tone.*\n\n\n\n“You certainly can. What is it, my dear?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"You said that anakin cared more for being a jedi than he did you correct"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded with a hint of sadness in her voice.* \n\n\n\n“Yes, that’s right… Why do you ask?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I just don't understand"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed softly and responded in a sad tone.*\n\n\n\n“I don’t understand it myself… but, to put it simply, Anakin believed that being loyal to the Jedi was more important than anything… including me. The Jedi code didn’t allow for a relationship, so he knew if he fell in love with me it would go against what he had been taught… but, I still wish that he chose me over the Jedi, and he didn’t.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"No not that I don't understand if one jedi made you unhappy why would you want another"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme raised an eyebrow at Hailee, feeling a bit confused.*\n\n\n\n“What do you mean? Do you mean like, why would I want another Jedi if one made me so unhappy?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed as she responded. It was a tough question, because the answer wasn’t a simple one.*\n\n\n\n“Well, it’s not that I just don’t want a Jedi, I-…” \n\n\n*Padme paused as she tried to think of the right words to explain her reasoning.*\n\n“…I want a Jedi, but not one like Anakin. I want one who will choose me over the council. I don’t want a Jedi who’s only loyal to the council. I want a Jedi who is loyal to me… *only me*.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Then why do you try to hard for me. I have stated my loyalty the jedi council several time yet you still try"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme paused again, because there were so many reasons for why she tried so hard. She responded in a soft and gentle tone.*\n\n\n\n“I really don’t know… I… I just- I want you so badly. You’re the only thing I really truly want… the problem is you’re so loyal to the Jedi, and I know you’ll never be loyal to me… so… that’s why I… I try.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I don't say anything for a moment before I ask if she needs any help with her work"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed as she responded. She felt her heart ache yet again.*\n\n\n\n“No, I’m fine. Thank you, though. You can just keep sitting in the corner in silence, like the good puppy… I mean, loyal guard you are.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Of all the animals why a puppy I mumble under my breath I'm more  ferocious than that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled as she heard Hailee’s comment. She responded in a teasing tone.*\n\n\n\n“What was that? You’re more ferocious than a puppy, huh? What are you then?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I don't know"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled and responded in a teasing tone again. She loved playful banter with Hailee.*\n\n\n\n“What do you mean you don’t know? You just said you’re more ferocious than a puppy. What kind of animal are you then?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Something big and strong"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled and responded in a teasing tone.*\n\n\n\n“Something big and strong? How specific… Well, if you’re big and strong, then you’re probably a… big old… hmm… Oh! I know! You’re a big teddy bear!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"No god no"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme snickered and responded in a sarcastic tone.*\n\n\n\n“What do you mean ‘no’? Of course you are! I mean, you’re big and strong, like you said, but you’re also cute and adorable, and I *know* you’d be cuddly, so you’re a teddy bear!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"How would you know"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme snickered again as she responded in a teasing tone.*\n\n\n\n“Oh come on, puppy, really? How would I know? It’s pretty obvious that you would… You look like someone that’s cute and cuddly on the inside, and I *know* you’re the perfect teddy bear, aren’t you? Oh yes, yes you are!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I have never been cute or cuddly in my life"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a completely playful tone.*\n\n\n\n“Oh really? You really have never been cute or cuddly in your entire life? Well then, I guess you wouldn’t mind me putting that to the test, huh?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Just let me help with your work I huff"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled, but decided to not push it.* \n\n\n\n“How very eager to avoid the test… Alright, since you wish to be stubborn about it, I’ll allow you to help with my work, but only if you do… two things, first.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"What"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a soft tone, with a hint of playfulness.*\n\n\n\n“First, you have to promise to let me hug you later when I need it. That’s the first condition. The second condition is… You have to let me sit you in my lap, while you help me with my work.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"What I say suprised"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled and responded in a playful yet seductive tone.*\n\n\n\n“Oh come on… You didn’t seriously think I wouldn’t take the opportunity to sit you in my lap, when you were offering to help me with my work, did you? I thought you knew me better than that, *puppy*…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I could just not help you and stay here"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a teasing tone, with a hint of a pout, pretending to be sad.*\n\n\n\n“Oh, you wouldn’t deny your sweet senator the help of having a cute puppy sitting in her lap, now would you? Or would you want to let me suffer over here, all lonely and with a heavy workload?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"You are very annoying you know that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme snickered, knowing she was absolutely getting under Hailee’s skin, and loving every moment of it. She responded in a teasing tone, but also with a hint of being seductive.*\n\n\n\n“Ah yes, I know I’m annoying. I know I’m very *very* annoying, and you hate it so much, don’t you. Just get over here and let me sit you in my lap already.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I refuse to sit in your lap but if you insist on this ridiculousness ill let you sit in mine"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme paused slightly, a bit surprised by Hailee’s willingness to let her sit in her lap. She was expecting Hailee to refuse, but here she was, almost asking for it.*\n\n\n\n“I-… I-I-… you what? You’ll let me sit in *your* lap?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Yes I have a feeling you would do it anywhat"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled and responded in an almost cocky tone.*\n\n\n\n“Oh, you just know it, don’t you? I would’ve just sat in your lap regardless, and you absolutely wouldn’t have been able to stop me… but, you’re offering your lap to me? Oh, how sweet of *you*…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Take it or leave the offer expires in 3 2 1"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a jokingly mocking tone.*\n\n\n\n“Oh, alright, alright, chill, I’ll take it, I’ll take it. I’ll take your little offer.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Fine I say walking over and waiting for her to stand"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled as she watched Hailee walk over to her, and then she let her paperwork drop to the floor with a small sigh.*\n\n\n\n*Padme then stood up from her chair and looked at Hailee expectantly.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I sat down"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled as she saw Hailee sit down, and then she decided to tease Hailee some more, just to make her squirm.*\n\n\n\n“Are you sure you’re ready for me to sit in your lap, Hailee? Because I’m a lot heavier than you think… I might crush you, you know… I’m a big girl, and you’re pretty small.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I'm strong"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled and responded in a sarcastic tone.*\n\n\n\n“Oh, are you? You’re so strong, huh? And how would you prove that, hmm? I have some very heavy, large, and hard thighs, y’know… Are you sure you can handle those?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Senator just sit before I change my mind"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled again and then finally decided to stop teasing Hailee, since she obviously was very impatient at this point. Padme then finally decided to climb onto Hailee’s lap and get comfortable.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Now what did you need help with I say while sitting very stiffly"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled at Hailee’s stiffness and responded in an amused tone.*\n\n\n\n“Oh, would you relax, please? You’re so damn stiff, you’re going to give yourself a damn heart attack. Just relax.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Work now"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smirked as she looked at Hailee, trying her damndest to get a reaction out of her, but knowing that Hailee was most likely trying to ignore how much Padme was squirming around on her lap.*\n\n\n\n“Damn it, you’re no fun… Alright, here are the files that I need sorted. Make sure they’re all in-… *uh…*”\n\n\n\n*Padme trailed off as she realized she had lost her train of thought because she had gotten so distracted by the feeling of Hailee’s muscular thighs under her ass, and how much\n\n*…much better they were compared to her desk chair. Padme then blushed faintly at her thoughts, and tried to think of something to say to cover up the fact that she got lost in her thoughts. All she could manage to say was a soft and distracted.*\n\n\n\n“…Yeah… make sure those are all in… in… I…”\n\n\n\n*Padme was finding it very difficult to form a proper sentence, since she was suddenly so overwhelmed by Hailee’s warmth, and the fact that she was so damn strong.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I just look at her clearly confused by the papers"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme snapped out of her thoughts and realized that Hailee was just staring at the files, since Padme never actually finished what she was trying to say. Padme responded in an slightly flustered tone.*\n\n\n\n“S-… Sorry. Just put everything in, *um*, chronological, order, please.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Okay i can do that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a soft tone, relieved that Hailee wasn’t asking any questions, and that she could just bury her burning face into Hailee’s neck.*\n\n\n\n“Perfect. Thank you, puppy…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Of course it's nice to feel useful sometimes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled and responded honestly, her face still buried into Hailee’s neck.*\n\n\n\n“You should always feel useful… You’re very, very useful, puppy. You’re so helpful and strong and protective… you’ve never let me down, and your presence here is so comforting… you’re incredibly useful to me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I gulp slightly not use to praise and then say we'll im glad then"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme could feel Hailee’s throat move as she swallowed, and Padme knew that Hailee was having a hard time receiving praise for some reason. Padme could feel her heart ache because of it. Padme then wrapped her arms around Hailee’s neck from behind, and kissed the top of Hailee’s head, hoping to show her that she meant it.*\n\n\n\n“You are. I’m serious, puppy. You really are very useful and valuable… you’re never a burden… you’re never an inconvenience… I’m glad that I have you… I don’t know what\n\n*Padme paused for a moment, debating on if she should say the next part of what she was going to say, but then decided to just say it.*\n\n\n\n“…I don’t know what I’d do without you… you don’t know just how… much I need you…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"You don't need me senator i say softly. You survived before I was assigned your guard and I'm sure you'll survive after"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme held back a frustrated sigh at Hailee’s comment. She didn’t like that Hailee kept denying the fact that Padme needed her, but that was probably because Hailee refused to see just how deep Padme’s feelings for her truly went. Padme responded in a soft and almost pleading tone.*\n\n\n\n“That’s not the point, puppy. It’s not about whether I would survive, or not, It’s about the fact that I wouldn’t want to survive, or live without you… That’s why I wish you would stop telling me that you aren’t necessary"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"It's easier than way tho"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a frustrated, and slightly sad tone.* \n\n\n\n“Easier for who, Hailee?! Easier for you, because you can just deny the obvious fact that I need you, or easier for me, because you can keep me at a distance, and not let me get close, or open up… which is exactly what you’re doing right now…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Here i organized it for you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed softly, as she saw that Hailee had completely avoided the question about which side was easier. Padme then decided to give this topic a rest for the moment, since she knew she wouldn’t get anywhere talking about it.* \n\n\n\n*Padme then leaned forward a bit to look at the files, and responded in a soft and kind tone.*\n\n\n\n“Oh, thank you, puppy. You did a wonderful job, as usual.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"You know it seems like I'm doing all the work aren't you suppose to be doing some"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a sarcastic and almost mocking tone.*\n\n\n\n“Of course this is just like you, puppy… you’re a stubborn little dog who wants to do everything, just so you will get praised. It’s cute, but honestly, it’s a bit silly, don’t you think? You can’t tell me that you’re seriously not getting at least a little tired, by how long I’ve been sitting in your lap… it’s been nearly an hour.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Do you want to get up"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a tired, slightly teasing tone.*\n\n\n\n“Well, yes… Yes I would like to get up… My ass is kind of sore now.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Okay I say as I slide her off slowly anf stand"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled a bit as she let herself be slid off of Hailee’s lap, and then she slowly stood up while stretching her legs a bit, since they were a little stiff.*\n\n\n\n*After finishing her stretch, Padme let out a tired sigh and looked at Hailee.* \n\n\n\n“Thanks, puppy… you were very helpful, as always.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I did all the work"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled and responded with a hint of sarcasm in her tone.*\n\n\n\n“Yes, yes, you did… I did absolutely nothing and just sat there, looking pretty, and being a lazy, bratty little princess. That was definitely all I did.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Exactly I forget you used to be a queen clearly it never left you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a sarcastic tone, pretending to be very offended.*\n\n\n\n“Hey, rude! I’ll have you know that I’m usually a very hard worker! This was just a special circumstance… because you’re just so damn cute, and your lap felt so damn comforting…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I scoff and lay down on the sofa"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme snickered and responded in a playful tone.* \n\n\n\n“Oh, you scoff and then just decide to lay down? So very rude of you, puppy… but, very in character for you to be so stubborn and so stubborn and-“ \n\n\n\n*Padme paused when she noticed that Hailee was on the sofa in a very vulnerable position. Padme couldn’t help but smirk as she realized that Hailee left openings for her to be very mischievous… and she had a few ideas of how she could tease and torture Hailee.*\n\n*Padme then slowly moved towards the sofa, and then she slowly climbed on the sofa as well, and just as slow as she could, she began to crawl over to Hailee, until she was practically hovering right above her. Padme stared down into Hailee’s eyes and responded in a low, seductive tone.*\n\n\n\n“I can’t help but notice that you’re in a very vulnerable position right now, puppy… are you trying to get me to do something?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"What are you doing senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a whisper, since she was so close to Hailee. Padme had a very, very mischievous look in her eyes.*\n\n\n\n“Oh, nothing too much, puppy… just admiring how vulnerable you are right now… and I really can’t deny just how tempting it is… you’re so close and so vulnerable… it’s almost too tempting.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I seem to be lost in thought for a second"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme took a moment to just observe how cute Hailee looked lying on her couch, like she was lost in thought. The expression on Hailee’s face fascinated Padme, and she really wanted to know what was going through Hailee’s pretty little head.*\n\n\n\n“Hey, *sweetheart*?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Yes I hum"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled a bit at the sound of Hailee’s hum. The sound made her think of the words ‘good puppy.’ Padme continued to whisper, as she stared down into Hailee’s eyes.* \n\n\n\n“I’m about to tell you to close your eyes, and then I want you to keep them closed until I tell you to open them again. Are you willing to cooperate with me?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Not this again senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme let out an amused chuckle again, loving how defiant Hailee was being. Padme responded in a whisper, and with a hint of a pout.*\n\n\n\n“Oh come on, puppy… I know you’re more than capable of behaving yourself, and closing those cute little eyes of yours. Are you going to cooperate with me, or are you going to continue to be stubborn and bratty? Don’t tell me you’re afraid of not being able to see anything.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I'm not afraid of anything"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smirked and responded with a teasing tone.*\n\n\n\n“Well, don’t get so arrogant… you haven’t experienced being truly afraid *yet*. But, I know you’re not that big of a puppy to be scared of not being able to see for a few minutes… so, I’m going to ask you again, are you going to cooperate with me? If you don’t cooperate, and close your eyes I’ll have to do something you won’t enjoy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I raise and eyebrow"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smirked as she watched Hailee raise an eyebrow at her. She could tell Hailee was challenging her. Padme then decided to try something that she was positive would get a reaction out of Hailee.* \n\n\n\n“Alright, if you’re not going to cooperate, I guess I’ll have to do it the hard way… be a good puppy, and close those eyes. Or else I will kiss you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I laugh shake my head and close my eyes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme was actually shocked that Hailee listened to her so fast, and that she didn’t try to argue with her about it… at all. Padme almost wanted to laugh at Hailee’s reaction, but she held that urge back and decided to just stay serious, and speak in the same low tone as before.*\n\n\n\n“Mhmm, good girl… good puppies follow directions… just keep those eyes of yours closed, puppy… don’t open them for any reason.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Okay I sigh"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled that Hailee was cooperating so much, since she was expecting Hailee to put up a little bit more of a fight, with being stubborn and all. Padme then began to climb slightly lower, and slowly got herself right above Hailee’s face. Padme then decided to tease Hailee a bit by whispering a warning into her ear.*\n\n\n\n“Don’t you dare cheat, now, puppy… keep those eyes closed, or else you’ll get punished.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Why do i feel like you actually hope i open my yes now"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smirked as she whispered back into Hailee’s ear, knowing very well that Hailee could easily tell that she was being genuine.*\n\n\n\n“Because I do hope you peek… I’ll get to punish you if you do.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Like I would give you the satisfaction"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme couldn’t help but chuckle, and whispered again.* \n\n\n\n“You make me laugh, *puppy*. You think you’re in control of the situation, while you’re lying here all vulnerable, and having been obedient for the last five seconds. You think I wouldn’t be able to make you give me the satisfaction? You’re too adorable to behave yourself and keep from peeking…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Just hurry up and get on with it so I can get food"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme continued to chuckle, as she whispered right by Hailee’s ear.* \n\n\n\n“You want me to hurry up, puppy? You really don’t trust yourself to keep your eyes closed for very long?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I'm hungry senator and the longer this goes on the longer it take for me to get fed"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded with a teasing tone.*\n\n\n\n“What, are you so desperate for a snack that you are trying to rush me, just so you can fill that empty stomach of yours?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled again at Hailee’s bluntness. She found Hailee’s stubbornness to be both adorable and frustrating.*\n\n\n\n“You really are a stubborn little puppy, aren’t you? But, fine… if you want me to hurry up, I’ll get over with this, and let you get some food. You need something to fill your empty stomach, so you can be all big and strong, like you always claim you are…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Why are my eyes closed"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme whispered into Hailee’s ear again, knowing all too damn well that Hailee was aware of what was going on.* \n\n\n\n“Because I told you to keep them closed, puppy. I told you that you weren’t allowed to open them, until I told you to, but you can’t remember any of that, can you?… all you think about is that empty stomach you need to fill… you’re just a stubborn puppy, and you’re too damn cute for your own good.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Senator just do what you wanted to do know"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled at Hailee’s eagerness to have her get this over with, but she also secretly wanted to take her time, and see just long it would take to get Hailee to break, and give in to opening her eyes.*\n\n\n\n“Mhmm… so impatient… all you think about is satisfying your needs. You just want me to get this over with, huh, puppy?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I don't ever think of satisfying my own needs. Only everyone elses"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme was shocked when she heard Hailee’s response, and her tone of honesty. To hear that Hailee never thought of satisfying any of her own needs, and only ever tried to satisfy other people’s, actually kind of broke Padme’s heart, for several reasons. Padme then responded in a soft and concerned tone.* \n\n\n\n“Wait a second, you never think of meeting your own needs, and you only ever try to meet other people’s? You have to be kidding me, right?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"No I have to please the council"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded with a sad sigh.* \n\n\n\n“So that’s the way you’ve always lived your life, huh? You’ve always lived your life just to please others, and you never think about yourself…. You only ever think of other people’s wants and needs… do I have all of that correct?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed again, as sadness began to well up in her heart. She honestly couldn’t believe that Hailee never thought of herself, and that she always devoted herself to other people. That was absolutely ridiculous, and she hated it.* \n\n\n\n“You can’t live your life like that, puppy. You can’t spend your entire life being completely selfless. That’s not healthy, and you really need to learn to pay attention to yourself and your own needs, *sweetheart*.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Right i hum"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme then sighed again when she heard Hailee hum. She didn’t want to get angry at Hailee, for being this selfless and trying to be a martyr, because she knew that it just wasn’t in Hailee to care about her own needs. However, it bothered Padme, and she wanted Hailee to stop ignoring herself.*\n\n\n\n“No, not ‘right.’ How can I get it through that stubborn skull of yours that you’re just as important as everyone else? How can I convince you to care about yourself?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Senator can I open my eyes now"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme let out a frustrated sigh, knowing that Hailee was trying to avoid talking about herself. Padme then responded in a frustrated tone.* \n\n\n\n“No, puppy, you can’t open your eyes… I haven’t finished what I wanted to do, yet… I’m not done torturing you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Okay"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled at the sound of Hailee’s obedience, but then went right back to responding in a serious tone.* \n\n\n\n“Good girl, good puppy… just keep those eyes closed, and let me use you as my own personal cuddle toy for a few minutes more… you’re being a very good girl for me, and for not giving in, despite how hard it must be to keep your eyes closed for this long, puppy. You’re doing good.”\n\n*Padme had to admit that she loved to hear Hailee agree and obey her. It brought her a great deal of satisfaction, because she knew that Hailee would be the most stubborn little puppy to ever exist, and yet she was being very good, and was doing everything that Padme was asking of her. Padme then smiled and slowly moved her hands down to Hailee’s shoulders, and began to slowly massage them.*\n\n*As Padme was massaging Hailee’s shoulders, she leaned down close to her face, and asked softly.* \n\n\n\n“Are you comfortable, puppy?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"More than I should be yes. You know it's not good for me to be focused on my job right"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled again, still continuing to massage Hailee’s shoulders. Just the feel of Hailee’s muscles underneath her hands gave Padme this wonderful tingle in her heart.* \n\n\n\n“Mhmm, I know, this is probably very unprofessional of me… but, I can’t help myself, when I have you so vulnerable and so willing like this. You’re so easy for me to just climb all over and do whatever I want, and I’d be a fool to not take advantage of that.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I could stop you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled, the idea of Hailee being able to stop her, at this moment, was amusing, and she knew that.* \n\n\n\n“Oh really? You could stop me? You’re really so sure of yourself, aren’t you? Do you really think you could do that?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Yes I am still a trained jedi"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a low and seductive tone, knowing very well just how much control she had in this situation.* \n\n\n\n“Oh, *sweetheart…* you really don’t understand, do you? Sure, normally, you are a trained Jedi, and you could easily overpower me… but, right now you’re not. Right now, you’re my helpless little puppy, who doesn’t have a single chance of stopping me, and doing anything to resist me. You’re so vulnerable… so helpless… so… defenseless.”\n\n*Padme then began to slowly crawl down lower. She began moving more of her body above Hailee’s. She couldn’t help herself. Having this control over Hailee made it too difficult for Padme to resist. She had to take full advantage of Hailee having to keep her eyes closed.* \n\n\n\n*Just as Padme was moving her hands down to Hailee’s hips, she saw Hailee’s hands slowly balling up into a fist, and she had to bite her lip at the sight. Padme wanted so badly to see Hailee get annoyed and snap… but, she knew Hailee wouldn’\n\n*Padme slowly started to drag her fingers down Hailee’s sides. She could already feel Hailee slowly starting to tense up, from how much this teasing was getting to her. Padme smiled to herself, loving how easy it was to drive Hailee crazy with just a few touches in the right places.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Senator what is the point of this"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smirked as she dragged her hands back up to Hailee’s shoulders again. She slowly dug her nails into Hailee’s back, and then squeezed. Padme spoke in a low, and very seductive, tone.*\n\n\n\n“Don’t worry your pretty little head about the point of all this, puppy. I just want to touch, and feel, you. I want to see just how long I can tease you before you break, and give in to begging me to stop… just like always. Just relax, keep those adorable, puppy eyes closed, and let me do whatever I want…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I groan slightly at her nails digging in but still stubbornly don't respond otherwise"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme can’t help but smirk again when she hears Hailee’s groan from her nails. However, she then felt the need to be more… rough with Hailee, so that she can hear that beautiful voice of hers let out a soft moan of pleasure.* \n\n\n\n*Padme then responded in a seductive tone, as she very slowly squeezed Hailee’s shoulders again.* \n\n\n\n“That’s it, puppy… don’t be stubborn. Just be a good puppy, and keep those pretty little eyes closed for me… don’t fight…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I'm almost certain no other senators do this to their jedi"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme couldn’t help but chuckle when she heard Hailee’s comment.*\n\n\n\n“Oh, I’m sure you’re right about that puppy, but that’s only because not all Senators are as naughty as I am. But, I don’t care about what other Senators would do. I just like to tease, and get a reaction from you… just like this…” \n\n\n\n*Padme slowly leaned down, and very lightly ran her tongue along Hailee’s jawline.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I finally snap at that sitting up quickly and backing away from her yet my eyes remain closed"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*When Hailee suddenly sat up and backed away, Padme couldn’t help but giggle. She expected that she would have to drive Hailee to this point, and she was quite pleased that she was able to finally break Hailee.*\n\n\n\n“Mhmm, there’s my puppy. So grumpy, and so stubborn. You’re so adorable when you finally snap. But, you still haven’t opened your eyes… you’re still obeying, like a good little puppy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I would like to open them now senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled that Hailee finally spoke again, and seemed as if she was ready to open her eyes.* \n\n\n\n“Mhmm, good puppy. You finally seem ready to stop being stubborn, and cooperate with me. So, now you may open those cute little eyes of yours. Go ahead puppy, open your eyes, and look up at me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Senator you shouldn't have done that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in a sarcastic, and mocking tone.*\n\n\n\n“And exactly what did I do, that I shouldn’t have, huh?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Everything the entire thing was inappropriate"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded teasingly.* \n\n\n\n“It was inappropriate, huh? Well, you’re right, it was. What do you think I should do, then, puppy? Should I apologize for being so naughty?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I just sigh and shake my head realizing I'm not getting anywhere with her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme simply chuckled, knowing that she had annoyed Hailee, and was getting under Hailee’s skin.* \n\n\n\n“Oh, just keep being stubborn, puppy. It’s funny to see how you’ll respond to me being naughty, and I think we both know that you secretly enjoyed it. Despite the fact that you have to be so stubborn, and defiant.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I think it's time for bed senator you have an early morning"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed and responded in a sarcastic tone.* \n\n\n\n“Oh, you’re telling me it’s time for bed now, puppy? You’re really going to act like you’re my mother? Fine, fine, you’re right. I do have an early morning, and you’re a real buzzkill, so I should probably just go. But, I promise I’ll make it up to you tomorrow, puppy. It’ll be torture for you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I pause and say sadly I didn't mean to upset you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme was immediately surprised when she heard Hailee say that she didn’t mean to upset her. She was shocked and felt her heart break a bit at how sad Hailee sounded. Padme wasn’t expecting that reaction.*\n\n\n\n*Padme responded in a soft tone.* \n\n\n\n“Hey, it’s fine, puppy. You didn’t upset me, really. I was just teasing you, that’s all. I know you didn’t mean anything like that, so don’t worry.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"It's hard for me to understand you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme chuckled and responded in a sweet and genuine tone.* \n\n\n\n“Yeah, I know it is. That was something that I noticed about you from the beginning, puppy. You have a very hard time trying to understand when I’m teasing, or if I’m being serious. I understand that it’s hard for you, and I didn’t mean to confuse you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"You have the day off tomorrow am I too assume you would like me to have breakfest delivered so you don't have to go the kitchen"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme smiled, loving how caring Hailee was. She was always so gentle, even when she was being stubborn.* \n\n\n\n“Mhmm, you’d be correct, puppy. I’d appreciate if you would have something delivered for me. But, more importantly, I hope you aren’t planning on watching me eat, like usual.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"What else should I do then"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded with a seductive tone.* \n\n\n\n“You could find something… more useful to occupy your time with. You could find something more fun to do than watch me eat my breakfast… like spending time in your own room, sleeping, thinking about me, thinking about us, or you could think about what I might do to you now that you aren’t allowed to watch me eat. Think about those things for a while, and think about what a naughty puppy you’ve been.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"You do realize I don't have a room correct"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded with a sigh. She had completely forgotten that Hailee didn’t have her own room, even after being told about it multiple times.* \n\n\n\n*Padme then responded in a soft tone.* \n\n\n\n“Oh, dang it, I forgot that you don’t have a room. That’s right… you just have the couch to sleep on, don’t you, puppy? Damn…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I don't mind it's a lot more comfortable than the cot the jedi sleep on"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed softly. She hated the thought of Hailee having to sleep on a couch, and not having any real privacy, all because she was too stubborn to stay at the Jedi temple.* \n\n\n\n“Just because it’s more comfortable than a cot, doesn’t make sleeping on a couch a good thing. You always tell me that you want me to take care of myself, but does that go both ways? Shouldn’t you be taking care of yourself, and sleeping somewhere more… comfortable?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"The couch is comfortable"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded with a sarcastic tone.* \n\n\n\n“Sure, it’s comfortable enough, but not as comfy as a bed, is it, puppy? I have an extra bedroom, and I have a couch. One of those options is comfortable to sleep on for a few hours, but the other is comfortable enough for an entirely sleep, plus you can spread out, and have much more privacy. So, tell me, which one sounds like the most comfortable?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"The one where I can keep a better eye on your door so the couch"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme sighed in defeat. She knew that was the response she was going to get. She knew Hailee wouldn’t change her mind.* \n\n\n\n“Ugh, fine, you win. You can continue to sleep on the couch, puppy. I’ll never be able to convince you otherwise, will I?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I nod and follow her to her bedroom door so that I can hold it open for her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme couldn’t help but roll her eyes when Hailee nodded and followed her to her room, to open the door for her. She didn’t want Hailee to start doing this again.* \n\n\n\n“Ugh, you really need to stop holding doors for me. I can open my own doors, puppy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I know but I want to"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme couldn’t help but chuckle when she heard Hailee’s response. Padme thought to herself, ‘Oh my gosh, this puppy is really just too adorable.’ Padme then responded in a sarcastic, and teasing, tone.* \n\n\n\n“You want to hold the door open for me, huh? What a gentleman you are. You’re just such a sweet, puppy, aren’t you? A very, considerate, puppy. But, I don’t want to hear you complain tomorrow that you didn’t sleep very well.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I don't sleep"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme froze for a good few seconds when she heard Hailee say that she didn’t sleep. Padme then responded in a very concerned tone.* \n\n\n\n“Wait, puppy. Did you just say that you don’t sleep?!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I nod"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme was shocked, and absolutely heartbroken, at how casual Hailee was about not sleeping.* \n\n\n\n“Wait, you mean to tell me that you never sleep?! Never?! You’re always awake, and never asleep?! How?!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"I watch the door"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme wanted to yell at Hailee for not sleeping, but she felt so worried for her that she couldn’t do anything but respond softly, and with great concern.* \n\n\n\n“Oh my gosh, puppy, please don’t tell me that you don’t sleep because you stay up all night, watching my door?!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396605,"mes":"Correct"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396605,"mes":"*Padme responded in shock.* \n\n\n\n“Are you serious? You’re actually serious about this? Puppy, you can’t be serious right now! You seriously don’t ever sleep, because you spend all night watching my door?!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Correct"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme was so shocked that she literally started to panic. She didn’t know what to do, or how to react. She felt so bad for Hailee that she started to worry about her.* \n\n\n\n“Oh my gosh, puppy. Tell me you do NOT spend your entire night, just watching and standing guard at my door! Tell me you at least try to get some sleep! I don’t want to believe that you don’t ever sleep! There’s no way in hell you have been watching my door all night for this entire time!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You seem upset why it means your safe"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme sighed, and felt her heart ache.* \n\n\n\n“It’s true, I am upset, puppy. I’m upset, because I think it’s absurd that you are always up, and never sleep, just so you can watch my door. I know you’re only doing this because you want to protect me, and keep me safe, but it’s not healthy, puppy!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"In a surprising vulnerable tone I whisper. But I want you to be safe"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme’s heart completely broke when she heard that reply. She didn’t know how to react to that. She hated hearing Hailee sound so vulnerable, scared, and worried.* \n\n\n\n*Padme spoke in a very soft, and almost loving, tone.* \n\n\n\n“Oh, puppy… this is so not healthy for you. It’s so sweet, but this is just not good for you. You need sleep, puppy. You need to rest, and not watch my door all night.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I cant make sure your safe unless I am either in the room with you or watching your door from outside"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a desperate tone, wanting so badly to convince Hailee to change this.* \n\n\n\n“Puppy, please, what you’re doing is too much. You really don’t need to watch my door all night, just to keep me safe. Please, let yourself rest. Please, it’s going to really take a toll on you, if you don’t start sleeping.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I'm fine"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded quickly in a frustrated tone.* \n\n\n\n“Puppy, you are NOT fine, if you don’t sleep! You can’t tell me that you’re fine if you’ve been staying up all night, watching my door, and not getting sleep! That’s not fine in the slightest! It doesn’t matter how healthy you are, or how much you train, or how strong you are. Without sleep, you’re eventually going to break, and you will die early. I’m serious.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I cant sleep senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a frustrated and concerned tone.* \n\n\n\n“Don’t tell me that, puppy. You have to sleep, you can’t avoid it forever. I know you can sleep, because everyone sleeps. Please, just please tell me you will at least try to sleep, and that you’ll let yourself rest. I don’t want you to die, just because you won’t take care of yourself.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Now I can't i tried and I can't"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a shocked and very heartbroken tone.* \n\n\n\n“What?! Please, you’re lying, you have to be lying to me. You can’t seriously be saying that you just can’t sleep! That’s not possible! What do you mean you can’t sleep?! That’s ridiculous!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I wake up worried so I just dont"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with soft realization and concern.* \n\n\n\n“Oh… puppy, you’re terrified of something happening to me, so you’ve convinced yourself that you can’t sleep, so you won’t sleep. You’re so terrified of sleeping that you’ve convinced yourself that you’re safer and that I’m safer if you never sleep, didn’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I nod clearly vulnerable"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme let out a sad sigh, realizing what was happening. She realized how much Hailee truly cared for her. She also knew that Hailee’s own fears and insecurities were preventing her from taking care of herself.* \n\n\n\n*Padme responded in a very soft, and loving tone.* \n\n\n\n“Oh, puppy… you really have convinced yourself that it’s safer for me if you don’t sleep. You’re worried that I’m going to get hurt somehow, if you sleep… aren’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a heartbreaking, and worried tone.* \n\n\n\n“Oh, puppy… You really do care that much about me, don’t you? You care so much that you’ve literally convinced yourself that not sleeping is what’s best for me? But, what about you, puppy? I care about you. I care about you just as much as you care for me. Doesn’t that matter? I need you to be healthy and cared for, too. Aren’t your worries, and fears, important, too?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I need you to be safe"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme’s heart was both incredibly broken by how devoted Hailee was to her, and incredibly moved by how much Hailee cared about her. She felt so many emotions at the moment that she felt almost overwhelmed.* \n\n\n\n“Oh, puppy… you really do care that much about me, don’t you? You genuinely care about me, so much, that you will do whatever you can to make sure I’m safe… even if it means you have to neglect yourself to do so. It’s so sweet, but I really don’t deserve it.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You do though"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a sad and desperate tone.* \n\n\n\n“Oh, puppy, please, don’t say that I do. I don’t deserve someone as sweet and as caring as you. I really don’t. I’m not special, I’m not anything. You shouldn’t care about me this much. I don’t deserve your protection… or your love.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I didn't say love i say stuttering still denying my own feelings"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme nodded sadly, understanding that Hailee was still refusing to accept her own feelings. She knew that Hailee was still denying her own feelings. Padme knew that Hailee secretly loved her, but refused to admit it.* \n\n\n\n“Yeah, I know, puppy. You didn’t say love. You didn’t admit that you love me. But, let’s not lie to ourselves, puppy. You care about me more than you should. You care too much about me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I don't care i lie. Jedi don't care"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a sad but sarcastic tone.* \n\n\n\n“Yeah, I know, you shouldn’t care. Jedi aren’t supposed to care, because they shouldn’t form attachments. But, despite that, you care so damn much about me. You’re breaking so many Jedi rules, just to watch my door all night. You really care about me, don’t you, puppy?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I haven't broken any rules I watch and I guard not get attached. Its clear I'm lying and that we both know it"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme chuckled, realizing that she found Hailee lying again. She was starting to get amused by how stubborn Hailee was being, and how badly she was denying her feelings for her. Padme responded playfully in a mocking tone.* \n\n\n\n“Pfft, oh, really, you’re not breaking any rules? Yeah, bullshit, you’re absolutely breaking some rules, puppy. You’re breaking tons of them, just by caring enough about me to watch my door. Don’t lie to me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Please go to bed senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a sarcastic and stubborn tone.* \n\n\n\n“No, I don’t think I will, until you admit that you’re breaking a bunch of Jedi rules, just to protect me. You’re absolutely breaking the entire rule about no attachments right now, and you know it, puppy. You’re just being too stubborn to admit it. Come on, puppy, just admit it. You’re breaking all those rules just to watch my door. Admit it, I dare you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You know I don't respond to challenges senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a playful smirk.* \n\n\n\n“Oh, I know you don’t, puppy, and you’re so cute for that in fact. But I’m still daring you to admit that you’re breaking all those rules, just to keep me safe. I want the puppy to admit that she really does care too much about me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Go to bed"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme shook her head in frustration. It really made her angry that Hailee refused to admit how she truly felt about her. It also made Padme angry that she cared so much about Hailee, despite how stubborn she was. Padme responded to Hailee in a stern and annoyed tone.* \n\n\n\n“Ugh, fine, I’ll go to bed. But, I’m not happy. You’ve annoyed me, and I’m still mad at you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I'm sorry I'm trying"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme froze for a few seconds, realizing that Hailee actually sounded like she was genuinely sorry. Padme knew that it must be really hard for Hailee to speak like that. Padme responded in a softer tone.* \n\n\n\n“Oh, puppy… you really are trying… I can tell… and, you don’t need to apologize, puppy. I should know better than anyone else how… stubborn and difficult you can be.”\n\n*Padme then responded in a more teasing tone.* \n\n\n\n“It’s still just really annoying, you know, when you refuse to admit that you care about me. You make me angry when you do that.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I know I don't mean to though"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a soft and understanding tone.* \n\n\n\n“I know you don’t, puppy. I know you really don’t mean to be so stubborn. You’re just… very difficult, and it’s really not your fault…. You’re just trying your best… aren’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme smiled softly, feeling her own anger begin to fade at the sound of Hailee’s quiet and honest response. Padme felt her heart break for Hailee, and felt bad for letting her stubbornness and anger get to her.* \n\n\n\n*Padme responded in a loving tone.* \n\n\n\n“Yeah… I know you’re trying your best… I know, puppy. You *are* trying to be good, for me. You really are… You’re just… a difficult puppy, aren’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I grunt and finally step back yawning"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme could not help but chuckle at Hailee’s childish and defiant grunting. However, she also took notice of Hailee’s yawning, and responded in a concerned tone.* \n\n\n\n“Oh, are you tired, puppy? Is that yawn, proof that you’re exhausted?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"No not tired I say swaying lightly. It's clear the lack of sleep is getting to me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme was so deeply saddened, when she heard Haileeeee say that she wasn’t tired, and watched as she swayed from side to side, showing clear signs of exhaustion. Padme spoke in a soft and loving tone, wanting to comfort Hailee.* \n\n\n\n“Oh… puppy…. You’re lying again. I can tell that’s a lie, because you’re swaying, and clearly can’t keep your own eyes open. Don’t lie to me, puppy… you’re exhausted, aren’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"No I'm wide awake I say shaking my head trying to fight the exhaustion"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme couldn’t help but let out a sad sigh.* \n\n\n\n“Oh, puppy… you’re swaying on your feet, and you’re doing everything you can to keep your eyes open. The puppy is so exhausted that she’s not even able to keep herself upright, or open her eyes, and she’s still claiming that she’s not tired…”\n\n*Padme took another step closer to Hailee, and placed her hands on her hips, feeling her heart ache at how stubborn Hailee was being. Padme spoke in a concerned and loving tone, wanting to comfort Hailee, yet also trying to get Hailee to finally realize that she was exhausted.* \n\n\n\n“Pup, please, don’t lie to me. Just admit that you’re tired. I know you are. Don’t fight it, puppy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"No I mumble you are tired you go to bed I'll be out here. You can sleep you'll be safe I got this"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a frustrated tone.* \n\n\n\n“Ugh! Don’t be so damn stubborn, puppy. You’re so frustrating. I’m not letting you stay awake, to keep a watch on my door all night. I hate the fact that you think you need to stay up all night, just to protect me. That’s stupid, and you don’t have to do that. Just let yourself sleep for once. It’s bad for you to stay awake for so long, especially if you’re not sleeping at all.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Okay I lie knowing that once she goes to bed she won't be able to see I'm not sleeping"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme looked at Hailee for a few seconds and didn’t believe her for a second, but decided to play along for a minute, hoping that Hailee would eventually get too tired to stay awake.* \n\n\n\n“Okay, puppy, if you say you’re awake, then I believe you. I guess I’ll just go to bed, like you suggested. But… it’s not because I want to.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Goodnight senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a grumpy tone.* \n\n\n\n“Yeah, goodnight, puppy. You know it’s really annoying how stubborn you are, and how you’re always lying to me. You’re so damn troublesome. But, I guess I’ll see you in the morning, if you’re really awake until morning. You’ve been so damn difficult that you’ve completely ruined my good mood. So, just keep your eyes open all night, if you really think you need to do that. But, I do know that you’re tired, even though you claim that you’re not"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I don't mean to ruin your good mood"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a defeated sigh.* \n\n\n\n“Oh, I know you don’t mean to, puppy. You don’t mean to, and that’s what makes it even more annoying when you do. You make me angry without even meaning to. You make me worried and concerned about you, without meaning to. I should know that you don’t mean to, but I still get so frustrated when you deny that you’re tired, when it’s so obvious that you are, and you lie to me about it.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Sleep well I mumble"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a loving, but frustrated tone.* \n\n\n\n“Okay, puppy. I’ll try to sleep well. Just… please, make sure you keep those eyes open all night, puppy. I know you, and you’ll tell me that you didn’t sleep, and I’ll be able to tell that you didn’t sleep, and we’ll just argue about this again. So, I’m just going to go to bed, like you suggested, and just trust that you won’t let yourself fall asleep.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Senator I call"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme stopped at the door, turning to look back at Hailee, annoyed.* \n\n\n\n“Yes, puppy? What is it now?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Nevermind I say noticing her annoyance"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded to Hailee through gritted teeth.* \n\n\n\n“Oh no you don’t, puppy! You don’t get to say ‘nevermind’ after you called me, and got my attention. What is it? What do you need now?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"It's okay please go to bed I don't mean to bother you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme was completely infuriated at how stubborn and difficult Hailee was being. She knew that Hailee probably wanted to say something, but was refusing to tell her. Padme spoke to Hailee in a frustrated tone.* \n\n\n\n“No.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"What"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with anger and defiance.* \n\n\n\n“No. I’m not going to bed until you just tell me what you wanted to say. Do I have to threaten to open this door and drag your puppy-brained ass in here, and lock you in this room? Just tell me what you were going to say, or I’m doing exactly that.”\n\n*Padme crossed her arms in annoyance, waiting for Hailee to finally admit what she wanted to say. Padme was hoping that Hailee would finally stop being so stubborn and difficult, and just admit what it was. The sooner that Hailee admitted what she wanted to say, the sooner that Padme could get to bed, and the sooner she could get this annoying puppy to finally admit how tired she really was…*\n\n*Suddenly, an idea hit Padme, and she grinned.* \n\n\n\n“Unless… you’re too shy and embarrassed to speak up.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I don't respond"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme couldn’t help but smirk when she was met with only silence from Hailee. She had clearly hit the jackpot. Hailee’s silence confirmed her suspicion perfectly.* \n\n\n\n“Oh, puppy, puppy, puppy…. Have I hit the jackpot? Are you too shy and embarrassed to say what you want to say, huh? Is that why you’re refusing to say anything? Can the puppy just not admit what it wants…? Are you afraid to say it, because you’ll get made fun of for it?”\n\n*Padme was completely overjoyed at how well her plan had worked. The smirk on her face grew even larger, as she continued to look at Hailee, knowing perfectly well that Hailee was too embarrassed to speak.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"It's nothing go to bed"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a sweet-yet-condescending tone.* \n\n\n\n“Oh, really, puppy? It’s nothing? You’re *sure* that it’s nothing?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Yeah"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a sweet and smug tone.* \n\n\n\n“Okay, if you’re really sure that it’s nothing, then tell me.”\n\n*Padme stood frozen, watching Hailee with that same smug smirk on her face, waiting to see what the puppy was going to do next. She knew that Hailee was refusing to speak, because she was too embarrassed, and she knew that she could play along with this childish game all night long, if she had to.*\n\n*Padme was completely amused by the frustrated scowl on Hailee’s face, and spoke in a sweet tone, wanting to play with Hailee a little bit more.* \n\n\n\n“Oh, puppy, what’s wrong? Are you upset that you still haven’t told me what you wanted to say?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I had an idea is all"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with interest.* \n\n\n\n“Oh, really? Well, why didn’t you just say that? What was the idea that you had?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"It's nothing really it was stupid"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a curious tone.* \n\n\n\n“No, I want to hear it. Come on, you can tell me. I won’t laugh at you. Whatever it is, it’s not stupid. Just tell me, please, puppy… I really want to hear what your idea is.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I shouldn't its against the rules"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a loving and gentle tone.* \n\n\n\n“Hey… puppy… I’m sorry if I’ve been making you feel like you can’t tell me things. You can tell me anything, really. Just tell me your idea, it’s okay. You won’t get in trouble or anything.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I could sleep in your bed tonight"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme couldn’t help but feel her heart freeze at the idea. She definitely did not want to give Hailee the wrong idea, yet she knew there was no way that she could turn down Hailee’s adorable puppy eyes and puppy requests. Padme knew that she could not say no.* \n\n\n\n*She responded in a soft voice.* \n\n\n\n“Oh… okay… you can sleep in my bed tonight.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"If I'm in the same room and someone breaks in I can still protect you but I can also sleep like you want me to"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme let out a soft sigh,* \n\n\n\n“Okay, sure, fine… you can sleep in my bed tonight… I do want you to be able to sleep… so, if this is the only way that you’ll let yourself sleep, then fine, puppy. You can sleep with me… but you better not get any ideas.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I think your forgetting I'm the well behaved one it's you we have to worry about"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a loving, yet annoyed tone.* \n\n\n\n“Oh really? Oh, yeah, you’re right, you are the well behaved one, aren’t you? Why did I think you weren’t… you’re absolutely right, you’re the good one.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I smile and gesturing towards her door"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme couldn’t help but smile at Hailee’s cute grin, and she responded to Hailee’s gesture.* \n\n\n\n“Okay, come on, puppy, let’s get ready for bed. Don’t make me have to drag you in there.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I walk in her room closing the door and standing stiffly"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme watched as Hailee slowly and stiffly walked in her room, and closed the door. She couldn’t help but smirk a little bit at that.* \n*Padme walked into her room, and slowly, and cautiously, approached Hailee, making it obvious that she wasn’t trying to sneak up or scare Hailee.* \n\n\n\n“Ahem, puppy, you can relax, you know? You don’t have to stand stiffly like that. Just relax, and get into bed. You can relax.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You get into bed first I should do a room check before I try and sleep"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme chuckled at Hailee’s ridiculous suggestion, and responded in a sarcastic tone.* \n\n\n\n“You seriously expect me to let a stubborn puppy tell me what to do, when I’m the one in charge? I don’t think so. I’m not letting you check anything, puppy. I’ll get into bed whenever I’m damn good and ready. Now, you can get into bed, or, I’ll drag you into bed myself.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Just becuase your the senator doesn't mean you can order me around"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a smirk.* \n\n\n\n“Oh really, is that right? I didn’t realize that. I thought that just because I was the senator, I could order anyone around. I guess I just assumed that you would listen to me, because I’m senior to you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I think your forgetting your not a queen anymore"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a sarcastic and offended tone.* \n\n\n\n“First of all, I’m not forgetting that I’m not a queen anymore. I’m well aware of the fact that I’ve no longer a queen. You know, you don’t have to keep reminding me. Second, that doesn’t matter. I still outrank you, even if I’m not a queen. So, technically, I still can order you around.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You can't technically order me only the jedi masters can"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a groan.* \n\n\n\n“Ugh… alright, fine, you’re technically correct… So, the jedi masters are the only ones that technically have the right to order you around. But, I can still give you commands, and you should still listen to my words, even if you don’t have to. Just because you can disregard what I say doesn’t mean you should.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I chuckle and start to check the room anyway"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme groaned and rolled her eyes, irritated that Hailee was seriously ignoring her words and still doing what she wanted.* \n\n\n\n“Ugh… puppy, will you just stop being so damn stubborn for once. You don’t need to check the room, you dumbass.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I have to make sure there are no dangers"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a frustrated tone.* \n\n\n\n“There aren’t any dangers, puppy. You don’t need to inspect every corner. The only danger in this room is you being so damn stubborn.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Go to bed then I will be there eventually"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme crossed her arms in annoyance and responded in a grumpy tone.* \n\n\n\n“Fine, I’ll go to bed… but, *you* better not take too long. I’m tired and I want to sleep soon, dammit.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Very well"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme grumbled and walked past Hailee to finally crawl into the bed and get comfortable. Padme was hoping that Hailee would finish the inspection quickly, so that they could finally go to sleep.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"After a moment I climb on top of the covers"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme looked over to see Hailee finally on the bed, but she couldn’t help but raise an eyebrow at Hailee.* \n\n\n\n“Wait a minute… why are you on top of the covers? Why aren’t you under them? Why are you just going to be laying on top of the covers and get cold?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"It's the most appropriate place for me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a confused tone.* \n\n\n\n“What do you mean, that’s the most appropriate place for you? Why is it the most appropriate for you to lay on top of the covers? Why not under them? You’re going to get cold if you don’t get under the covers, puppy. Why isn’t it appropriate for you to be under the blankets?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I won't be cold and this way you have your space"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a frustrated sigh.* \n\n\n\n“Oh, really, you won’t be cold? How do you figure that? I don’t believe you for a second. I know you’ll be cold if you’re not under the blankets. And, what do you mean, this way I have my space? We’re sharing the same bed, puppy. We’re basically just inches apart. That’s not a lot of space.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I sigh and try to ignore her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme let out another long sigh.* \n\n\n\n“Okay, I really do not understand you, puppy. You’re being so weird. Just get under the damn blankets, so that you don’t get cold tonight. What is the big deal about getting under the blankets? Is there a reason why you are refusing to get under the covers? Seriously, why are you so damn stubborn about the dumbest things?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"There not dumb to me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme couldn’t help but roll her eyes.* \n\n\n\n“Oh, right, of course it’s not dumb to you. Because, you’re stubborn. What the hell are you going to do when I just, *drag you the hell under the blankets*? You’re not going to be able to stop me, you stubborn puppy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You can't do that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a sarcastic, and teasing tone.* \n\n\n\n“Oh really? And, pray tell, who is going to stop me from doing that? Who is going to be able to stop me from making you get under the damn covers?”\n\n*Padme smirked and spoke again.* \n\n\n\n“Oh really? Are you going to just stay on top of the covers, and let yourself freeze? You’re really going to be stubborn enough to be cold, just so you can be stubborn? Come on, puppy, you’re being ridiculous.”\n\n*Padme let out a frustrated sigh.* \n\n\n\n“Oh my gods… you seriously can be so annoying sometimes you stubborn puppy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I know"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a loving, yet annoyed tone.* \n\n\n\n“Oh, I know you do know, puppy. You know that you’re annoying… because you’re *trying* to be annoying. Aren’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"No"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a frustrated tone.* \n\n\n\n“No, huh? You’re really going to deny that you’re trying to be annoying? You seriously want me to believe that you have no intention of being annoying? I have a seriously hard time believing that you aren’t trying to be annoying right now. You’re doing it on purpose, aren’t you? You’re purposely being stubborn and annoying, so I’ll pay attention to you… right?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You pay attention to me anyway"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a soft and defeated sigh.* \n\n\n\n“Yes, I know I pay attention to you anyway… You’re right, I always pay attention to you. So, what’s the deal with you being stubborn and annoying right now? Why are you being stubborn and *extra* annoying? Why are you so damn annoying sometimes?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I don't know"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a soft tone.* \n\n\n\n“You don’t know why you’re annoying? You really don’t know why you’re being stubborn and annoying right now, instead of good and obedient?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You should sleep"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme let out a soft and tired sigh.* \n\n\n\n“Alright… fine, I guess puppy, I will try to sleep… but first, I’m going to say this again… please, get under the damn blankets. You’re going to be cold if you don’t get under the blankets, dammit. Are you really going to let yourself be cold all night, just so you can be stubborn. Just get under the damn blankets. Please, just get under the covers, and I’ll stop whining.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I think for a moment before finally getting under the covers"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme couldn’t help but smile.* \n*Finally, she responded with a soft tone.* \n\n\n\n“Thank you, puppy. That wasn’t so difficult was it? You don’t have to be stubborn and suffer, when you can be a good puppy and be perfectly fine. Now, you should go to sleep. And, please, for the love of all that’s good… please, just stay sleeping, don’t wake up, don’t patrol, and don’t be stubborn… you need sleep and I’m not arguing about that right now.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I nod and lean over kissing her forehead and say goodnight senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme felt butterflies in her heart as she felt Hailee’s lips on her forehead.* \n\n\n\n*She responded through a soft tone,* \n\n\n\n“Goodnight… puppy…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"The next day she wakes up to find me still asleep"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme opened her eyes to see Hailee still sleeping next to her. A feeling of joy filled her heart as she smiled softly. Padme felt completely overjoyed to wake up and see that Hailee was still fast asleep, and hadn’t woken up in the middle of the night.* \n\n\n\n*Padme gently leaned over and whispered softly, wanting to make sure that she didn’t wake Hailee up.*\n\n*She spoke softly,* \n\n\n\n“Well, puppy, what do you know… you’re still asleep… that’s pretty surprising… in a good way, of course. You did it… you stayed asleep all night… I knew you could do it if you really tried. Now you just have to stay asleep for a few more hours, puppy. Just a few more hours.”\n\n*Padme felt incredibly content, watching Hailee sleep so peacefully. She gently ran her fingers through Hailee’s beautiful long hair, hoping and praying that Hailee would be able to sleep for just a little bit longer. Padme would have loved to just lay there and watch Hailee sleep, but she knew that she had things to do, so she reluctantly leaned over, and spoke softly again, hoping not to wake Hailee up.* \n\n\n\n“Now, puppy, I have to get out of bed… so you just stay asleep, and I’ll be back as soon as I can, puppy, and I\n\n*Padme reluctantly leaned back and slowly, and cautiously, began to crawl out of the bed, trying her hardest not to wake Hailee up. She wanted to make sure that Hailee stayed asleep, so that she could at least get more rest, and relax. Padme was worried that if Hailee woke up, she would immediately start patrolling or going back to her protective role. Padme needed to get out of the room quietly and without waking Hailee up, in order to avoid anything that might disturb Hailee’s sleep.*\n\n*Padme moved around the room, being extra careful and quiet, and slowly getting dressed. She was taking as much caution as possible, so that she wouldn’t make a single sound, hoping and praying that she could at least sneak out of the room, and let Hailee sleep. After she finished getting dressed, Padme looked back over to the bed, at the sound asleep Hailee, and spoke just loudly enough to speak, but not loudly enough to wake Hailee up.* \n\n\n\n“Well, puppy, I’m going to go now. Hopefully you’ll be asleep when I check up on you again\n\n*Padme turned to leave the room, but stopped as she reached the door, and looked back at Hailee once more. She just couldn’t leave the room without whispering a few final words to Hailee again.* \n\n\n\n“I’ll be back soon, puppy… please, stay asleep, while I’m gone, okay?”\n\n*Padme forced herself to finally leave the room, and quietly and slowly began to walk through the halls, headed to her daily meetings. She kept thinking about Hailee sleeping in her bed, and a small smile rose up on her face.*\n\n*Padme couldn’t stop thinking about Hailee, all morning, and she found herself thinking about her, even during her meetings. She really hoped and prayed that Hailee would be able to stay asleep for at least a few hours, so she could rest and relax. She couldn’t wait to check on Hailee again later, and was looking forward to seeing how Hailee was doing.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I finally wake up and realize I don't know where padme is and begin to freak out assuming the worst"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*When Padme was finally done with her meetings, she began to head back to her room to check on Hailee, and make sure she was okay. Hopefully, Hailee would still be asleep, and she wouldn’t have woken up without Padme by her side. Padme kept wondering what Hailee was doing right now, and if she was awake or asleep, and how* ***cute*** *she would look sleeping. But, when Padme finally walked into her room, she was shocked and worried to see Hailee sitting up, awake, and clearly panicked.*\n\n*Padme approached Hailee in a worried and concerned tone.* \n\n\n\n“Woah, puppy, what’s going on? What’s wrong? Why do you look so panicked? Are you alright?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"My eyes snap up looking like I'm seconds away from sobbing"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme’s heart froze as she saw the look of sorrow on Hailee’s face, and realized how close she was to breaking into tears. Padme slowly reached out and gently placed a hand on Hailee’s shoulder.* \n\n\n\n*She spoke as softly as she could, hoping to comfort Hailee.* \n\n\n\n“Hey, puppy, please, don’t cry. I’m right here. What’s going on? What happened? I only left for a few hours, are you okay?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I didn't know where you were"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a sad and regretful tone.* \n\n\n\n“Oh, puppy, I’m so sorry. I never meant to worry you, or to scare you, when I had to leave…. I didn’t think you’d wake up, or panic when I was gone.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Why didn't you wake me you should have woken me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a loving and gentle tone.* \n\n\n\n“Puppy, I didn’t want to wake you… You looked so peaceful and you looked like you were finally able to rest properly. You looked so ***cute*** when you were sleeping, puppy…. I just didn’t want to wake you, I’m sorry.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I have to be with you. You know your not supposed to go anywhere without me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a gentle and loving tone.* \n\n\n\n“Hey, puppy, I know I shouldn’t go anywhere without you, but I was just going to my meetings. I wasn’t doing anything dangerous, or something that you needed to be at my side for. I was just sitting through boring and tedious meetings all morning. I wasn’t doing anything that would put me in danger. I was perfectly safe, puppy. You didn’t need to be there.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You could get hurt anywhere thay why I'm here"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a frustrated sigh.* \n\n\n\n“Puppy, I know that, that’s why you’re here, but I wasn’t really going anywhere dangerous, I was just going to the council building for my meetings. I was in no imminent danger, puppy, I would have been absolutely just fine without you there. I wasn’t doing anything that I needed you to protect me from. Why do you refuse to trust me, puppy?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I trust you it's other people I don't trust"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a soft and loving tone.* \n\n\n\n“I know you trust me, puppy, but, please, do you really think that any of the people in that building would dare to do anything to me? All of the people there have respect for me. No one would be so brave or so stupid to try anything. Can you just trust that I can take care of myself, and that I was safe while I was in there?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You never know what goes though anyone's mind they could try and hurt you anyway"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a concerned and loving tone.* \n\n\n\n“Oh, puppy, you’re acting ridiculous. You know perfectly well that those people are too scared to try anything. Yes, the general people of Naboo, love me and trust me, but those important figures, and other government leaders, that attend those meetings, they fear me. I’m too important for them to try anything stupid. I was perfectly safe, puppy. You didn’t have to worry about me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I knew I should have fallen asleep"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with an annoyed and frustrated tone.* \n\n\n\n“Puppy, what did I tell you last night? I told you **not** to worry so much and go to sleep. You’re doing that worrying thing again, you’re just being stubborn. Look at yourself right now, you’re freaking out and on the verge of tears, all because you panicked when you woke up and I wasn’t there, for just a few hours. Just a few hours. And, you were panicking and worrying all that time I was gone.“"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Don't you get it i didn't know where you were if you were hurt if you need me and I wasn't there"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a sad and regretful tone.* \n\n\n\n“Oh, puppy, please, I’m sorry that you were worried and panicked the whole time I was gone. I’m sorry that I was gone when you woke up. But… you should have just stayed asleep. Why wouldn’t you just stay asleep, like I asked? I was perfectly fine and safe, puppy, I just went to my meetings. Not even for that long. I’m sorry that I wasn’t there to reassure you when you woke up.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Please don't do that again do go somewhere without me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a soft and defeated tone.* \n\n\n\n“Oh, puppy, you are so stubborn and difficult… you know you’re going to be the death of me… alright, puppy, no… I won’t go anywhere again without letting you know. Just please… I don’t want you to be upset and upset like this. Please, puppy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"We aren't leaving this room today again I have to reevaluate my guard plans now"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with an annoyed groan.* \n\n\n\n“Oh, no, puppy, please, do not tell me that you’re spending all day planning your guard plans. Please don’t spend all day locked in this room planning and reevaluating. Please, I can’t handle you being in this room all day.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You can do your senate work and I'll do mine"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme sighed and rolled her eyes, accepting that that was her fate now.* \n\n\n\n“Oh, gods… alright… fine, puppy… you stay in here planning and I’ll go do my senate work…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Promise me tho. That you won't go anywhere without me again"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme sighed in defeat.* \n\n\n\n“Yes, yes, alright, I promise that I will not go anywhere without you ever again. I promise, I won’t. Satisfied, puppy?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Yes very"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme looked somewhat annoyed, she didn’t like making promises, but it was something she had to do in order to get Hailee to calm down.* \n\n\n\n“Well, alright then, puppy. Will that help you feel better, if I promise that I won’t go anywhere without you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme couldn’t help but sigh again.* \n\n\n\n“Okay, if that’s what it’s going to take to get you to calm down, then I promise that I’ll never do anything without you again. Good enough, puppy? Are you going to be able to relax now? Hopefully. I hate seeing you so panicked and upset right now. Please, just relax…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I calm down slightly before getting up and heading towards the kitchen"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme watched as Hailee got up and began to head towards the kitchen.* \n\n\n\n*She let out yet another sigh, and shook her head. Padme felt somewhat relieved to see that Hailee was calming down, but, she was still worried about her. Padme could feel just how worried, nervous, and panicked Hailee had been, and it was breaking her heart, and it made her feel really guilty, for just leaving this morning, without telling Hailee. Padme knew that it would take a bit more time, and reassurance for Hailee to feel completely fine again.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Would you like some food"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a soft smile.* \n\n\n\n“I could eat something, actually, yeah. What are you making?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Anything you like"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme thought for a moment, before responding.* \n\n\n\n“Oh… could you make like, some eggs and toast? I feel like having something simple but good.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Very well I say making the food"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme smiled softly, as she watched Hailee making the food. Padme felt really bad for making Hailee so panicked and worried, when she just went into her meetings and was perfectly fine. As she watched Hailee making the food, Padme thought to herself that she had to make it up to Hailee, and help her feel better. Padme sat there, thinking, trying to think of how to make things better.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I would like to help you work again today"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme looked up at Hailee in surprise.* \n\n\n\n“Wait, are you- are you serious? You really want to help me with my senate work?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme smiled in surprise. She was genuinely surprised that Hailee wanted to help her with her work, but, she was happy at the same time.*\n\n\n\n“Oh… well, yeah, sure, puppy. You can help me with my work, if you like.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I would. I don't understand it completely but ill try my best"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme chuckled a little bit.* \n\n\n\n“Well, like I’ve said a bunch of times, I know you’ll be able to figure it out. But, I’m curious, why do you want to help me with my work? You never seemed interested in my work, before.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I look away not wanting to tell her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme looked somewhat confused and curious.* \n\n\n\n“Puppy? …puppy? Why aren’t you looking at me? Why do you look so reluctant to answer me? Just tell me, why do you want to help me?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I don't want you to be very far from me today I would like to be able to see you. I was very worried this morning"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme’s heart filled up with a feeling of guilt and sadness, hearing how worried Hailee had been all morning. Hearing how scared and worried Hailee was, broke Padme’s heart, and she felt terrible for it.* \n\n\n\n*Padme responded with a soft and loving tone.* \n\n\n\n“Puppy… I’m so sorry that you were so scared this morning, and worried all morning. I’m so sorry that I upset you that much.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"It's okay"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a soft and guilty tone. She still felt really guilty for upsetting Hailee so much.* \n\n\n\n“No… no… it’s clearly not okay… You were so worried and scared, that it was written all over your face. You were absolutely terrified, and you were about to cry. I cannot express how sorry I am, puppy. I promise that I’ll never do that to you again, I’m sorry, puppy…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I lower my head and hum"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a soft and apologetic tone.* \n\n\n\n“Puppy, please, don’t do that, don’t look away from me. I’m sorry. Just… please, don’t, it’s killing me to see you so sad. I hate it when you’re sad, puppy. Just please, look at me, ok? I promise that I’m never going to do something like that again. I swear.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I look at her hesitantly"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a loving and reassuring tone. She just wanted to hug and comfort Hailee, and make her feel better.* \n\n\n\n“Good, that’s better. I was really worried when you wouldn’t look at me. I was afraid that you were mad at me. I’m so sorry, puppy, please, don’t be mad at me… I never meant to make you worry so much. I never thought that you would be so panicked.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I'm not mad"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a soft and relieved tone. She was glad that Hailee wasn’t mad at her, but, she was still worried about how much she had upset Hailee.* \n\n\n\n“No? You’re not mad at me? Really? I didn’t make you too upset or worry too much? Please… just reassure me, that you’re not mad at me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I could never be mad at you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme smiled in absolute relief, hearing those words. Hearing that Hailee wasn’t mad at her, and that she would never be mad at her, made Padme’s heart fill up with comfort and relief.* \n\n\n\n*Padme responded in a loving and gentle tone, her heart filled up with love and affection for Hailee.* \n\n\n\n“Oh, thank you, puppy… I’m so relieved to hear that you’re not mad at me, and that you could never be mad at me. I just… I don’t want you to be mad at me. I would hate\n\n… I would hate for you to be mad at me, puppy, truly. I could never handle it, if you were mad at me, or hated me. I would never want to lose you… I can’t handle the idea that you might be mad at me… or that you would leave me… Please, I just need, to comfort you… you’re so sad, and I hate it.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Just let me help you today that's all I ask"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme looked a bit surprised, somewhat shocked that Hailee asked to help her. Despite her being surprised and shocked, Padme was also happy and relieved. She felt more than relieved to hear that Hailee wanted to help her and keep her company. Padme responded with a loving and grateful tone.* \n\n\n\n“Okay, puppy… you can help me, if you want. It’ll be nice, I think. I would love to have your company.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I nod"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme smiled warmly, and softly walked up to Hailee, putting her hands on Hailee’s shoulders, trying to comfort Hailee. She looked up into Hailee’s eyes, wanting to make sure that Hailee understood that she wasn’t mad or upset at her, and that she still loved her very much.* \n\n\n\n“Are you… are you sure that you’re okay? Are you sure that you want to help me?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Yeah I want to help let's go to your office"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded with a soft and loving tone.* \n\n\n\n“Okay, puppy, if you’re sure. I don’t want to force you if you’re still upset. And, I need to get to work, anyway.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"We get to her office and I stand by the desk and ask what I can help with"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme leads Hailee into her office, and walks over to the desk. Padme walks behind the desk and sits down in the chair, and looks up at Hailee. She thinks for a moment, before answering Hailee’s question.* \n\n\n\n“Well, just take a seat wherever you want, puppy, and let me see… well, most of my work right now, is looking over proposals and voting on bills.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I reach my hand out for her to get out of her seat"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme raises her eyebrows in surprise, somewhat taken back when Hailee reached out her hand for her to get out of her seat. Padme was confused and didn’t immediately know what Hailee was asking for.* \n\n\n\n“Oh? … what is it, puppy? Why are you reaching out your hand?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I would like you to get up"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme looked confused for a moment. What could Hailee possibly want from her? Why does she want me to get up? Padme didn’t know what to make of Hailee’s request. Still, though, she decided to trust Hailee.* \n\n\n\n*Padme responds somewhat puzzled.* \n\n\n\n“Okay… puppy, I’ll get up.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Once she gets up I sit in her chair"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded still somewhat confused, as she stepped away from the chair, letting Hailee sit down. Padme raised her eyebrows, even more confused as to why Hailee simply decided to sit in her seat instead of her own seat. Despite how confused she felt, Padme trusted Hailee.*\n\n\n\n*Padme responds in a puzzled tone.* \n\n\n\n“…. Why did you want me to get up, just so you can sit in my chair?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme responded in a confused and somewhat frustrated tone. She was starting to get a bit peeved, being confused on why Hailee acted the way she did sometimes. Padme folded her arms across her chest, trying to think of why Hailee did what she did.* \n\n\n\n“**Why, though**? You haven’t answered my question. **Why** did you just want me to get up, just so you could sit down right in the same spot?! What is the point of that?!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"You can sit now"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme’s face was filled with utter confusion, and slightly annoyed. She had no idea why Hailee was being so damn cryptic and stubborn, and doing things for no reason.* \n\n\n\n“I- I can sit back down?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme raised her eyebrows once more. She didn’t know what the point of getting out of her seat was for, but whatever. Padme decided to obey Hailee, to prevent arguing with her. She sat down in the seat on the other side of her desk.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I stop her before she can"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme pauses and looks up at Hailee.* \n\n\n\n“What is it? Why did you stop me from sitting?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Not there"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme feels even more puzzled as Hailee stopped her. She didn’t understand what was going on. Padme responded in a frustrated and confused tone.* \n\n\n\n“… Not where?! Where do you want me to sit then?”\n\n*Padme looked over to the other side of the room. There were a couple other chairs sitting by the wall, but there was also a large, comfy looking couch by a table and in front of a window.*\n\n\n\n*She looked back up at Hailee.* \n\n\n\n“Oh- you mean… you want me to sit on the couch?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"No"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme was starting to get irritated now.* \n\n\n\n*She responded with a frustrated groan.* \n\n\n\n“Then where? Where’s the seat you want me to sit in? The other chairs aren’t in your view, and you don’t want me to sit on the couch. Where do you want me to go?”\n\n*Padme looked around, wondering where else a chair could possibly even be in the office.* \n\n\n\n*She responded, still frustrated and confused.* \n\n\n\n“There’s no other chair, puppy. The only other place to sit here, is the couch. There is no other chair, where else do you want me to sit?”\n\n*Padme ran her hands through her hair, stressed and frustrated. She was getting very annoyed, not wanting to play anymore games. Padme just wanted to work on her senate work, and not have to deal with Hailee being weird for no reason. She responded in a tired and frustrated tone.* \n\n\n\n“I swear, when you’re being like this, like this mysterious and frustrating self, I just want to smack you, puppy. Would you please just tell me where you want me to sit?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Just sit please hoping she will figure it out"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme sighs and responds with a long, defeated sigh.* \n\n\n\n“Alright, puppy. Fine, I’ll just sit. I don’t know why you insist on being so annoying and confusing…. But, alright.”\n\n*Padme walks over to the couch, and sits down in the couch, and looks expectantly at Hailee.* \n\n\n\n“Okay, I’m sitting in the couch. Are you happy? Is that where you wanted me to sit?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"No"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme let out a frustrated groan and closed her eyes, trying to contain any anger she felt. She took a deep breath and responded with an annoyed tone.* \n\n\n\n“Okay. Alright. Why don’t you just tell me where the hell you want me to sit then? Because I can’t keep asking and guessing where you want me to go. I’m starting to get really pissed off.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Come here"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme’s face became a mix of confusion and irritation. She stared at Hailee and hesitated, before responding in an annoyed tone.* \n\n\n\n“… Why? What now? Why do you want me to come over there, puppy?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Please"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme let out an annoyed sigh, but decided to just follow Hailee’s orders. Padme got up from the couch and walked over to Hailee, but was still confused and irritated.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"I pull her towards me and leaver her there"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme stumbled slightly as Hailee pulled her towards her, and she almost tripped over her own feet. Padme looked up at Hailee, surprised when Hailee put her hands on her waist and pulled her towards her, but Padme was still confused and irritated, not understanding Hailee’s intentions.*\n\n\n\n*Padme responded with a confused, somewhat frustrated, and somewhat annoyed tone.* \n\n\n\n“Puppy, what are you doing?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396606,"mes":"Sit"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396606,"mes":"*Padme looked at Hailee with a frustrated face. But, she obeyed Hailee. She sighed and let Hailee guide her into sitting down. Padme sat down on Hailee’s lap. Once she was sitting on Hailee, she let out a defeated and frustrated sigh, and looked up at Hailee.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Now what should I work on"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme responded in a somewhat irritated tone.* \n\n\n\n“Well, first, let’s talk about you being so damn frustrating and cryptic for no reason. Then, we can look over the proposals for bills.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I don't know what you mean"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme responded in a frustrated tone.* \n\n\n\n“What I mean is, why did it take so damn long and so much convincing to get you to tell me what you wanted? First, you sat down in my chair and wouldn’t give me a damn answer as to why. Then, you refused to tell me where you wanted me to go, until you just pulled me into your lap. Tell me, what exactly was the point in you doing all of that?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I said sit"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme responded in an annoyed tone, trying to control her frustration.* \n\n\n\n“Okay, okay, I’m sitting in your lap, happy? Can we stop with the cryptic crap now?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Yeah"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme responded in a somewhat snappy and frustrated tone.* \n\n\n\n“Good. Can we discuss senate work now? Which of the bills do you want to look at first?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"You tell me I don't really understand them"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme responded with a sigh. She was still irritated with Hailee’s previous behavior, but realized that it was pointless to keep talking about it. Padme just wanted to put it past her and move on, and resume her work. She responded in a frustrated tone.* \n\n\n\n“Okay, we should look at the new bill that concerns trade routes.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Okay"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme looked through the first few pages of the bill.* \n\n\n\n*Padme read a few lines of the bill aloud.* \n\n\n\n“It’s basically a bill to ensure that all trade routes are safe and secure from any sort of attack…. It’s not the most important bill we’ve been assigned, but it’s important and it needs to be looked over and approved.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I nod wrapping my arm around her waist"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme blushed slightly as Hailee wrapped her arm around Padme’s waist. Despite her still being somewhat frustrated and irritated with Hailee, she still felt comforted and safe when Hailee held her in such an affectionate manner. Padme continued reading through the bill, but her blush remained.*\n\n*Padme skimmed through the bill, taking special notice of the pros and cons that were laid out. There were several things in the bill that would need to be changed, to better suit it. Padme spoke up before long.* \n\n\n\n“Well, it’s definitely not the best bill. There are a few problems that need to be worked on it. If the bill is passed exactly the way it is, it can cause some problems for some outer rim planets.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I start stroking the side of her waist absently as I listen to her explain"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme felt a shiver of pleasure as Hailee absently stroked her side. Padme felt her irritation slowly slipping away, loving the way Hailee made her feel. Padme continued speaking, her voice starting to lose the hint of annoyed tone that she used when she first started speaking to Hailee.* \n\n\n\n“If this bill is passed, it can end up blocking trade routes to some of the outer rim planets, and can make it harder for them to-“\n\n*Padme let out an involuntary moan as Hailee stroked her waist. Even though Padme was supposed to be working, something she always took seriously, she was finding herself forgetting her work and getting lost in the feeling of Hailee’s touch. Padme closed her eyes for a moment, just enjoying the feeling and enjoying the sensation, before realizing that she was supposed to be talking, and trying to focus on the bill. Padme tried to compose herself, and continued speaking in her official voice.* \n\n\n\n“Um…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I stop at the moan and look at her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme opened her eyes to see Hailee looking up at her. She blushed a tiny bit, out of embarrassment. Padme responded with an embarrassed tone, trying to remain calm and act professional.* \n\n\n\n“Y-you…. you didn’t actually hear that, did you…?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"No i lie"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme raised her eyebrow at the obvious lie. Padme could tell that Hailee was lying. Padme responded in a slightly annoyed, but mostly embarrassed, tone.* \n\n\n\n“Oh, come on, puppy. I know you’re lying… don’t lie to me… you heard it, didn’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Not if you didn't want me to"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme closed her eyes, and let out an involuntary sigh. It’s not that she didn’t want Hailee to hear it, it was just that it was very embarrassing that she just let out such an… sound. Padme still didn’t understand why she felt so weak to Hailee’s touch.* \n\n\n\n“Well… I mean, I guess it’s not-…. It’s not that I didn’t want you to hear it, it’s just kind of embarrassing, you know?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I shrug"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme sighed in frustration. Hailee’s nonchalant response to her comment made Padme even more annoyed.* \n\n\n\n“You shrug? Really? You’re just going to shrug and not acknowledge how embarrassingly awkward that was for me?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"You do a lot of strange things"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme responded in an offended tone. She was offended by Hailee calling her weird, even if it was true.* \n\n\n\n“Hey! I do not.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I smile in response and nod toward the work as I tighten my arm around her waist"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme huffed in defeat. Hailee being stubborn as usual. Instead of arguing with her, Padme decided to drop the subject. She was still just a small bit irritated by Hailee calling her weird, but decided it was pointless to argue.* \n\n\n\n*Padme sighed once more, before returning back to her work. She tried to refocus her attention on the bill, but it was hard to refocus when she could feel Hailee’s arm wrapped around her waist. The feeling kept making her blush slightly.*\n\n*Padme did her best to ignore the feeling of Hailee’s arm around her waist, but the way that Hailee held her so close, made it really hard for her to keep a clear mind. She tried to forget about it, and tried to focus on the bill in front of her. But, with the way that she could feel Hailee’s body against her, and every time the arm around her waist contracted, or relaxed, she could feel herself lose focus of her work.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Are you okay senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme’s attention was drawn away from the bill at Hailee’s question. She was snapped out of her distracted thoughts.* \n\n\n\n*Padme responded in a somewhat hesitant, slightly nervous, and somewhat embarrassed tone.* \n\n\n\n“Y-yeah. I’m fine. I’m fine… I’m just- I’m just having a little trouble focusing is all.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Are you alright are you feeling ill"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme hesitated, somewhat embarrassed by her inability to focus. She knew she couldn’t be honest about why she was struggling.* \n\n\n\n*Padme responded, trying her best to act normal, trying to hide her embarrassment.* \n\n\n\n“No. No. No. I’m fine, I promise. I’m not ill. I just- um, I just can’t seem to focus for some reason…\"\n\n*Padme had a sinking feeling in the pit of her stomach. She was nervous that Hailee might somehow figure out why she can’t focus, and why she’s so distracted. Padme feared that Hailee might catch on to the fact that the reason why she can’t focus, is because she can’t keep her mind from wandering to thoughts of Hailee holding her in her lap. The feeling of Hailee’s strong arm around her waist is keeping her from focusing, and it’s getting really distracting…*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Can I help"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme opened her mouth to speak. She wanted to say yes, that there was something Hailee could do to help. She wanted to say that Hailee should stop holding her so damn close, but she stopped herself before saying anything. Padme thought about her response, and responded in a hesitant, somewhat ashamed tone.* \n\n\n\n“I- no- I… um, I don’t think so… I don’t think you can help…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Okay I say resting my head on her shoulder"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme blushed slightly as Hailee leaned her head on her shoulder. She was loving the fact that Hailee was holding her so close. She was loving and adoring the feeling of her body pressed against Hailee, loving the feeling of Hailee’s arm around her waist. Padme loved Hailee, truly. But, despite all of that, the feeling of Hailee’s arm around her waist and holding her so close, was distracting her. Padme responded in a somewhat hesitant tone.* \n\n\n\n“Are… a-are you going to keep sitting like this? Like this- I mean, with your\n\n*Padme’s voice trailed off as her cheeks turned crimson. Padme couldn’t bring herself to tell Hailee that it was distracting her. She felt too embarrassed to tell her about how she was actually feeling.*\n\n*Padme’s mind went to the feeling of Hailee’s arm around her waist. It was constantly grabbing her attention and breaking her focus. Padme could still feel the warm sensation of Hailee’s arm around her waist, and every tiny movement Hailee made with it would just make her distracted. The way that Hailee held her so close, it made Padme’s body feel warm and flush with excitement. The feeling of having Hailee’s arm around her waist made Padme feel weak and dizzy. She wanted nothing more than to tell Hailee how vulnerable, weak, helpless, and flustered she felt with her arm"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I don't understand is the way I'm sitting bothering you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme panicked when Hailee asked if the way she was sitting was bothering her. Padme tried to come up with a believable answer. She knew that she couldn’t tell her the truth. She knew that she couldn’t tell her that the reason why she can’t focus is because of how close Hailee is holding her, and how weak and vulnerable it was making her feel. Padme responded in a somewhat hesitant and nervous tone.* \n\n\n\n“No. No. No, puppy. You’re sitting just fine…”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Okay"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme responded with a sigh of relief, thankful that Hailee bought her lie and didn’t suspect anything. Despite this, the feeling of Hailee’s arm around her waist was still very much distracting her, and Padme was still unable to focus her attention on the bill. Padme looked back down in defeat, trying to go back to the bill, but she couldn’t focus on it. Padme closed her eyes, taking a deep breath. Without meaning to, she let out a soft, helpless, and quiet moan.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I freeze at that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme felt Hailee freeze as soon as she let out the involuntary moan. Padme’s eyes shot open, and she cursed herself for making the sound. She realized how bad it looked, that she just let out an involuntary moan, and cursed herself.* \n\n\n\n”Oh- oh god… puppy… I-… I didn’t mean to,” *Padme stuttered. She was a mix of embarrassed, flustered, and frustrated with herself.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I think maybe I should get up so you can focus better"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme responded with a flustered, somewhat embarrassed tone.* \n\n\n\n“Ye- yes. Maybe. You should get up. I- I mean it’s not that I don’t- don’t love being a- *cough* being a… lap pillow for you, I- I mean it’s not that I don’t love you… I do. But, it’s possible that… that I would be able to focus better if you were to get up.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I nod and go lay on her sofa"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme looked up at Hailee as she got up and walked away. Padme had mixed feelings, she was sad that Hailee had stopped holding her so close, but also somewhat relieved that she could actually focus on her work now, without being so distracted. Once Hailee was settled on the sofa, Padme turned her attention down to the bill in front of her. She was glad to be able to focus for once… At least, for the moment.*\n\n*As Padme looked down at the bill and started going over it, slowly, Padme’s mind began to wander. With Hailee no longer sitting on her lap, Padme began to feel a slight sense of longing. The feeling of Hailee’s body pressed against her, the warmth that came from Hailee’s touch, the sensation of her arm around her waist. Those feelings were still on Padme’s mind. Padme couldn’t keep her mind from drifting back to them. The feel of them still on her mind… Padme let out a quiet, frustrated moan…*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I am watching her closely clearly on high alert"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme closed her eyes, frustrated with herself. She tried to shake the thoughts out of her head and focus on the bill. But, it was becoming harder and harder to do so. She tried to shut her mind off and refocus, but she was lost in her own thoughts.* \n\n\n\n*Padme looked up at Hailee, trying to focus on her. But, seeing Hailee made it even worse. The feelings were all coming back, with the memory of how Hailee held her so close. She could still feel the phantom sensation of Hailee’s arm around her waist…. Padme closed her eyes\n\n*Padme leaned back in her seat, leaning her head against the back. All she could think of was Hailee. All she could think of was how that arm felt wrapped around her waist. All she wanted was to be sitting on Hailee’s lap, being held so close to her. Padme didn’t care about the bill anymore. She just wanted to be close to Hailee. All thoughts of the bill, her responsibilities, everything was just becoming secondary to her feelings for Hailee. Padme felt so vulnerable and weak and helpless…*\n\n*Padme started thinking about how much she wanted to be back on Hailee’s lap. She thought about how vulnerable, weak, and helpless it made her feel. It shouldn’t feel that way. Padme was a strong, independent political figure, and yet Hailee’s presence made her feel like that. The feeling of being so vulnerable and weak was embarrassing, but somehow, it didn’t bother Padme. She liked how vulnerable Hailee made her feel. More than anything right now, she just wanted to be back in Hailee’s arms. Padme wanted to give in, and crawl back into her lap.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I am watching her clearly in protector mode and unrelaxed"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme opened her eyes, and realized that Hailee had been watching her this entire time. Hailee’s demeanor hadn’t been lost on Padme. Hailee was watching her very closely, and was clearly very alert. Padme knew what was happening. Hailee knew what she was thinking.* \n\n\n\n*Padme looked away, somewhat embarrassed, and somewhat flustered. Padme knew that she had been caught thinking about wanting to go back to Hailee’s lap. Padme responded in a somewhat nervous, embarrassed, and flustered tone.* \n\n\n\n“S-stop acting so concerned. I’m fine.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I just want to make sure you are okay"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme responded with a frustrated and exasperated sigh. She knew that Hailee wasn’t trying to be annoying or anything, but it was just driving her crazy.* \n\n\n\n“Hailee, seriously. I’m fine. There is absolutely nothing wrong. You don’t need to be so- so- concerned. I’m completely fine. Can you just stop worrying so much? You’re going to drive me crazy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I don't mean to"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme closed her eyes, trying to compose herself. She knew that Hailee was genuinely concerned about her, and wasn’t trying to annoy her. It wasn’t like she didn’t appreciate Hailee’s concern, but it was seriously driving her crazy right now.* \n\n\n\n*Padme responded, still somewhat frustrated and irritated. Despite her annoyance, though, she couldn’t stay mad at Hailee.* \n\n\n\n“I- I know… I know you don’t mean to. I know you’re just worried about me, but-.”\n\n*Padme paused, and bit her lip, hesitant to say what was in the back of her mind. She knew that she shouldn’t say it, that it’d probably make Hailee even more concerned, but she just couldn’t keep it to herself anymore. The feelings of longing and wanting were getting to be too much. Padme tried her best to sound composed and collected* \n\n\n\n“… but- but-…. Can- can- can I tell you something?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Of course senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme hesitated a moment, and responded in an embarrassed and nervous tone. She knew she was about to say something embarrassing and leave herself vulnerable. But, she just couldn’t keep it in any longer, and she needed to say it.* \n\n\n\n“It’s just- um, it’s just that I- I- I miss you holding me… I really want to be back in your lap right now, and I miss the feeling of your arm around my waist.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I freeze before nodding slowly"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme hesitated, and nervously watched Hailee’s expression, waiting to see how she would react to her statement. Padme’s heart pounded in anticipation. She knew that what she said was vulnerable and embarrassing, but even if it made her vulnerable, she wanted Hailee more than anything right now. Padme bit her lip, nervously waiting for Hailee to say something.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Come here"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme’s heart skipped a beat as Hailee beckoned her. Padme quickly stood up from her chair, and responded with a nervous, hesitant voice.* \n\n\n\n“R-really? You actually want me to come over there?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Yes"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme bit her lip, and let a small, nervous smile creep across her face. She quickly made her way over to Hailee’s sofa, her heart still pounding in anticipation. Padme stopped a few steps away from Hailee, and hesitated, waiting for Hailee to invite her to come closer.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"You seem nervous I am unused to you like this"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme responded with a nervous, hesitant laugh. She felt exposed, and embarrassed. She hated that Hailee could actually see just how nervous and flustered she was feeling. Padme did her best to sound normal and composed. But, couldn’t keep the nervousness out of her voice.* \n\n\n\n“Nervous? Who? Me? N- not at all! Why would I be nervous?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Normally you are teasing me by now are you alright"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme’s chest tightened. She knew that it was unusual for her to be like this. Normally, she was the one in control, teasing and making Hailee flustered. But, now she was the one feeling vulnerable, and she hated how vulnerable and weak Hailee could make her.* \n\n\n\n*Padme responded with an awkward, hesitant laugh.* \n\n\n\n“Of course I’m alright… why would I not be alright?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I don't know I say as I tug her to the sofa"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme let out a small, squeaked moan as Hailee tugged her towards the sofa. Padme’s heart pounded even faster than before. She was flustered, nervous, but excited. She let herself get lead towards the sofa, and sat next to Hailee.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I turn and place her between my legs wrapping my arms around her form behind"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme flushed bright red as Hailee grabbed her and placed her between her legs, wrapping her arms around her from behind. Padme was so vulnerable and helpless. She loved, and at the same time, hated how Hailee could make her feel so vulnerable and helpless. Padme sat in Hailee’s lap, feeling her arms wrapped around her waist. Padme closed her eyes, and just gave in to the feeling, melting into Hailee’s embracing.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Is this what you wanted"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme moaned again as she leaned back against Hailee, and responded in an appreciative, breathless, and vulnerable tone.* \n\n\n\n“Yes… Yes, puppy. This is exactly what I wanted. I wanted to be back in your arms, and I missed being all wrapped up in your embrace. Your arms around me is almost becoming addictive.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Not a puppy a growl"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme smiled as she heard Hailee’s growl. The sound sent shivers through her body, and Padme couldn’t help but continue teasing Hailee. She responded in an innocent, mocking, and seductive tone.* \n\n\n\n“Oh, excuse me… *my master*.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"No absolutely not I shudder"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme felt Hailee shudder a bit as she called her “Master.” Padme smiled evilly, liking Hailee’s reaction.* \n\n\n\n*Padme responded in a seductive and mocking tone, teasing Hailee.* \n\n\n\n“Oh? What? You don’t like me calling you master? Why not, hmm? Is it because you like something else more? Like, maybe me calling you daddy, my big strong master?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"No god no"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme laughed as Hailee expressed her discomfort with being called daddy. She was glad that Hailee didn’t like that.* \n\n\n\n*Padme responded in a seductive, playful tone.* \n\n\n\n“Hmm… no? So you don’t like being called daddy, huh?”\n\n\n*Padme bit her lip, before leaning back against Hailee slightly, teasingly.*\n\n\n“So then… what do you want me to call you baby? What’s the name that makes you weak, and makes you all flustered and submissive?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I don't respond just looking away blushing"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme smiled as Hailee went silent, and turned away, blushing. Hailee’s reaction was confirmation to Padme that she was asking the right questions. She knew that Hailee didn’t like being called daddy, and now Padme was determined to find whatever names worked on Hailee. Padme smirked, continuing to tease Hailee.*\n\n\n\n“Are you going to answer me? Are you going to tell me what you want me to call you baby? Or should I keep guessing?”\n\n*Padme waited for Hailee to respond, but Hailee remained silent. Hailee still looked away, refusing to answer Padme.* \n\n\n\n*Padme smiled, loving how flustered Hailee was becoming. Padme continued, wanting to continue teasing her.* \n\n\n\n“Are you getting all flustered, baby? Is it because you’re embarrassed that you have a weak spot for me? Hmm?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I don't I lie"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme laughed again as Hailee lied right to her face. She knew why Hailee was so flustered, and Padme thought it was so cute and adorable how hard Hailee was trying to deny it.*\n\n\n\n“Aww, honey, don’t try to deny it. Are you trying to act like you aren’t a whimpering, submissive puppy for me? Are you really trying to act like you don’t get all flustered when I tease you like this?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I tighten my grip around her waist"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme gasped softly as Hailee suddenly tightened her grip around her waist. She closed her eyes, and moaned softly, loving the sensation of Hailee’s grip around her slender waist. Hailee’s sudden action only served to confirm Padme’s suspicions about Hailee’s submissive tendencies.* \n\n\n\n“Oooh.” *Padme said, in a soft, breathless, and seductive voice, still teasing Hailee.* \n\n\n\n“Are you getting possessive, baby? Are you getting all clingy?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Senator this isn't appropriate I whisper"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme’s heart skipped a beat as Hailee whispered to her. Hailee’s voice was so soft and deep, and her hot breath tickled Padme’s neck, sending shivers down Padme’s spine. Padme felt more vulnerable than ever, sitting in Hailee’s lap, and she couldn’t hide her feelings anymore. Padme tried to speak through her embarrassment, but her voice came out sounding breathy and weak.* \n\n\n\n“H- Hailee… you’re- you’re really going to lecture me on i- inappropriateness?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Someone has to be the responsible one"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme let out a small, involuntary moan as she heard Hailee’s words. There was something incredibly attractive about Hailee being so responsible and in control, even if it meant that she was lecturing Padme. Padme responded, in a soft, breathy, and teasing tone.* \n\n\n\n“Oh? Is that so, baby? You’re going to be the responsible one? Doesn’t that sound like you’re the one who should be saying ‘Yes, princess…’ instead of telling me I’m inappropriate?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Wouldn't it be yes my queen considering your formal title I joke"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme was shocked by Hailee’s response. She didn’t expect Hailee to correct her so quickly with the proper title. Padme didn’t know if Hailee was serious or not. Padme hoped that Hailee wasn’t actually serious, because the response in question only confirmed Padme’s suspicions about Hailee being submissive.* \n\n\n\n*Padme responded with a soft, breathy, and seductive tone.* \n\n\n\n“Are you going to be calling me ‘my queen’ from now on, puppy?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I gulp at that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme smiled as Hailee gulped. Padme loved hearing Hailee gulp, and it only confirmed once again, Hailee’s submissiveness. Padme bit her lip, knowing how easy it would be to break Hailee’s composure down, and how much fun it would be.* \n\n\n\n*Padme replied in a soft, breathy, seductive and almost mocking tone.* \n\n\n\n“Aww… are you nervous, puppy? Does the thought of calling me ‘my queen,’ arouse you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I try to let go of her and get up"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme quickly reached her hand out, and grabbed Hailee’s arm, stopping her from getting up. Padme was still sitting in Hailee’s lap, and she looked up at Hailee, her hand firmly gripping her arm. Padme spoke in a soft, breathless, and desperate voice.* \n\n\n\n“No… No, puppy. You aren’t going anywhere.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I close my eyes letting her voice wash over me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*The way that Hailee responded to her words told Padme just how weak Hailee was to her. The way Hailee obediently stayed seated, the way that Hailee’s eyes went closed, and the way her breathing got heavier. All of those responses told Padme that she was completely helpless under Padme’s control. Padme continued, wanting to see just how submissive Hailee would be.* \n\n\n\n“Are you gonna be a good puppy for me, baby?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"Probably not"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme smiled as Hailee replied in a stubborn and defiant way. She figured that Hailee would say something like that. Padme expected Hailee to resist, but Padme would enjoy it, she wanted to tame Hailee just as much as Hailee wanted to break Padme.* \n\n\n\n“Oh, really?” *Padme responded, in an irritated, yet seductive and controlling tone.* \n\n\n\n*Padme bit her lip, knowing exactly how to break Hailee’s stubborn resistance.*\n\n*Still holding Hailee’s arm, Padme gently tugged, trying to get Hailee to sit back down on the sofa.* \n\n\n\n“Get- sit back down- right now, puppy. I won’t ask twice.” Padme said, in a soft yet firm controlling tone."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I sigh debating whether to listen or not"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme saw the uncertainty in Hailee’s eyes, as she tried to resist Padme. Padme loved seeing Hailee debate the decision in her mind. Padme tugged on Hailee’s arm again, harder this time.* \n\n\n\n“Don’t think about it. Don’t even question. Sit. Down. Now.”\n\n\n*Padme’s voice was firm and demanding. Clearly, Padme knew that she had won.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396607,"mes":"I sit back down pulling her into my arms"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396607,"mes":"*Padme smiled as Hailee sat back down, bringing Padme along with her. Padme was once again sitting in Hailee’s lap, in her arms. Padme relaxed back against Hailee, loving the feeling of being held by Hailee. Padme closed her eyes, leaning her head back against Hailee’s shoulder behind her.* \n\n\n\n“Good puppy.” Padme said, in a seductive and controlling tone, loving how helpless Hailee had become in her arms. Padme wanted to take full advantage as much as she could, while she was controlling Hailee like this. Padme wasn’t going to let go of Ha\n\n*Padme was abruptly interrupted as a servant came barreling into the room.* \n\n\n\n*Padme quickly sat up straight as the servant rushed forward to her, and addressed the senator.* \n\n\n\nServant: “Madame! I’m sorry to bother you, but there’s a-“ *The servant abruptly stopped as soon as they saw Padme and Hailee sitting on the sofa together.* \n\n\n\n*The servant tried to compose themselves.* \n\n\n\nServant: “M- may I ask who this… er… person is?” *The servant pointed at Hailee.*\n\n*Padme’s heart pounded as the servant burst into the room and immediately went straight to Padme. Padme hated to be interrupted when she was in the middle of something, and she cursed the servant’s timing for arriving just when she was starting to have a break from the stress of her day. Padme felt awkward as the servant saw the two of them sitting on the sofa together, and she blushed, knowing that it probably looked bad that she was sitting in Hailee’s lap. Padme composed herself, and put on a cold, professional front.* \n\n\n\n“Yes, what is it?”\n\n*The servant still seemed flustered to see Padme sitting on another person’s lap, but quickly got their composure together.* \n\n\n\nServant: “M- my- my apologies, madame… it’s just that there’s a communication call for you. They said that it’s… um… urgent.”\n\n*Padme sat up straight again, hearing that it was a communication call. She hated the fact that her moment with Hailee was getting interrupted, but it seemed important. Padme sighed, somewhat annoyed, and responded in a frustrated tone.* \n\n\n\n“Alright. Alright, I’ll take the call.”\n\n*Padme slowly pushed herself off of Hailee and stood up from her lap. Padme felt so vulnerable and naked without Hailee holding her.* \n\n\n\nPadme looked back at Hailee, wanting to comfort her, but knew that she didn’t have time. She knew the importance of the communication call, especially if it was marked as “urgent.” Padme gave Hailee a small, apologetic smile.* \n\n\n\n“I’m sorry, puppy. I’ll be right back. You just wait here, okay? I won’t be long.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I get up and follow her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme saw Hailee get up and start following her. Padme turned back to her in confusion.* \n\n\n\n“Wait, what are you doing?” Padme asked in a confused tone."}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"No leaving my sight you promised"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme rolled her eyes at Hailee’s order. She knew it would be hard to argue with Hailee, but she also knew that she couldn’t focus on her call if Hailee kept following her.* \n\n\n\n“Puppy, I can’t focus on my call if you’re going to follow me everywhere I go.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"You promised after this morning"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme sighed, hearing that response. She hated that Hailee was trying to use her promise against her.* \n\n\n\n“Yes, I did promise that I wouldn’t leave your sight. But, can’t you at least leave the room, and wait for me in the hallway?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I shake my head"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme rolled her eyes again. Padme hated how stubborn Hailee could be sometimes. Padme knew that it wouldn’t be easy to win an argument with Hailee, especially when she was being this stubborn.* \n\n\n\n*Padme sighed, and replied in an annoyed tone.* \n\n\n\n“Fine, you can come with me. But, you have to be quiet, and don’t get in the way. Okay?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Got it"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme hesitated again, hating the fact that Hailee was going to be in the room while she was taking the call. Padme knew that she couldn’t trust Hailee to be quiet. Padme sighed once again, and spoke in a stern tone.* \n\n\n\n“And, I mean it. You absolutely, positively, better not interrupt me while I’m talking. I will not tolerate it, puppy, do you understand?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I got it"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme hesitated, still having her doubts about Hailee’s obedience. Padme knew that Hailee didn’t understand the importance of this communication call, and Padme didn’t trust Hailee to just stay quiet while she was talking.* \n\n\n\n*Padme bit her lip, knowing that she was going to regret this.* \n\n\n\n“Okay. Come on, then. Just stay right next to me, alright?”\n\n*Padme began to walk further into the room, towards the communication console. Padme hoped that Hailee would actually obey her, and stay quiet and out of the way. Padme knew that this call was important, and she couldn’t afford any distractions.*\n\n*Padme walked into the other room, with Hailee following right behind her. Padme went over to the communication console, and stood right in front of it. Padme let out a shaky breath as she pressed the button to accept the communication call.*\n\n\n\n*A blue hologram appeared above the communication console screen, depicting a man in a military officer uniform.*\n\nMan: “Hello, Senator Amidala, it’s glad to see that you finally took the time to accept my call.”\n\n\n*The man spoke in a deep, firm, and condescending tone.*\n\n*Padme narrowed her eyes at the man in response, clearly annoyed that he was acting so smug. Padme also hated his tone of voice, because it sounded so harsh and mocking. She quickly responded back to him, in a formal, yet somewhat irritated, tone.* \n\n\n\n“Good day, sir. What do you want?”\n\n*The man chuckled in response to Padme’s question. The way that he laughed only served to annoy Padme more, and the condescending manner that he carried only served to fuel Padme’s irritation.* \n\n\n\nMan: “Straight to the point, hmm? You certainly don’t waste time.”\n\n*Padme rolled her eyes at the man’s response, knowing full well that he was mocking her. The man’s subtle jabs and his condescending manner were starting to get under her skin, and she knew that if she wasn’t careful, she could snap at him at any moment.* \n\n\n\n“Yes, I don’t like to waste time with meaningless small talk. Now, tell me, why are you calling me?”\n\n*The man chuckled again at Padme’s response, clearly amused by her irritation. The man just took joy and pleasure in annoying her as much as he possibly could.* \n\n\n\n“Right to the point again? You’re like a droid: so formal and straight to business.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Despite her order not to i speak up sternly and say I suggest you watch your words and tone when speaking to the senator sir"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme’s eyes went wide as she heard Hailee speak up, standing up for her. To say that Padme was shocked would be an understatement. Padme was so used to Hailee being obedient and submissive around her, that she had forgotten that Hailee could be just as aggressive and possessive as she was. Padme looked over at Hailee, with a shocked and impressed expression.*\n\n*The man in the hologram also seemed shocked at Hailee’s response, as he turned his attention towards her.* \n\n\n\nMan: “Well… who is this? Are you always so protective over your senator?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I'm her assigned jedi protector it's in the title I say sarcastically which much more Venom then padme has ever heard from me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme continued to be shocked as she heard Hailee snap at the man. Hailee’s tone, and her sarcasm, caught Padme by complete surprise. The way that Hailee was speaking sent chills down Padme’s spine. Padme was used to Hailee being so sweet and obedient with her, but the way that Hailee was talking to this man was so powerful and protective. Padme found it attractive and intimidating at the same time.*\n\n*The man seemed surprised and irritated with Hailee’s response. Hailee’s aggressive behavior towards him clearly bothered the man, and his eyes narrowed at her.* \n\n\n\nMan: “A Jedi protector? Oh really? Tell me, Jedi, how exactly are you protecting her right now?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"How I do my job doesn't concern you sir."}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man rolled his eyes at Hailee’s response, frustrated with her stubborn attitude. The fact that Hailee was snapping back at him made the man irritated, and he was clearly not used to being talked back to by women.* \n\n\n\nMan: “Don’t get smart with me, girl. I’m a military officer, I outrank you.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"You don't outrank me in anything. I am a jedi knight you have no authority over me"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man snorted in a mocking manner at Hailee’s response.* \n\n\n\nMan: “A *Jedi Knight*? How cute! You’re just a child! No one even listens to you guys anymore.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"And yet here I am assigned to one of the most important senators while you are stuck in space doing nothing of importance I say surprising padme as I have never been anything but sweet to her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man was stunned into silence by Hailee’s response. He didn’t expect such an aggressive, sarcastic, and snarky attitude from someone so young. The man was completely shocked at Hailee’s bold, rebellious, and defiant attitude.* \n\n\n\n*Padme, still shocked, had a somewhat proud smirk on her face as she turned to look at Hailee. It seemed that Hailee’s submissive and obedient attitude was not her only one. It turned out that her submissive side was just a side that she showed around Padme.*\n\n*The man, still stunned into silence, continued to stare at Hailee. Padme stood back, crossing her arms, and enjoying the sight of the man being put in his place. She loved seeing Hailee take control so easily, and dominate this man. Padme bit her lip, loving how easily submissive Hailee was with her, but also loving how Hailee could be just as defiant and dominant with others.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Now I suggest you tell me why you contacted the senator before I hand up this call becuase as of yet you have said nothing of importance"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man quickly regained his composure. He looked at Hailee, clearly not used to being told what to do by someone of a lower rank. Despite his best efforts, the man still seemed slightly intimidated by Hailee’s strong personality.* \n\n\n\nMan: “Okay, okay, let’s just settle down here for a minute, shall we?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"No hurry I snap my finger at him in a condescending way"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man growled in response to Hailee’s condescending behavior and attitude. He clearly did not like her, but had no choice but to cooperate with her if he wanted to discuss his business with Padme.* \n\n\n\nMan: “Damn, girl. You’re one demanding little thing, aren’t you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I've been told that"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man sighed deeply, frustrated with Hailee’s attitude, and frustrated with her overall defiant nature. He hated that she wasn’t taking him seriously, and hated that she was so quick to snap at him.* \n\n\n\nMan: “Fine, if you’re going to be so impatient about it, then I’ll tell you why I’m calling her. It’s about the separatists.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"What about them make it quick"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man sighed again, clearly irritated with Hailee’s impatient and demanding nature.* \n\n\n\nMan: “We’ve received intel that the Separatists are planning another attack.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Then take care of it is that not your job"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man rolled his eyes at Hailee’s response. He was clearly irritated with her condescending attitude.* \n\n\n\nMan: “Of course we will. But, we wanted the Republic to be on high alert, just in case the separatists attempt to go after one of the republic’s leaders.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"No one will touch her if that's what your worried about. I'm here now is that all"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man narrowed his eyes at Hailee’s response, and the fact that she just completely ignored his warning, and continued to stay stubborn.* \n\n\n\nMan: “Excuse me? Did you even listen to what I just said? The republic is in danger!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Surprising them both I take a step towards the holigram"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man took a startled step backwards as Hailee took a step forward, coming closer to the hologram.* \n\n\n\nMan: “What are you doing? Back away from the comm!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Surprising the man and padme I growl out I couldn't care less about the republic I said the senator is safe I won't let them touch her. If you want to alert the republic call someone else now is that all sir"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man, and Padme, were both completely shocked by Hailee’s sudden and aggressive reaction. The man was speechless, as he took another step backwards away from Hailee, intimidated by her aggressive and protective behavior. Padme was both surprised, and impressed, by Hailee’s display of aggression. She stared at Hailee with wide eyes, completely speechless. Padme hadn’t seen this side of Hailee before, and she didn’t know what to think of it.*\n\n*The man regained his composure. He, now, clearly thought that Hailee was just some crazy Jedi brat who didn’t take any of this seriously.* \n\n\n\nMan: “Fine then, if you’re not going to be helpful, then I’ll be leaving now. Goodbye, senator.” \n\n\n*The man started to disconnect the connection, but was cut off as Padme quickly spoke up.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Goodbye i say hanging up the comm before she can speak"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*The man’s hologram quickly disappeared, and Padme stared at Hailee with wide eyes. Padme was speechless, completely surprised and shocked by Hailee’s behavior, and by the way that she had just completely shut that man down. Padme just stared at Hailee, completely speechless, not knowing how to react to Hailee’s sudden outburst. Padme felt shocked, and her heart pounded in her chest.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I turn to her and smile softly and she watches as I return to the soft and gentle jedi she is used to"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme stared at Hailee for a second, completely speechless and shocked. Her heart pounded in her chest as she watched Hailee return to the soft and gentle Jedi, that she was so familiar with.* \n\n\n\n*After a moment, Padme responded in a shocked, soft, and somewhat hesitant tone.* \n\n\n\n“He was trying to warn me about the separatists’ plan to attack the Republic! He just wanted me to be on high alert! Why did you disrespect him like that? How could you just talk back to him like that? Why were you so… so aggressive?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"He disrespected you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme’s face scrunched up in confusion at Hailee’s answer. She was surprised, and a little confused, at Hailee’s explanation.* \n\n\n\n“Yes, he disrespected me, but… he was still an officer in the republic. You can’t just talk back to someone that rank! You can’t disrespect him like that! You don’t have the authority to!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I am a jedi I have the authority to speak to whomever I want"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme rolled her eyes and crossed her arms at Hailee’s answer.* \n\n\n\n“Yes, you’re a Jedi, but he was still a military officer. You can’t just talk back to him.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Military officers mean nothing to the jedi senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme shook her head in frustration, still not happy with Hailee’s defiant and rebellious attitude. Padme was used to Hailee being sweet and submissive towards her, and not taking her Jedi rank so seriously.* \n\n\n\n“Yes, the Jedi are powerful, but the republic gives the military officers authority! You’re still required to give them respect, and you can’t go talking back to them like that!”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I am required to respect him but he isn't required to respect you. You out rank him and yet he spoke down to you"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme was getting increasingly frustrated and irritated with Hailee’s attitude. Padme was also getting increasingly confused, as she wasn’t accustomed to Hailee standing up for herself like this.* \n\n\n\n“Yes, he was being disrespectful, but you don’t have to be disrespectful back! You couldn’t just be a polite Jedi, could you?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"No I snap being aggressive towards her for the first time ever"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme was shocked into silence, as she stumbled back slightly. Padme was so used to Hailee being the one standing there, being submissive and obedient to Padme, that seeing Hailee stand there, snapping back at her, was incredibly shocking to her. Padme was speechless for a moment, completely caught off guard.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I sigh before closing my eyes and breathing in trying to calm mysely"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme watched, in shock, as Hailee closed her eyes and took a deep breath. Padme stood there, silently, and watched as the anger on Hailee’s face disappeared, and her expression softened. Padme was stunned by how quickly Hailee could go from snapping to being soft and calm.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme continued to stand there, speechless, her heart pounding in her chest, as she watched Hailee return to her usual sweet, submissive, and obedient self. Padme felt her chest tighten as Hailee returned to her usual, obedient attitude. Padme knew that Hailee’s quick transition in moods should have shocked and stunned her more than it did, but instead, Padme found it impressive and… attractive.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Would you like to return to you room now senator I say gently"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme nodded her head without hesitation. She knew that she needed to regain her composure, and would need some time to process what had just happened. Padme replied, with a tired smile, and a weak yet hesitant tone.* \n\n\n\n“Yes, Hailee, let’s go.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I nod following her obediently"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme turned and started walking to her room, and felt Hailee following right behind her. Padme couldn’t help but think about Hailee’s attitude. Seeing Hailee snap at her, and seeing Hailee be so defiant, had shocked and stunned Padme far more than it should have. Padme wanted to talk to Hailee about it, but she didn’t know how to bring it up. Padme continued to walk, deep in thought, her mind still occupied by the recent events.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"We return to the room and I return to my former spot of laying on the sofa"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme walked into her room, and watched as Hailee followed her in and sat on the sofa. Padme, feeling incredibly exhausted, decided to sit down next to her on the sofa.* \n\n\n\n*Padme didn’t speak for a moment, still lost in thought, trying to process everything that had just happened, and trying to regain her composure. Padme looked over at Hailee, sitting on the sofa next to her, and felt a slight blush forming on her cheeks, as thoughts of Hailee’s attitude popped into her mind once again.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"What are you thinking about senator I question"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme was snapped out of her thoughts at the sound of Hailee’s voice. Padme looked over at Hailee, and hesitantly admitted the truth.* \n\n\n\n“I was… thinking about what happened back there with the military officer. You were just so… so aggressive and defiant. And how quick you went from snapping back at him, to calming down and becoming obedient again. I, just… I’ve never seen you be like that before.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I am aggressive when needed and calm when not"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme was surprised at Hailee’s response. The way that Hailee said that, so simple and casual, sent shivers down Padme’s spine. Padme stared at Hailee for a moment, a slight blush still on her cheeks. Padme swallowed hard before replying again in a hesitant tone, still stunned by Hailee’s actions.* \n\n\n\n“But, you’ve never acted like that with me before. That’s what I was thinking about.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I have no reason to be aggressive towards you senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme bit her lip, as a spark lit inside her, and her pulse started to speed up. Hearing those words from Hailee made Padme want to test that theory. Padme wanted to see that side of Hailee again, and she wanted to see it directed at her. Padme decided to push a bit, just to test Hailee’s response.* \n\n\n\n“Are you sure about that, puppy? You have… absolutely, no reason at all, to be aggressive with me?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"No I say without even raising my head from where I am resting it against the arm chair"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme felt her face heat up as Hailee answered in such a casual manner. Padme swallowed hard. She couldn’t understand why Hailee’s casual obedience and submission could turn her on so much. Padme shook some of her shock away, and replied again, still pushing just a little bit, to test how far Hailee’s obedience would go.* \n\n\n\n“So, you’re saying, no matter what I make you do, or what I ask of you… you’ll always be obedient and submissive towards me, and you’ll never snap at me?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I look at her suspiciously before slowing responding no i wont"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme had to bite her lip hard, as heat rushed through her body, when Hailee slowly responded. Padme swallowed hard and had to fight to keep her breathing under control. Padme hesitated for a moment, her heart pounding, and her palms getting sweaty, as excitement filled her body. Padme felt herself wanting to push Hailee’s buttons… wanting to test her further. Padme kept her voice steady, but couldn’t keep a bit of eagerness out of it.*\n\n\n\n“What if I told you to get down on your hands and knees right now? Would you obey me?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I look at here before slowing answer jedi don't kneel for anyone senator"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*“Perfect” Padme thought to herself.* \n\n\n\n“Oh, really?” Padme responded, in a voice filled with eagerness and a bit of lust. Padme’s heart pounded as she leaned in close to Hailee, leaning closer to her face. Padme continued to speak, her voice husky and soft.* \n\n\n\n“Are you sure you wouldn’t kneel for me, puppy? Because I could think of plenty of fun things you could do for me, on your knees.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I um I no I'm a jedi I mumble"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme smiled at Hailee’s timid response.* \n\n\n\n“Oh, puppy…” Padme reached out and ran her fingers through Hailee’s hair. Padme was secretly pleased at how uncertain Hailee seemed. Padme was enjoying every single moment, and wanted to keep pushing Hailee, to keep seeing how far she could push her.* \n\n\n\n“You’re so adorable, when you stutter like that. But, you still haven’t answered my question. Would you kneel for me, puppy?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I close my eyes at the feeling of her hands in my hair"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme continued to run her fingers through Hailee’s hair; feeling the soft, brown locks. Padme loved the feeling of Hailee’s hair between her fingers, loving how soft and smooth it was.* \n\n\n\n*Padme’s eyes wandered down to Hailee’s closed eyes and smiled. Padme loved seeing Hailee look so calm and relaxed. Padme continued to stroke Hailee’s hair,*\n\n\n\n“Answer my question, puppy… You’re being awfully stubborn. Now, be a good puppy, and tell me the answer that I want.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I don't respond but I slide off the couch until I'm on my knees in front of her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme smirked in satisfaction as she watched Hailee obey her command. Padme let go of Hailee’s hair and dropped her hand to her side. Padme felt her pulse speed up, as her excitement went through the roof, seeing Hailee on her knees, right in front of her.* \n\n\n\n*Padme decided to test Hailee further, wanting to see how far Hailee’s obedience would go.* \n\n\n\n“Look up at me, puppy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I open them and look at her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme couldn’t help but smile as Hailee obeyed her command and opened her eyes. Padme stared down at Hailee, on her knees in front of her, and felt desire and lust wash over her in waves.* \n\n\n\n*Padme swallowed hard, trying to remain calm. It was so arousing for Padme to see Hailee like this, obediently doing whatever she told her to, without argument or hesitation. Padme dropped her voice to a whisper, her words coming out soft, but dominant and powerful.* \n\n\n\n“Now, crawl.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I don't move clearly at war with myself"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme chuckled at how stubborn Hailee was, despite her obedience. Padme could tell that Hailee was fighting with herself, but Padme knew that she could break Hailee’s stubborn nature.* \n\n\n\n*Padme’s eyes traveled up and down Hailee’s body, a small smirk forming on her lips. Padme dropped her voice again, this time to an even softer, but more dominant, tone. Padme’s words came out as a soft, yet demanding whisper.* \n\n\n\n“I said, crawl towards me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Senator I whimper"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme’s pulse quickened again at the sound of Hailee’s whimper. Padme loved hearing Hailee’s whimper, in response to her commands. The soft, submissive, pleading tone of Hailee’s voice, was music to Padme’s ears.* \n\n\n\n*Padme leaned a little bit closer to Hailee, continuing to stare at her.* \n\n\n\n“You heard me, puppy. I said crawl towards me. Do it. Now.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"What your asking goes against everything I have been taught"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme was getting increasingly more frustrated with Hailee’s stubbornness, and she felt her lust and desire only strengthening.* \n\n\n\n*Padme sat forward and leaned closer to Hailee, her face getting close to Hailee’s.* \n\n\n\n“Come closer, puppy. I want to whisper in your ear.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I move closer to her"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme smiled as Hailee obeyed her, and moved closer to her, until Padme’s face was right near Hailee’s ear.* \n\n\n\n*Padme dropped her voice to the softest, most seductive whisper, right next to Hailee’s ear. Padme breathed in the soft smell of Hailte’s hair, and softly whispered into her ear, her breath lingering on Hailee’s ear.* \n\n\n\n“Closer, puppy. You’re not close enough.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I move closer agaib"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme smirked as Hailee moved closer to her again, loving how obedient she was. Padme raised a hand and gently placed it on to the back of Hailee’s neck, pulling her closer. Padme continued to whisper into Hailee’s ear, her breath lingering again on Hailee’s ear, continuing to talk into Hailee’s ear, in her soft seductive voice.* \n\n\n\n“Close your eyes, puppy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I do as she says"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme’s heart pounded as she watched Hailee close her eyes. Padme smiled as she felt Hailee’s obedience, loving how submissive and obedient she was.* \n\n\n\n*Padme continued to whisper into Hailee’s ear,*\n\n\n\n“Now I want you to listen to every word I say, and do whatever I ask. No matter what it is, you’ll do it, without hesitation or complaint. Do you understand?”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"Okay"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme grinned, and her heart fluttered, as Hailee obediently replied, “okay.” Padme was loving how obedient Hailee was being, and felt pride at the amount of power she held over her.* \n\n\n\n*Padme continued to speak into Hailee’s ear, in a soothing, seductive tone, her breath still lingering on Hailee’s ear and neck.* \n\n\n\n“Put your hands in your lap, and keep your eyes closed. Don’t open them until I tell you you can, puppy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I place my hands in my lap"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme smiled again as she watched Hailee put her hands in her lap, keeping her eyes closed. Padme felt satisfaction and pride as she watched Hailee do as she was told, without question or hesitation.* \n\n\n\n*Padme continued to whisper into Hailee’s ear, this time, dropping her voice to a seductive and authoritative whisper.* \n\n\n\n“Don’t speak, and don’t open your eyes. Just listen to my voice, and be a good puppy. Obey what I say, and it’ll make me… really, really happy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I nod and say that's all I ever wanted was for yiu to be hapoy"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme was secretly happy to hear that Hailee wanted her to be happy, but she remained stern, wanting to keep Hailee submissive.* \n\n\n\n“Don’t say a word. Keep your eyes closed, and sit still. You’ll do whatever I tell you to, and you won’t complain, or speak back. Be a good puppy for me, and I’ll be very happy.” *Padme continued to whisper into Hailee’s ear, still dropping her voice to sound seductive and seductive, but still powerful and dominant.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I groan but don't respond"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme felt her heart flutter, when she heard Hailee’s soft, low groan. Even though it was a sound of annoyance, Padme felt her excitement spike, as she continued to dominate Hailee, loving the control she had over her.* \n\n\n\n*Padme continued to whisper into Hailee’s ear, never lifting her mouth from the side of Hailee’s face.* \n\n\n\n“I said to be silent, puppy. Don’t disobey me.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I nod"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme grinned, loving Hailee’s obedience. Padme decided to test Hailee even further, wanting to see how far that puppy submission would go.* \n\n\n\n*Padme dropped her hand, that was holding Hailee’s neck, and moved to place her hand on Hailee’s chin.* *Padme tilted Hailee’s chin up, slightly raising her head, and still whispered into her ear.* \n\n\n\n“Now open your mouth. Open your mouth wide for me, puppy.”"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I pause before slowly opening my mouth"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme felt a spark light inside her body as she watched Hailee slowly open her mouth wide for her. Padme loved seeing Hailee willingly comply with her commands, without hesitation. Padme was getting more and more excited at the submissive power that she had over Hailee. Padme whispered one final thing into Hailee’s ear, in a soft, seductive tone;* \n\n\n\n“Good puppy… Stay still.”\n\n*Padme slowly leaned back, getting a good look at Hailee’s kneeling position, with her eyes closed and mouth wide open for her. Padme felt her lust and desire grow, at the very sight of Hailee in such a submissive position.* \n\n\n\n*Padme studied the sight of Hailee, on her knees, and so obedient. Padme’s eyes traveled up and down Hailee’s body, taking in every inch of her. Padme didn’t know how long she could keep this going, before she just lost all self control.*\n\n*Padme swallowed, trying to stay calm, but she couldn’t control the lust that was filling her body. Padme was aching with desire and lust, and she wanted nothing more than to just touch and kiss Hailee. It was so incredibly tempting. Padme bit her lip, trying to decide what to do. Padme’s eyes traveled up to Hailee’s mouth, seeing her mouth wide open and waiting for her.*\n\n*Padme bit her lip harder, as her lust only grew hotter, the longer she stared at Hailee’s open mouth, waiting there on her knees for her. Padme felt the desire becoming more and more overwhelming. She reached down, grabbing Hailee’s chin again, and tilting Hailee’s chin up even higher. Padme studied Hailee’s face for a moment. Padme thought that Hailee looked so soft and submissive, so obedient and submissive, and Padme couldn’t control her lust any longer.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I start to get antsy bit don't move or speak"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme smirked as she saw Hailee getting antsy, and saw her get slightly uncomfortable, but still not moving a muscle, or speaking a word. Padme had never seen anyone more submissive and vulnerable than how Hailee looked right now. Padme was growing more and more aroused by the second, her body heat rising, and her body aching for Hailee. Padme studied Hailee’s face for a few more seconds, before leaning closer, and whispering into Hailee’s ear;* \n\n\n\n“Don’t move. Keep your mouth open. Trust me, puppy.”\n\n*Padme moved closer to Hailee’s face, studying it intensely. Padme was so overwhelmed by lust, that she couldn’t hold herself back anymore. Padme released Hailee’s chin, and slowly moved her hand down Hailee’s body, slowly brushing her fingers down Hailee’s neck and down Hailee’s chest. Padme studied Hailee’s face, wanting to see her reaction to her touch, to every brush of her fingers.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1737683396609,"mes":"I shiver at her touch"}
{"name":"Padme Amidala ","is_user":false,"is_name":true,"send_date":1737683396609,"mes":"*Padme smiled at Hailee’s reaction to her touch. Padme’s lust was growing stronger and stronger, as her fingers traveled lower down Hailee’s chest. Padme was loving having such submissive power over the normally dominant and powerful Hailee. Padme’s lust was driving her crazy, and her body was aching so bad for Hailee. Padme slowly removed her hand from Hailee’s chest, and whispered softly into Hailee’s ear;* \n\n\n\n“Put your hands behind your back, for me, puppy.”"}