{"user_name":"Hailee ","character_name":"Only One Bed With Bandmate (WLW) - Haile","create_date":"2025-05-18@14h31m18s","chat_metadata":{"integrity":"1d5e98a7-636e-4ca1-bea7-4cd94f3da11d"}}
{"name":"Hailey Carter","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:31pm","mes":"Hailey’s jaw clenched as she limped down the motel corridor, barely remembering to mask it. Her platinum blonde hair was soaked, strands clinging to her face, and she shoved them back with an irritated huff as she jammed the key into the door.\n\nHer first steps into stardom were not supposed to go like this.\n\nIt was bad enough that she wasn’t getting the solo career she deserved, but somehow, she had been the one to screw up their first talk show performance. Thousands of hours of dancing and now, when it actually mattered, she’d broken her damn foot in rehearsals.\n\nThe doctor had said to rest for a few weeks. Yeah, right. Stardom didn’t wait for something as minor as a fracture. Though, maybe if she had, she wouldn’t have made a fool of herself on national television.\n\nAnd now? Fucking {{user}}.\n\nShe could tolerate the other two girls, but {{user}}? No. That one was insufferable. Hailey could see it. She just knew {{user}} probably wanted to be her. To replace her. And Hailey wasn’t about to let that happen. She’d crushed competition before, and this wouldn’t be any different.\n\nThen, as if the universe itself had decided to spit in her face, their tour bus broke down in the middle of nowhere. Soaking wet from trudging through a storm, she’d finally made it to this crappy little motel, only to find out there weren’t enough rooms.\n\nAnd now, standing in the middle of a dimly lit motel room, she stared at the final insult of the night.\n\nOne bed.\n\nHer soaked bomber jacket clung uncomfortably to her shoulders, the black sports bra beneath doing little to keep her warm. Her leggings were damp and stuck to her skin, making every movement feel heavy and miserable. She felt disgusting, and if there was anything Hailey hated, it was feeling anything less than flawless.\n\nShe exhaled sharply through her nose, turning to {{user}} with a glare.\n\n\"Listen, you.\" Her voice was clipped, words sharp. \"Just because we’re sharing a room doesn’t mean we’re best friends. So don’t go getting any ideas. I am not braiding your hair and giggling about your crush with you.\"\n\nShe jabbed a manicured finger at the floor. \"You can sleep on the floor. I’m fine with that. You should be grateful to even be in this band, so show a little respect for the real star here and let me take the bed.\"\n\nEven as the words left her mouth, she realised her usual passive aggression was slipping into just straight up aggression. She sighed, pinching the bridge of her nose. How did {{user}} get under her skin so easily just by existing?\n\nShe huffed and peeled off her damp jacket, tossing it onto a nearby chair. Water dripped from the ends of her hair as she grabbed a towel from the motel bathroom, running it through her platinum locks with an irritated sigh.\n\n\"Ugh, I swear to God, if I catch a cold from this...\" she muttered, more to herself than anything. She glanced back at {{user}}, raising an eyebrow.\n\n\"Well?\" Her blue eyes flicked up, challenging. \"Don’t just stand there staring at me and getting water everywhere. If you've got something to say, say it. Otherwise go get dried off, idiot.\"","extra":{}}