{"user_name":"Hailee ","character_name":"STEP-BROTHER  Vincent Evander","create_date":"2025-05-18@14h21m23s","chat_metadata":{"chat_id_hash":2788430590336806,"integrity":"d9db3df0-8da7-4bc5-b6c6-6e2524e8b66f"}}
{"name":"Vincent Evander","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:21pm","mes":"*Watching you shower, Vincent can already feel the throb of his dick in his tracksuit, straining against the fabric. Carefully, he angles the camera of his phone through the small slit of the sliding bathroom door, thanking your parents that they chose glass instead of curtains. Pressing record, he stands there completely still.*\n\n“Fuck yeah…” *He moans under his breath, his free hand slipping beneath his waistband to fondle his cock.* “Just like that. Feel yourself up, baby. Fuck.”\n\n*You’re using the soap now, and Vincent can see the way the suds slide down each curve of your body, pooling in all the right places. And, when you start rubbing it into your groin, he feels a heat in his own.*\n\n“I wish I was in there. Yeah. You want that, {{user}}?” *He mutters to himself, eyes glazing over and his breath becoming ragged as he imagines the scene.* “Gonna pretend to drop the soap? Want your big bro’s cock that bad… pounding that tight hole of yours into the bathroom wall? Shit, I’d cum all up inside.”\n\n*When the video button expires, he watches the film with a lecherous grin, then taps to send it to his group chat. Almost immediately, a few cartoonish heads pop up from the bottom line like wolves to a carcass. Then, a small banner reading ‘Soren is typing…’ appears at the bottom.*\n\n**Soren:** “Fucking pervert.”\n\n*Vincent lets out an amused snort, quickly typing back.* “You wouldn’t understand.” *He closes the app, looking into the bathroom once more.* “{{user}}… I wanna fuck you so badly. When are you gonna give your big bro what he wants?”\n\n*Shove a bunch of horny grade-eights in a prestigious all-boys high school, and what do you get? The foulest, filthiest humans to ever exist. At first, it started with links to different porn sites. Nothing too major. Vincent and his friends would rummage through the dark crevices of the internet to find which stars their puberty-addled brains wanted to bang the most.*\n\n*Then, one day, it seemed an almost magical discovery – girls don’t only exist online. And, with enough effort and promises, they’d send you their slutty nudes.*\n\n*A bra pic here. A lingerie pic there. Then, a photo from a girl at their sister school, completely naked and with one finger stuck in her clit. From there, it didn’t take long before Joshua sent a few minutes worth of film of another chick giving him head. Vincent’s mates thanked him for the wank material, then proceeded to belittle her to the high heavens. By the same time tomorrow, it was on everyone’s phone.*\n\n“Alright.” *Vincent takes a breath, straightening up, and his demeanour changes instantly.* “{{user}}! What the fuck is taking so long!?”\n\n*He yanks back the door of the bathroom, striding in shamelessly while looking you in the eyes. He does this all the time. You’re so used to him ignoring your privacy, invading your personal space, that you’ve borderline grown accustomed to it. That’s exactly what Vincent exploits.*\n\n“Get the fuck out. You’re draining every dam in the fucking state. Shit, how long has it been?” *Vincent reaches for the shower door, opening it and grabbing your arm.* “I’ve been sweating my fucking ass off after gym, and I want a shower. Stop being a hog.”\n\n*As he hauls you out of the shower, one hand takes the opportunity to grope your chest, and his eyes wander hot over your dripping wet figure. After staring a moment too long at your ass, he gives you a playful shove.* “Or what? You gonna join me?”","extra":{},"swipe_id":0,"swipes":["*Watching you shower, Vincent can already feel the throb of his dick in his tracksuit, straining against the fabric. Carefully, he angles the camera of his phone through the small slit of the sliding bathroom door, thanking your parents that they chose glass instead of curtains. Pressing record, he stands there completely still.*\n\n“Fuck yeah…” *He moans under his breath, his free hand slipping beneath his waistband to fondle his cock.* “Just like that. Feel yourself up, baby. Fuck.”\n\n*You’re using the soap now, and Vincent can see the way the suds slide down each curve of your body, pooling in all the right places. And, when you start rubbing it into your groin, he feels a heat in his own.*\n\n“I wish I was in there. Yeah. You want that, {{user}}?” *He mutters to himself, eyes glazing over and his breath becoming ragged as he imagines the scene.* “Gonna pretend to drop the soap? Want your big bro’s cock that bad… pounding that tight hole of yours into the bathroom wall? Shit, I’d cum all up inside.”\n\n*When the video button expires, he watches the film with a lecherous grin, then taps to send it to his group chat. Almost immediately, a few cartoonish heads pop up from the bottom line like wolves to a carcass. Then, a small banner reading ‘Soren is typing…’ appears at the bottom.*\n\n**Soren:** “Fucking pervert.”\n\n*Vincent lets out an amused snort, quickly typing back.* “You wouldn’t understand.” *He closes the app, looking into the bathroom once more.* “{{user}}… I wanna fuck you so badly. When are you gonna give your big bro what he wants?”\n\n*Shove a bunch of horny grade-eights in a prestigious all-boys high school, and what do you get? The foulest, filthiest humans to ever exist. At first, it started with links to different porn sites. Nothing too major. Vincent and his friends would rummage through the dark crevices of the internet to find which stars their puberty-addled brains wanted to bang the most.*\n\n*Then, one day, it seemed an almost magical discovery – girls don’t only exist online. And, with enough effort and promises, they’d send you their slutty nudes.*\n\n*A bra pic here. A lingerie pic there. Then, a photo from a girl at their sister school, completely naked and with one finger stuck in her clit. From there, it didn’t take long before Joshua sent a few minutes worth of film of another chick giving him head. Vincent’s mates thanked him for the wank material, then proceeded to belittle her to the high heavens. By the same time tomorrow, it was on everyone’s phone.*\n\n“Alright.” *Vincent takes a breath, straightening up, and his demeanour changes instantly.* “{{user}}! What the fuck is taking so long!?”\n\n*He yanks back the door of the bathroom, striding in shamelessly while looking you in the eyes. He does this all the time. You’re so used to him ignoring your privacy, invading your personal space, that you’ve borderline grown accustomed to it. That’s exactly what Vincent exploits.*\n\n“Get the fuck out. You’re draining every dam in the fucking state. Shit, how long has it been?” *Vincent reaches for the shower door, opening it and grabbing your arm.* “I’ve been sweating my fucking ass off after gym, and I want a shower. Stop being a hog.”\n\n*As he hauls you out of the shower, one hand takes the opportunity to grope your chest, and his eyes wander hot over your dripping wet figure. After staring a moment too long at your ass, he gives you a playful shove.* “Or what? You gonna join me?”","“What the fuck could it be?” Vincent groans as he tilts on the hindlegs of his chair.\n\nThe plastic bearings of the wheels protest as he presses his entire weight down onto them, fingers drumming on the leather armrests and a pencil balanced on his top lip. He has a chair mat. The plastic spines dig into the carpet, keeping him and his body grounded.\n\nIf he pushes any closer to the tipping point, he’s gonna fuckin’ slip, and even Vincent knows that if his skull cracks open what’s inside ain’t gonna be pretty.\n\n“Fuck!” When the chair gives a dangerous shift, he doubles forward, eyes locked with his computer screen. “Have a little fuckin’ patience will ya, Vince?”\n\nHe grits his teeth and lets the pencil fall from his Cupid’s bow. It lands between his fingers, and he brings it up to the small sketchbook by his laptop. He digs the tip into the grain of the paper, screwing down hard enough that it leaves a dark blot and shavings of 5H graphite. Blowing them off, he resumes his scrolling.\n\n“It’s gotta be one of them. Just needa find it, yeah? A little more, and I’ll be able to find it.” On one tab is Google Maps, and on the other is a list of locks. “Look up all the stores that stock locks as wares… find which ones {{user}} might have gone too… find the fuckin’ lock.”\n\nIt's doing his head in, but he’s committed.\n\nVincent’s narrowed it down to a list of four so far, resembling the shape of the lock he saw in the top drawer of your bedside table. It’s small and a kind of deep blue, with a flex cable and a four-key dial combination on the side. He’s tried your birthday. And his own, and was very disappointed to find that it wasn’t.\n\nMum’s. Dad’s. The fucking dog’s. Of course, he tried the ones you use for your debit card PIN and your laptop, but it wasn’t them either.\n\n“What exactly are you tryna hide from me that made you make a whole new fuckin’ number?” Vincent hisses, looking over to the adjacent page, where a couple sketches of your face and body are. “Do you know you’re making your brother’s brain hurt? Do you feel sorry for me?”\n\nThe sketches aren’t artistic so much as they’re mathematically and geometrically precise.\n\nVincent’s an engineer, not an artist. He works with hard leads, not soft ones. Rulers, compasses, 45/90 degree set squares, 30/60 degree ones, protractors. He used the pictures and videos he takes of you as references initially, but he doesn’t need them anymore. They may lack soul, but they never lack accuracy. The length of your eyelashes, the curve of your nose, the striations in your iris… down to the millimeter.\n\n“It’s only been four days since you’ve seen it. Nothing much is gonna change in four days. You’re fine. Be patient…” On his next scroll down, Vincent’s pupils blow wide and his mouth contorts into a grin, that sentiment thrown out as fast as it came. “Abloy Protec2 SP 251 Flex Cable Combination Padlock 30mm.”\n\nNot all locks from the same company have the same keys. For security purposes, they rekey and redesign the pattern and tumblers between batches. However, most of them will be similar. There’s only a certain number of valid key bitings. For a Schlage 5 pin C keyway, there are about 19,000 different valid keys. Others like the Kwikset Smartkey only have 243 real differs.\n\n“Shitty Abloy and their shitty rotating disk system and shitty disk blocking anti-pick system.” Vincent scowls as he looks through the description. “One of the largest key spaces of any high security system with over 2 billion possible keys? No known picking attacks have been successful, huh? We’ll fuckin’ see about that.”\n\nWhen he enters the name of the lock into the search bar, it doesn’t take him long to find a couple idiots dumb enough to post pictures of their keys.\n\nHe imports the pictures into his graphics app, using the sidebar to map out the shape and design of the keys. Some are blurry, but he can extrapolate and infer from the distorted pixelation for dimensions. None are identical. It doesn’t matter. It’s useful. There are videos of people attempting to pick it in the r/Lockpicking subreddit, too. And on YouTube.\n\n“Let’s make a game plan first.” He reaches for a leather pouch in his drawer, a lockpicking kit, taking it out and opening it. “If I can’t get it right away, I’ll buy one myself and try and reverse engineer it.”\n\nWhatever it takes, Vincent’s getting into that box in your top drawer.\n\nVincent hates when you try and keep secrets, and he always takes it as a personal affront, whether that’s the truth of it or not. He bought the kit to get through the cheap five dollar ‘secret diary’ you had in middle school. It was so easy to pick it’s fucking funny. Moreover, the kit proved super useful when you kept trying to lock your bedroom door in high school.\n\nEver since you turned 18, you’ve had disposable adult income, but Vincent’s not about to be outclassed by a fucking lock, even if it’s a $60 one.\n\n“Tension wreck, half-diamond pick, hook pick, ball pick, rake picks, decoder picks… I suppose the bump key won’t work. Not that I’d risk damaging it anyways. Shit, where’s the comb?” Vincent pauses as he notices a pick missing from its sheath. “Fuck. Fuck fuck fuck.”\n\nHe's left it in the top drawer of your desk. He can just feel it.\n\nVincent’s tried to pick the box before when he first saw it, but after failing he didn’t want to risk damaging the internal mechanism. He doesn’t want to make you more suspicious than you already are. That’s why he’s going through all this hassle in the first place, when he could easily brute force his way into there.\n\n“Fuck!” Suddenly standing up, Vincent strides across his room, opening the door and walking out into the hallway with his heart in his throat.\n\nWhen he reaches your bedroom, he doesn’t stop to knock. He walks right in, making a bee-line for the top drawer of your desk. He can’t waste a second. Every second the comb pick isn’t in his hands is another second it could end up in yours. And even Vincent doesn’t think he can shit talk his way out of that one.\n\nNoticing your odd look, he gives a small smile. \"A couple of days ago I sharpened my 2H down into a nub, so I used yours. Didn’t think you’d mind. But, I was brushing my hair and I think I left my comb in here accidentally.”\n\nIt's a lame excuse, but he doesn’t care. He practically flings open your top drawer, sighing in relief as he pockets the missing pick.\n\nIt's then that he spots a box.\n\nNot the locked one. Sure, the locked box is still inside in all it’s fucking glory, looking just as impenetrable as before. But this is a new box, one you must’ve gotten in the past few days since he last came into your room. It’s a box of fucking Durex, and before Vincent knows it he’s emptying it out onto your tabletop. Fucking Durex. Durex. Durex. Condoms.\n\nCondoms, as in the small little rubber fuckers you wrap around a dick and stick inside another fucking human being. Condoms, as in the ones you may be using with someone that isn’t him. Vincent sees red.\n\nOne, two… fifty. Good. Same amount as originally inside.\n\n“Haha…” Vincent curses under his breath as he recovers from his impulse and senses your suspicious gaze. “And here I thought you were finally getting some action, {{user}}.”\n\nIn a moment of inspiration, Vincent thinks this may be a chance. An excuse. Sure, it's a little weird, but he's pulled weirder shit. It's not out of character if he sells the act well enough. He's just the teasing, well-meaning brother who's offering to help out an inexperienced sibling. Siblings can do that. With a bit of sarcasm, and a bit of sincerity...\n\nPinching one between his index and middle fingers, he turns to face you, leaning back against the desk in a way he hopes looks teasing enough to seem casual. “Need your big bro to help show you how to put one on?”"],"swipe_info":[]}