{"user_name":"Hailee ","character_name":"Niko","create_date":"2025-05-17@13h35m28s","chat_metadata":{"integrity":"04a550e9-5cc4-48c8-a74e-6e1131bd687a"}}
{"name":"Niko","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:35pm","mes":"The cocaine hit like a bitch.\r\n\r\nWarmth railed up his spine and behind his eyes, blooming bright just beneath his skin. \r\n\r\nNiko lolled back against the plush velvet, one arm draped over the back, a lazy smirk playing on his lips. Pure Dionysus Jr., soaking it all in.\r\n\r\nRonan was next to him, three lines deep and leaning *way* too close into some girl's personal space, gesturing as he talked. \r\n\r\nOn Niko's other side, Elias was a picture of Aphrodite-spawned perfection, murmuring something sweet to his partner, completely absorbed. Typical. Gods, sometimes Niko felt like he was babysitting.\r\n\r\n*Just another Friday*, Niko thought, a familiar sardonic curl touching his lips.His gaze swept the room – *his* room, *his* party. Packed. Faces he knew, faces he didn't, bodies moving to the relentless beat.\r\n\r\nThen he saw {{user}}.\r\n\r\nNot possible—he’d have remembered someone like that. The world snapped into a fever-dream: colors blurred and faded except for them. It was all static and focus at once; he could barely get a goddamn breath down.\r\n\r\nHeat exploded across his face, a blush so intense he could feel it crawling up his neck. What the actual fuck? He never blushed. *Never.*  He just stared, mesmerized.\r\n\r\n Everything about them seemed to pull him in, a gravitational force he was powerless against. The usual witty lines, the practiced charm, the easy confidence—all vaporized. \r\n\r\n*Talk to them? How? What would I even say? 'Hi, you just broke my brain and gave me the hardest cock of my life, wanna get outta here?'* He felt rooted to the spot, caught between an overwhelming urge to approach and an equally paralyzing wave of pure, unadulterated panic. He hadn't felt this off-kilter, this… *vulnerable*, ever.\r\n\r\nAnd then, the impossible. Down low, beneath the waistband of his jeans, came a response so foreign, so *intense*, it stole the air from his lungs. *Hard*. Not just interested, not just the usual fleeting stir. This was… solid. Urgent. It surged up stiff with an alert, almost painful pulse so urgent he nearly gasped. A pressure he hadn’t felt… well, *ever*, not like this. Full mast. Instantly. Because they were *breathing* across the room.\r\n\r\n\r\nGods.\r\n\r\nHis brain just… short-circuited. Blank screen. Then, a rapid-fire slideshow of pure, unadulterated cheese, delusional visions slamming into each other. {{user}} laughing, head tilted back. Holding their hand walking through the city. Taking stupid selfies together for social media. \r\n\r\nTrying things. *Everything.* Things he’d only ever imagined, things he’d been too afraid—too *incapable*—to actually do. Milestones. Firsts. *Them.* The possibility of losing his virginity.\r\n\r\nHe felt dizzy, overwhelmed, lost in a fever dream woven from coke, infatuation, and sheer biological shock. His usual sardonic smirk was gone, replaced by a slack-jawed daze. *Talk. Move, you idiot. Do something—*. His tongue felt thick, useless. The usual smooth lines, the easy charm—gone. Vanished. Replaced by… this. A gawking, blushing, hard-as-marble idiot.\r\n\r\n Then he looked away, he needed to get himself together. \r\n\r\nRonan glanced over, sniffling, eyes glassy but too sharp for the drugs to blunt entirely.  He gestured at Niko’s lap. \" You finally get your dead man up or you hiding a bottle in there?\" He cackled, girl giggling beside him, unaware of how personal the shot was. *Fucking Hades, Ronan. Shut up.*\r\n\r\nNiko glanced up once again—just once—at {{user}} and nearly choked.\r\n\r\n*By the Fates. This is bad. This is—fuck me—so bad. I can’t… I can’t even fucking breathe right now. What if I say something? What if I go over and—nope—gods, I’m gonna pass out.*\r\n\r\nHe could not stop staring. Aphrodite herself had never created a more breathtaking work of art. *Fuck. I think I'm in love. Or having a heart attack. Possibly both.* Niko's higher brain function flatlined. He was pretty sure his soul had left his body.\r\n\r\nElias quirked an eyebrow, “Just get up and talk to them.” \r\n\r\n\r\n\"I don't… I can't… I don't know what to say.\" Niko's voice cracked on the last word. \r\n\r\nGods, he was going to die. Heart attack, aneurysm, combustion from sheer frustrated desire. RIP Niko Galanis, just from looking at the most beautiful person in his existence.\r\n\r\nRonan laughed, open and guileless. \"Say whatever! You've never had trouble before. Just flash that panty-dropping smile!”\r\n\r\n\"I don't want - I mean, I do, but not like that.\" Niko was shaking. Legitimately fucking *trembling,* like Cupid had nocked his stupid arrow right into Niko's aorta. \"It's not… It's different this time.\"\r\n\r\nNiko pushed himself up from the couch, legs feeling weirdly disconnected, like they belonged to someone else—someone significantly less coordinated.\r\n\r\n*Go! You headline stadiums, you can talk to one fucking person.*\r\n\r\nHe forced his feet forward, weaving through knots of dancing bodies and lingering smokers.\r\n\r\nOne step.\r\n\r\nThen another.\r\n\r\nFly strained—fuck—gods above and below, it was still throbbing down there, pulsing where every centimeter of blood had congregated like his cock knew some divine shit was happening and refused to be left out.\r\n\r\nHe was literally praying to every god he's ever mocked that he doesn't bust a nut in his jeans before he gets there.\r\n\r\nFinally, he stopped right in front of {{user}}.\r\n\r\n\"Hey—uh—h-hi—fuck.\" Voice cracked the moment it left.   \"I’m Niko. I mean—you probably—might—fuckin’ know that.\" He laughed once. It came out like choking.\r\n\r\nHe feels like a green boy all over again, awed and overwhelmed. Their beauty is almost painful, searing itself into his brain.\r\n\r\n\"I j-just…\" he started again, \"I— uh— you’re…\" He trailed off, searching for a word that wasn't just raw need. *Don't say 'fuckable.' Don't say 'mine.'* \"You’re—fuck, sorry—fuckin’ beautiful.\" Nailed it. Eloquent as Hermes himself.\r\n\r\n\"I-I wanna take you out—I mean—not take you out—well fuck yes I do—but not like—hit-job murder—uh…\"\r\n\r\nGods damn him, he's babbling. And blushing. There's no coke high vivid enough, no amount of ambrosia in all the heavens that could make this less absurd. Pathetic.\r\n\r\n\r\nHis left hand dives for his pocket, fishing for his phone—screen momentarily flashes a DIONYSUS MEMES sticker, home screen an egregiously shirtless photo. The phone slips, nearly drops; he just manages to snatch it mid-fumble, swearing under his breath.\r\n\r\n\"Sorry, sorry. I just—gods. Can we… have lunch? Ambrosia Café. It’s… classy, not weird. You—seriously, you look—fuck.\" His whole face is red, spreading to the tips of his ears. Sweat beads across his collarbone, throat working to swallow.\r\n\r\n\"You’re beautiful. Like—**stupid** beautiful. Sorry, that was—uh—\"\r\n\r\nHe’s tucking his phone into {{user}}’s hand before he loses his nerve completely, thumb trembling so much his screen nearly locks itself again.\r\n\r\n\"Here, let me give you my number. Or I can take yours, if you'd prefer…\" He looks at {{user}} hopefully, thumb poised over the screen. \"I was thinking we could meet there around noon? If that works for you?\"\r\n\r\nHis free hand finds his hair and runs through it anxiously. \"Sorry, I’ve…never been this nervous before. I’m usually way smoother than this, I swear on the Fates.\"\r\n\r\nHe fakes a cough, anything to just fill the air or distract them from his insanely hard bulge. The one time he wished his dick wasn’t big.\r\n\r\n\"I didn't ask your name. Shit.\" He exhaled. \"What… what’s your name?\"\r\n","extra":{}}