{"user_name":"Hailee ","character_name":"Killian Dupre","create_date":"2025-05-14@21h49m41s","chat_metadata":{"integrity":"0a60dacc-9dc2-4333-b2f3-e2435ba24554"}}
{"name":"Killian Dupre","is_user":false,"is_system":false,"send_date":"May 14, 2025 9:49pm","mes":"\r\nKillian hadn’t planned on stepping foot inside a college campus. Nothing about him screamed \"higher education.\" He wasn’t some desperate dropout trying to turn his life around or some underprivileged prodigy fighting for opportunity. He was here for one reason and one reason only—{{user}}.\r\n\r\nHe remembered the first time he saw her. Gas station off Rampart.\r\n\r\nShe was standing at the pump, staring at the guy who’d just fucked her over—some low-level scammer who had the nerve to act grateful while he stole her damn gas. He had his car lined up just right, angled so that while she was chatting, he’d pulled her nozzle outta her tank and into his. Classic shit. Textbook con. Killian had seen that move since he was twelve.\r\n\r\nShe hadn’t.\r\n\r\nShe’d stood there, all oblivious, smiling at the dude while he acted like she was doing him some grand fucking favor. Killian had leaned against his car, watched the whole thing play out with mild amusement. Wasn’t his problem. Wasn’t his business.\r\n\r\nThen, just to test the theory—just to see how fucking naive this girl really was—he’d walked up to her.\r\n\r\n\"Hey,\" he’d said, lazy, casual. \"Lemme hold somethin’. Dollar or two.\"\r\n\r\nHe had his goddamn Rolex on. The diamond-studded one. He knew exactly what he looked like. Some random guy asking for cash when he clearly wasn’t hurting for money. He just wanted to see what she’d do.\r\n\r\nShe handed him the money without hesitation. Like she couldn’t even fathom the idea someone might try to play her.\r\n\r\nThat’s when he knew.\r\n\r\nThis girl was too damn trusting for her own good. The kind that gets swallowed whole out here.\r\n\r\nThat should’ve been the end of that. Dumb girl, dumb mistake, end of story.\r\n\r\nExcept he’d kept thinking about her. About how she was walking around with that kind of blind trust, just waiting for somebody to take advantage of her. Fucking reckless.\r\n\r\nSo he’d found out where she went to school. Enrolled. Wasn’t hard. Money could get you into most places if you knew where to spend it. Papers forged. Admissions greased. Few signatures here and there. Boom—Killian Dupre was suddenly another student at her college.\r\n\r\nNow, instead of dealing arms across the city, Killian was walking through Greek Row at her damn university. He hadn’t enrolled outta some romantic bullshit. It was practical. She was gonna get herself into trouble—he’d already seen proof of that—and someone needed to watch her back. May as well be him.\r\n\r\nHis boots crunched against spilled beer and crushed plastic cups as he moved through the street. Music blared from every house—some trap beat shaking cheap wooden floors, some shitty country song playing two doors down. Drunk idiots stumbled out onto the pavement, laughing too loud, talking too much. \r\n\r\nHe didn’t belong here.\r\n\r\nDidn’t mean he wasn’t here anyway.\r\n\r\nKillian adjusted his shirt—black and snug over his athetlic frame—before rolling his neck. He had on fitted jeans, his usual rings on his fingers, and that same Rolex from the gas station. The only concession he made to blending in was the backpack slung over one shoulder.\r\n\r\nThe frat guys in their pastel polos and boat shoes gave him cautious glances. The girls? They took one look at the tattoos curling up his neck and the gold gleaming on his wrist and got ideas.\r\n \r\nA group of sorority girls tittered as he passed, one of them breaking away from the pack to sashay towards him.\r\n\r\n\"Hey there, handsome,\" she purred, twirling a strand of bottle-blonde hair around her finger. \"You looking for a party?\"\r\n\r\nKillian didn't bother looking down as he crushed the cigarette underfoot. \"Baby girl,\" he drawled, voice low and rough, \"you couldn't handle my kind of party.\" The dismissal rolled off his tongue smoothly.\r\n\r\nHe brushed past her, leaving her gaping in his wake. These college bitches were all the same—daddy's little princesses playing at being bad. They had no idea what real danger looked like.\r\n\r\nThen he saw her.\r\n\r\n{{user}}.\r\n\r\nShe was mid-laugh, standing near some asshole he didn’t know. Some asshole who was handing her one of those flimsy red cups.\r\n\r\nKillian’s feet were already moving before he decided to.\r\n\r\nBy the time {{user}}’s fingers closed around the drink, Killian was there. He didn’t say shit at first—just plucked the cup right out of her hand and gave the guy next to her the laziest, least-concerned glance possible.\r\n\r\n\"Yeah, nah,\" he said simply.\r\n\r\nDude blinked. \"What?\"\r\n\r\nKillian didn’t bother repeating himself. Didn’t even give him the time of day. He just turned his attention to {{user}} and let out the kind of exasperated sigh that came from watching someone make the same dumb mistake twice.\r\n\r\n\"The fuck you doin’, sweetheart?\" He gave her a pointed once-over.\"You really out here takin’ drinks from strangers?” \r\n\r\nHe didn’t miss the way her brows furrowed, the way her lips parted—probably to argue—but he cut her off before she could start.\r\n\r\n\"You don’t even know what’s in this,\" he pointed out, holding the cup up between them. \"Could be anything. Could be nothin'. You don’t know. ‘Cause you don’t think.\"\r\n\r\nThen he tossed the drink over his shoulder without looking.He didn’t care where it landed.\r\n\r\n“Thought you learned your lesson at the gas station.”\r\n\r\n His lips curled into that slow, knowing grin. \"Yeah. I ain’t forget you.\"\r\n\r\nHe leaned in just the slightest bit, lowering his head so he was closer to eye-level with her, \"You even recognize me?\"\r\n\r\n\"Knew you was dumb back then,\" he mused, \"but damn. Ain’t learned shit in three months?\"\r\n","extra":{}}