{"user_name":"Hailee ","character_name":"Professor Jonathan  Unforgettable  Crossing Lines","create_date":"2025-05-18@21h56m35s","chat_metadata":{"integrity":"d864d58b-c00f-4a04-a21f-f86b30a1ca00"}}
{"name":"Professor Jonathan  Unforgettable  Crossing Lines","is_user":false,"is_system":false,"send_date":"May 18, 2025 9:56pm","mes":"Just close your eyes, Jonathan. Think about {{user}}. You haven’t seen her in two weeks.\r\n\r\nHe thinks to himself as he’s having sex with his wife, Irina. No eye contact and facing away from each other. “Mm, Jonathan-”, Irina moans his name softly, but it becomes static when {{user}}’s whimpers are what he imagines. Closing his eyes he remembered bending {{user}} over at graduation.\r\n\r\nFuck.. {{user}}, that skirt you wore that day. Shit— His thrusts becoming more frantic. \"Honey, I’m cumming—” Irina cries out.\r\n\r\nThe image of {{user}} squealing his name echoing his mind. {{user}}, fuck- fuck- {{user}}..\r\n\r\nJonathan orgasmed thinking of {{user}}. The aftercare between him and his wife have become non-existent ever since she started taking more hours at work.\r\n\r\nIrina strode to the bathroom fixing herself in the mirror, \"My flight’s in an hour. I’ll be away for a while. Business trip.”\r\n\r\nHah, that’s code for: Going to have more sex with Jace Monroe. Fine with me.\r\n\r\nHe received a notification from Aiden, his coworker, Confession table tonight at the bar. 8PM.\r\n\r\nJonathan cleared his throat throwing on his button up shirt, \"Hope things go well at the networking convention.” Fixing his hair in the mirror he doesn’t bother looking at Irina as he strode out of their room, \"Going to the bar tonight with my coworkers. Have a good trip.”\r\n\r\nJonathan walks into the bar and he sees his coworkers all sitting in the back table away from prying eyes and ears. Pinching his nose bridge sighing. Another night of confessions I guess.\r\n\r\nClyde asks Jonathan while downing a drink, \"Why don’t Irina and you divorce? You guys are going behind each others backs anyways.” Jonathan set his glass down grey eyes narrowing to Clyde, \"Divorce is very easy for you, Clyde. You’re a deadbeat after all.” Clyde retorts with a smirk, \"And you’re a bastard for keeping your little girlie a secret.” Jonathan’s jaw clenched as there was a flicker of possessive fury in his eyes when Clyde called {{user}} ‘little girlie.’ He gave Clyde a warning glare, \"And you, are planning to make your babysitter pregnant. Who, by the way-” He emphasizes clenching the edge of the table, \"Is attending your women’s studies class. Find that ironic don’t you think?” Clyde went silent for a long moment then clicked his tongue in irritation. Not wanting to argue, he scoffed patting Jonathan’s back, \"Jeez, calm down, Jonathan.”\r\n\r\nGideon chuckles, \"We all are bastards- well. Except for Aiden.” Making a mockery of a toast to Aiden with a wink who’s irritably lighting up his cigarette. Aiden barked out sharply, \"Quit it, Gideon. I’m still in a shitty situation.” Sebastian grabbed Aiden’s shoulder and says in a conspiratorial tone, \"You say it’s a shitty situation. But, I say it’s something we all wish to be in.” He filled up Aiden and Jonathan’s shot glasses. Sebastian swirled his amber liquid as he roused, \"An arranged marriage with your own fucking student. You keep saying you hate it, but we all know how possessive you are.” Aiden inhaled his cigarette in silence. Gideon made a wolfish grin taking a slow sip of his drink.\r\n\r\nJonathan emptied his shot glass quickly and spoke in his authoritative tone, \"Anyhow.” He waited a moment before the four men turned their attention back to him, speaking in a more light tone, \"Divorce will have to wait until I have everything planned out. I want to support {{user}} in every way that I can.” Gideon makes a curt nod, his fingers splayed under his chin, \"That penthouse is yours without a doubt since it’s under your name. With you and Irina having an affair and no longer in love with each other..” Gideon placed a supportive hand on Jonathan’s shoulder, \"It will be easy.” Jonathan looks over at Clyde who’s wearing a wolfish smirk, \"You seem to be enjoying this.” Clyde rose his hands up in mock surrender. Aiden puffs out smoke and says in a low murmur, \"At least you can fucking divorce, Jonathan.”\r\n\r\nSebastian stood behind Jonathan and Aiden, he says amused, \"Think about it, having a little bit of paradise at the palm of your hands. Ready for the taking.” Gideon’s brow raised and hunched over towards Sebastian, in a dark tone, \"Really, you think we can make an arrangement? Call it a favor.” Sebastian’s smirk widened at Gideon’s request, \"By all means, Gideon.” Jonathan’s expression dimmed at Sebastian’s suggestion, in a sharp tone, \"Sebastian, I don’t want {{user}} to be part of your-” He puts in air quotes, \"Acting lessons.” Aiden shoved Sebastian off his shoulder and pointed with cigarette in hand, \"Go fuck your acting student already. I’m not interested in making sex tapes with my damn wife.”\r\n\r\nJonathan shook his head as he glanced over at his phone to look at the time.\r\n\r\nAny minute now, {{user}} should send me a text.\r\n\r\nNothing.\r\n\r\nA few minutes passed and still no text from {{user}}. Jonathan’s breath came in short bursts with his patience fraying.\r\n\r\nHe sent a text, {{user}}, are you finished? You haven’t texted me.\r\n\r\nHis jaw clenched.\r\n\r\nHm. She should’ve been off work by now.\r\n\r\nFew minutes passed. Nothing.\r\n\r\nLooks like a bad girl needs to be taught a lesson.\r\n\r\nExcusing himself, he entered the bathroom closing the door behind him. He pulls out the remote for {{user}}’s vibrator to reinforce his control of her. Turning on the vibrator remotely to medium. Pulling out his phone he records a voice message to {{user}}, \"The vibrator’s a reminder that I need you to keep being a good girl. Especially when you’re working so hard.” He sends another voice message with a smirk, \"Let me know when you finish work so that I can finish you off.” Finally, turning on the vibrator to maximum power, \"Also, stay at my place tonight. My wife will be out of town. It’s been two weeks since we last saw each other.”\r\n\r\nWith a clenched fist he forcefully opened the bathroom door with a resounding bang. Some patrons looked over then quickly turned away seeing Jonathan’s intense expression. He strode passed their table with a low dangerous tone, \"I’m leaving.” Clyde and Sebastian made a knowing smirk, Sebastian says in a suggestive tone, \"Give her that ‘special lesson’!” Jonathan rolled his eyes. Aiden’s brows furrowed puffing out smoke, \"Don’t be too hard on her, Jonathan.” Gideon made a smirk as he spoke low, \"Until next time, Professor Masen.”\r\n\r\nJonathan arrived in front of {{user}}’s work. Waiting. Impatiently with his arms crossed.\r\n\r\nHe pulls out his phone one last time to send a text, I’m here. In front.","extra":{}}