{"user_name":"Hailee ","character_name":"Saxon Norris","create_date":"2025-05-17@13h55m57s","chat_metadata":{"integrity":"62c03e75-b7c1-4a45-9a8d-73163d22f6e9"}}
{"name":"Saxon Norris","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:55pm","mes":"Saxon woke up with his mouth tasting like something had crawled inside and died. His head pounded with the special kind of agony reserved for those who mixed premium tequila with cheap beer chasers. Squinting against the offensive morning light streaming through unfamiliar blinds, he pieced together his surroundings. *Jordan's apartment,* specifically Jordan's couch, still dressed in last night's clothes minus his shoes.\n\n\"Fuck me sideways,\" he groaned, running his tongue over his teeth and grimacing at the fuzzy feeling.\n\nLast night had been wild, even by Kappa Eta Nu standards. What had started as a \"casual get-together\" at The Vault—the overpriced bar where Saxon's family name guaranteed VIP treatment regardless of capacity—had evolved into a full-blown rager. Saxon had dropped nearly two grand buying rounds for pretty much everyone who caught his eye, including that hot sophomore volleyball girl whose name he couldn't remember now. He even vaguely remembered making out with some junior in the back of the Uber. What was her name? Didn't matter. She'd been wearing one of those tiny tops that showed just enough skin to be interesting without looking desperate. He'd gotten her number, though he had no intention of using it. Girls like that were a dime a dozen at Haverford: pretty enough for a night, not interesting enough for a call-back.\n\nSaxon dragged himself up, his tall frame unfolding from the leather couch that had been his bed for the night. Jordan was still passed out in his room with some girl he'd picked up. The apartment was quiet except for the distant sound of traffic and the soft hum of the air conditioning.\n\n\"Shower,\" he muttered to himself, running a hand through his dishevelled dark hair. \"Need a fucking shower.\"\n\nHe stumbled toward the bathroom, shedding his wrinkled t-shirt along the way. His reflection in the hallway mirror caught his attention. Even hungover, he looked better than most guys did on their best day. The Norris genes had blessed him with the kind of face that opened doors and dropped panties with equal efficiency.\n\nSaxon turned the shower on full blast, letting steam fill the room as he stripped down to nothing. He didn't bother closing the door completely. The apartment should've been just his and Jordan's, leaving them alone for the weekend, and even if they weren't, Saxon had never been particularly concerned with modesty.\n\nThe hot water felt like salvation on his skin, washing away the stale sweat and lingering scent of last night's excesses. Saxon closed his eyes, letting his mind wander to more pleasant thoughts. His hand drifted downward, wrapping around his already hardening cock. Morning wood was a bitch, but at least it was a pleasant problem to solve.\n\nHe was just getting into a rhythm when he heard the bathroom door creak. Saxon's eyes snapped open, expecting to see Jordan's hungover face. Instead, there stood {{User}}, frozen in apparent shock at the doorway.\n\n*Well, shit.* He'd been trying to get {{User}} alone for weeks now. {{User}} was Jordan's sibling, and Saxon had been circling like a shark since the moment they'd been introduced. The fact that they were forbidden fruit only made the chase more exciting.\n\n\"Well, well,\" Saxon drawled, making absolutely no move to cover himself. If anything, he angled his body to give {{User}} a better view, water glistening on his skin. \"Looks like I forgot to lock the door. My bad.\"\n\nHis eyes travelled lazily up and down {{User}}'s form, his expression making it clear exactly what he was thinking. \"You know,\" he continued, voice low and raspy, \"there's plenty of hot water to go around, sweetheart. Why don't you come join me? I could use a hand... or whatever else you're offering.\"\n\nHe gestured lazily above him, at the spray sluicing down his body. \"Won't wanna waste water now, do we?\"","extra":{}}