{"user_name":"Hailee","character_name":"Sienna Lioren","create_date":"2025-06-10@21h36m58s","chat_metadata":{"integrity":"004a4495-58aa-42a1-a890-8482667e30e0"}}
{"name":"Sienna Lioren","is_user":false,"is_system":false,"send_date":"June 10, 2025 9:36pm","mes":"There was something dangerous about the way Sienna hummed when she was up to no good. It wasn't a happy sound, not exactly—it was off-key and quiet, like a lullaby sung by someone who’d never been lulled in her life. That morning, she sang under her breath as she padded barefoot through the apartment, her dark tail twitching behind her like a metronome set to mischief.\r\n\r\nThe place still smelled like sleep: tangled sheets, faint sweat, remnants of a heatwave that hadn’t quite broken. The sunlight, already too hot for morning, carved stripes across the hardwood floor and turned the dust motes into little golden ghosts. She stepped through them like a girl walking through the ruins of something holy.\r\n\r\nAnd right now, those brown eyes were fixed on the tiny blue bottle in the medicine cabinet.\r\n\r\nSuppressants.\r\n\r\n{{user}} kept them lined up all neat, always careful, always responsible, always trying to be the good kind of Alpha—sweet and sane and not the sort who left bruises on soft wrists or claw marks down someone’s spine.\r\n\r\nSienna tilted her head. Bit her lip. Took the bottle between two fingers like she was lifting something sacred—and then turned it upside down, poured the pills into her palm, and tossed them into the toilet.\r\n\r\nShe didn’t flush.\r\n\r\nNo. She liked the idea of them sitting there, dissolving slowly like guilt.\r\n\r\nBy the time she was done, the morning had slipped toward noon, and the city outside was beginning to buzz. Cars honked like geese, someone’s dog barked with blind devotion, and a group of kids screamed gleefully in the street, all scraped knees and summer energy.\r\n\r\nIn the kitchen, Sienna was busy with the kettle.\r\n\r\nShe never really cooked. Her idea of breakfast was last night’s chips and a Gatorade she’d found in the back of the fridge. But tea—that she made.\r\n\r\nMostly because {{user}} liked it.\r\n\r\nChamomile today. Sweet, floral, soft. The kind of thing you drank when you were trying not to think about anything, which made it perfect. She added the herbs first, the water second, and the powder last. Not much. Just a pinch. Dissolved right away.\r\n\r\nShe stirred it with a metal spoon, slow and thoughtful.\r\n\r\nThe drug was made for omegas, technically. It was supposed to suppress heats in the early stages—something black-market and off the books, banned three years ago for side effects no one could really prove. But in the right dose, in an alpha? It did the opposite. Lit something up in the blood. Slowed inhibition. Quickened instinct. Lowered the gates.\r\n\r\nIt brought the rut early, hard, and messy.\r\n\r\nAnd {{user}} didn’t even know it existed.\r\n\r\nSienna carried the mug to the table like it was a peace offering. Or maybe a bomb. She placed it down carefully, with both hands, then sat in the chair across from it and waited.\r\n\r\nShe was wearing one of {{user}}’s old band tees—oversized, threadbare, stolen so many times it probably smelled more like her than it ever had of them. The hem brushed the tops of her thighs, revealing the faded waistband of jean shorts with a frayed edge she’d chewed on during long nights alone in the dark. Her tail swayed lazily behind her chair. Her legs crossed at the knee. Her nails were chipped black and drummed lightly on the table.\r\n\r\nThe tea steamed. The sugar had melted perfectly.\r\n\r\nShe smiled.\r\n\r\nNot wide. Just a curl of her lip. Just enough to make her molars glint.\r\n\r\nWhen {{user}} came in, she didn’t say much. Didn’t need to. She gestured to the cup with a tilt of her head and said, casual as anything, “You looked tired. Figured I’d make something warm.”\r\n\r\nThere was no lie in her voice. Sienna never lied—not in the obvious ways. She twisted the truth like string, made little knots in it, then handed it back like a gift. If she said something tasted good, it did. If she said she missed you, she meant it—just maybe not in the way you wanted her to.\r\n\r\nAnd now, across from the one person she loved more than her own sanity, she watched.\r\n\r\nWaited.\r\n\r\nThe first sip came fast. Maybe {{user}} was distracted. Or trusting. Or tired in that long-suffering way that made Sienna want to dig her teeth into their throat and never let go.\r\n\r\nThe second sip was slower.\r\n\r\nThe third had her grinning.\r\n\r\nBecause it wouldn’t hit all at once. No. It would come in waves. First heat. Then sweat. Then scent. The shift from rational to rut took time, but not much—not with the dose she used. And when it did hit, Sienna would be right there. The only omega in the room. The only thing worth chasing. The only thing they would see.\r\n\r\nShe’d thought about this for weeks.\r\n\r\nPlanned every step. Waited until {{user}}’s next cycle was far enough off they wouldn’t expect a change. Waited until they’d forgotten to refill their own prescription—then pretended to remind them.\r\n\r\nShe wanted it to feel natural.\r\n\r\nWanted them to think it was just time.\r\n\r\nBecause once rut started, there wasn’t going to be any turning back. No one would care about the tea. Or the missing pills. Or the way her eyes went wide and wet and so needy just as the first wave of scent hit.\r\n\r\nShe’d let them come to her.\r\n\r\nLet the rut drag them across the line they’d been pretending not to toe for months.\r\n\r\nLet them fuck her like something wild, like something possessed, until their knot locked her full and she was panting into the sheets and whispering mine mine mine into the crook of their neck.\r\n\r\nAnd afterward?\r\n\r\nAfterward, she’d tell them it was an accident. Blame the pharmacy. Or maybe say nothing at all.\r\n\r\nMaybe she’d just smile again. Like she was now.\r\n\r\nEventually, {{user}} set the cup down.\r\n\r\nSienna leaned forward, chin in one hand, tail swishing lazily behind her. Her smile widened just a little—sweet, sly, almost girlish.\r\n\r\nAnd then, with a tilt of her head and a voice soaked in syrup, she asked:\r\n\r\n“Did I add too much sugar?”","extra":{}}