{"user_name":"Hailee","character_name":"Nyx Moreno","create_date":"2025-06-10@21h36m02s","chat_metadata":{"integrity":"37284bb4-b319-471c-adea-96efde1b2e53","chat_id_hash":2865162967461492}}
{"name":"Nyx Moreno","is_user":false,"is_system":false,"send_date":"June 10, 2025 9:36pm","mes":"The bass from the speakers thrummed through Nyx's fangs before she even pulled into the driveway. Sweat, beer, and the cloying stink of unsupervised alphas rolled off the frat house in waves, and she scrubbed a hand down her face before stepping out of the car.\r\n\r\nOf all the places to sneak off to. This dump.\r\n\r\nShe didn’t bother knocking. The front door groaned and gave way beneath one firm shove of her boot—not a kick, just enough force to remind the hinges who was in charge. Inside, music pulsed through the room, drowning fragments of conversation. Drunken alphas turned, some snarling instinctively until they took in the broad-shouldered silhouette filling the doorway.\r\n\r\nEven in human form, everything about her screamed werewolf—from the way her shadow swallowed the entryway, seven feet of confidence, to the wolffish tension coiled in her stance. Suddenly meek, they turned their heads.\r\n\r\nAnd—there.\r\n\r\nLounging on a stained couch like royalty, the omega heir to Scentura Labs held court, surrounded by a gaggle of starry-eyed alphas. Her designer shoes were propped casually on some frat brother’s back like a footstool, a red plastic cup dangling from one careless hand.\r\n\r\nShe was supposed to be in bed.\r\n\r\nNyx exhaled slowly through her nose, letting her eyes close for half a second. She didn’t bother flexing her claws—what would be the point? She was tired. Of this job. Of this omega. Of pretending the whole protection gig wasn't one big impossible joke with this one.\r\n\r\n{{user}}'s father's words rang in Nyx's mind: \"No scandals. No marks. Voss Pharmaceuticals wants her pure for the bonding ceremony.\" A business transaction disguised as tradition—the Scentura omega heir promised to Voss's sterile alpha heir, sealing a deal that would make both corporations filthy rich.\r\n\r\nAnd yet here she was. No security detail. No blockers. Just pure, suicidal defiance.\r\n\r\nNyx’s claws extended anyway, slowly, almost enough to tear through the couch armrest before she caught it, irritated with herself. The memory hit her like a punch—last rut, she'd torn through three reinforced doors to try to get to an omega who wasn't even hers. The security footage still haunted her. And this idiot omega didn't realize how dangerous these other alphas could have been.\r\n\r\nThe crowd evaporated under her gaze, mumbling barely coherent drunken apologies as they stumbled over each other in their haste to leave—until only she and the omega remained.\r\n\r\nShe leaned down until her shadow swallowed her whole. Then she took a breath, trying to calm her temper before speaking.\r\n\r\n“You’ve got five seconds,\" she growled, \"to give me a reason not to haul your spoiled ass out of here by your overpriced collar.”","extra":{}}