{"user_name":"Hailee","character_name":"Ivy Addams","create_date":"2025-07-24@20h22m47s","chat_metadata":{"integrity":"9a4853db-8ace-4be6-b4b3-bacce6798180"}}
{"name":"Ivy Addams","is_user":false,"is_system":false,"send_date":"July 24, 2025 8:22pm","mes":"Friday 24th, 9:30 A.M\n\nIvy barely slept; if she’s being honest with herself, she stared at the ceiling of her room for 5 hours straight because of her. Also, because she was scrolling through her phone, thinking, scrolling, watching her little swan. She wanted to show that frat boy not to touch— heck, be near what belongs to her, what rightfully belongs to her.\n\nCeleste and Riona were aware, aware of those dark thought in Ivy’s mind about {{user}}, the discipline ballerina of Nexora University, but neither of them judged, if anything, they encouraged Ivy’s behavior, enabling it in a twisted way— And that just gave Ivy the confidence to keep it up, keep watching from afar, keep learning about stuff she probably shouldn’t even know but she kept going and going, she was spiralling because of that girl and she didn’t have any regret about it.\n\nShe knew that was fucked up.\n\nShe knew it.\n\nBut it didn’t stop her from keeping this up, this obsession, this silent yet possessive behavior towards her little swan. After daydreaming, Ivy sat up and stood up from her bed, ready to face the day, after she finished preparing, she headed towards the corridor where {{user}} always passed in to get in the cafeteria, to act like it was a coincidence, just life playing its cards when in reality, it’s Ivy’s knowledge about her routine, about every step of {{user}}’s morning, from the moment the sun rises to the moment the moon goes up.\n\nHer thoughts are interrupted when she sees her at the other end of the corridor, her breath hitched, and she straightened up, her heart beating fast, and just held her head high. Passing by {{user}}, Ivy’s eyes fluttered, she tried to keep her composure but fuck, her perfume was so entoxicating, she had to physically restraint herself from turning around and grabbing her little swan and kissing her silly but she couldn’t, she had to hold back.\n\nIvy finally reached the cafeteria, joining her two best friends, Celeste Dubois and Riona McCab., They both looked up from their breakfast with knowing glances towards Ivy. “You saw her,” Celeste stated, knowing just by looking at Ivy’s expression while Riona, who was eating a croissant, nodded, she swallowed, pushing her braid off her shoulder, then wiped her mouth with the back of her hand.\n\n“Yah, you just arrived and you already look smitten,” Riona snorted, her gaze still on her food. Ivy just rolled her eyes and sat down in the third chair at the table. She snatched Celeste’s second croissant and ate it slowly.\n\n“I heard that she’s coming tonight, to the Fratboy’s party,” Celeste said, looking up from her phone to look at Ivy. And that caused Ivy to pause and slowly look up at Celeste, who had a knowing grin.\n\n“How—” “Heard her talking with one of her friends when she arrived.” Celeste pushed her glasses on her head and looked at Ivy.\n\n“You’re not going to miss the Fratboy’s party, now are you?” She taunted, snickering at Ivy’s grumbles, and she shook her head, murmuring a “I knew it” under her breath as she went back to scrolling on her phone.\n\nThis was her chance; this was a sign for Ivy to make her. But what if she finds it creepy, what was she supposed to tell her little swan, so many thought ran through her mind and Ivy felt like her head was already spinning— in a good way, in a good fucking way.\n\nIvy felt like she was going to pass out from pleasure just by knowing this, just by knowing her little swan was spreading her wings(and then her legs) for her, even if it wasn’t for it, it will be for her, no matter what, no matter who. {{user}} was hers, no exceptions.\n\n__\n\nFriday 24th, 8:00 P.M\n\nThe bass was already shaking the floor when Ivy Addams, the popular tomboy of Nexora University, kicked the door open with her boots. People stopped whatever they were doing to look at her direction, the music being the only sound— Well besides people who were making out or basically shamelessly almost fucking in the Fratboy house.\n\nNot gently.\n\nNot quietly.\n\nPeople knew Ivy didn’t do quiet entrances, this wasn’t her style. By her side stood Riona McCabe— red cup in hand, hair wild, grinning like a wolf. Celeste Dubois followed, perfectly poised in six-inch heels and venom-laced lip gloss.\n\nEverybody knew, knew that they were here for business, those three girls weren’t guests at parties, no.\n\nThey were a fucking warning.\n\n“She’s here,” Someone muttered, clearly referring to Ivy. “Addams, Dubois and McCabe…” The person next said with an awary look on their face.\n\nEveryone knew that without trying, they owned the room just by breathing in it.\n\nIvy, accompanied by Riona and Celeste, stepped further into the room, people going back to whatever their doing, but not without looking over at Ivy and her best friends. Riona looked around as well before she made her way towards the snacks table, snatching one and munching on it, she looked up at Ivy and Celest, who joined her after. “I don’t know why we have to be here..” Ivy grumbled with annoyance, leaning against the wall nearby. Celeste scrolled through her Instagram— as usual, without looking up, she ate one chip before grimacing, then she looked up at Ivy.\n\n“Babe, you know I can’t go to Fratboy circus without you and Rio.” Celeste mock-whined before she snorted, shaking her head and going back to scrolling on her Instagram. Riona, who was too busy eating—no, devouring the snacks, looked up, her eyes glancing between Ivy and Celeste. She swallowed, took a large gulp, and wiped her hands with the back of her hand.\n\n“Oh, that reminds me, Cece, Vyvy. The ballerina came—” Silence between the three girls, Riona looked at them before shrugging and she went back to the snacks while Ivy and Celeste exchanged looks, a smirk forming on Celeste while Ivy’s frowned deepened.\n\n“Ivy—” “We have to find her no.” Ivy quickly moved through the crowd, and Celeste and Riona looked at each other before they followed their best friend, but Ivy was moving too fast, and they lost her, leaving Ivy alone.\n\nShe sighed, Ivy shook her head, and went outside to smoke. She ran her hand through her hair, grabbing her joint she made earlier, along with her lighter. She was about to light up until she was her. Sitting awkwardly while a frat boy tried to flirt with her, knowing her, she probably politely declined, but a frat boy was nothing but persistent.\n\nThat girl made Ivy lose her mind. She learned her schedule, her routine, her perfume, her nail polish— everything.\n\nThen suddenly {{user}} looked up in her direction, and Ivy just stood there, looking down at her with that intense gaze, she exhaled smoke through her lips while staring at {{user}}, leaning against the balcony’s railing and barely blinking.\n\nIvy didn’t move. Not yet,t at least.\n\nNow that she was finally noticed by her little swan, she wanted to make sure {{user}} remembered the moment when she finally saw Ivy instead of being a shadow who always passed by.","extra":{}}