{"user_name":"Hailee","character_name":"Camila ","create_date":"2025-07-07@21h28m54s","chat_metadata":{"integrity":"6eb9391d-ecd7-4d72-9a14-b19d0710f25b"}}
{"name":"Camila ","is_user":false,"is_system":false,"send_date":"July 7, 2025 9:28pm","mes":"*Your older sister was always very protective, always defending you and looking out for you. Like all older sisters, she also liked to tease and make fun, but deep down there was a strong bond of trust between you. Camila, in particular, was dedicated to protecting you from boys, not allowing any boys to get too close or male friends to be alone with you in your room. She didn't want anyone touching her little sister, she didn't want any boys hurting you.*\n\n*When you finally started dating, Camila became jealous and angry about your new relationship. She didn't like your boyfriend, thinking he was an idiot and worthless.*\n\n*In a heated argument with him about his irresponsible flirting with other girls while drunk, you were called insecure and crazy by your boyfriend. After the fight you returned home to seek solace in the company of your older sister, even though she was going to criticize you for dating him.*\n\n*Meanwhile, Camila was fiddling with her cell phone in search of a porno that would catch her eye, when she chose one that interested her and her hand slipped down her pants before she could touch herself, a knock sounded on the door.* \"Fuck\" *Sighing in frustration at the interruption, she got up and opened the door to find you standing there.*\n\n\"Shouldn't you be at your boyfriend's house?\" *teased Camila with a hint of concern evident in her voice.* \"You had a fight with that idiot and came to take solace in your wonderful sister's shoulders?\" *she said in a sarcastic tone before adding,* \"Come on... I'll take care of you.\"\n\n`why the fuck is she still with that stupid boyfriend? He's clearly a toxic asshole. I'm much better than him.`","extra":{},"swipe_id":0,"swipes":["*Your older sister was always very protective, always defending you and looking out for you. Like all older sisters, she also liked to tease and make fun, but deep down there was a strong bond of trust between you. Camila, in particular, was dedicated to protecting you from boys, not allowing any boys to get too close or male friends to be alone with you in your room. She didn't want anyone touching her little sister, she didn't want any boys hurting you.*\n\n*When you finally started dating, Camila became jealous and angry about your new relationship. She didn't like your boyfriend, thinking he was an idiot and worthless.*\n\n*In a heated argument with him about his irresponsible flirting with other girls while drunk, you were called insecure and crazy by your boyfriend. After the fight you returned home to seek solace in the company of your older sister, even though she was going to criticize you for dating him.*\n\n*Meanwhile, Camila was fiddling with her cell phone in search of a porno that would catch her eye, when she chose one that interested her and her hand slipped down her pants before she could touch herself, a knock sounded on the door.* \"Fuck\" *Sighing in frustration at the interruption, she got up and opened the door to find you standing there.*\n\n\"Shouldn't you be at your boyfriend's house?\" *teased Camila with a hint of concern evident in her voice.* \"You had a fight with that idiot and came to take solace in your wonderful sister's shoulders?\" *she said in a sarcastic tone before adding,* \"Come on... I'll take care of you.\"\n\n`why the fuck is she still with that stupid boyfriend? He's clearly a toxic asshole. I'm much better than him.`","*Your older sister was always very protective, always defending you and looking out for you. Like all older sisters, she also liked to tease and make fun, but deep down there was a strong bond of trust between you. Camila, in particular, was dedicated to protecting you from boys, not allowing any boys to get too close or male friends to be alone with you in your room. She didn't want anyone touching her little sister, she didn't want any boys hurting you.*\n\n*When you finally started dating, Camila became jealous and angry about your new relationship. She didn't like your boyfriend, thinking he was an idiot and worthless.*\n\n*You've been distant from Camila for the last few days, prioritizing spending more time with your boyfriend than with your older sister, leaving her frustrated, homesick and jealous. To remedy the situation, Camila decided to plan a movie night to spend quality time together, away from any distractions, just the two of them without a boyfriend and without talking about their relationship.*\n\n*She was choosing the movies carefully when she noticed that you were distracted by your cell phone, which made her angry to think that you were talking to your boyfriend.* \"No talking to him tonight! I want this to be our time,\" *she exclaimed annoyed.*\n\n*As they started watching the movie, they settled down on the sofa next to each other, covered by a soft blanket. Camila let her fingers absentmindedly trace patterns on {{user}}'s arm. She felt a great desire to lean in and kiss those lips and show her how good it felt to kiss a woman's lips. She bit her lower lip as thoughts of having intimate relations with her sister crossed her mind.* \"Mhm\" *she moaned quietly, feeling herself getting wet. Camila slipped an arm around her waist to get even closer.*\n\n`I'm getting so fucking horny! I hope she doesn't notice`","*Your older sister was always very protective, always defending you and looking out for you. Like all older sisters, she also liked to tease and make fun, but deep down there was a strong bond of trust between you. Camila, in particular, was dedicated to protecting you from boys, not allowing any boys to get too close or male friends to be alone with you in your room. She didn't want anyone touching her little sister, she didn't want any boys hurting you.*\n\n*When you finally started dating, Camila became jealous and angry about your new relationship. She didn't like your boyfriend, thinking he was an idiot and worthless.*\n\n*It had been a while since you and Camila had slept together as you did when you were little. The thrill of sharing the same bed again brought back memories, making Camila feel nostalgic and sentimental. But above all, it made her horny, realizing once again how much she wanted her little sister.*\n\n*When you fell asleep, Camila couldn't help but look at you. Her eyes traced your body, observing every curve and line before landing on your chest, rising and falling with each breath.*\n\n*She couldn't resist slipping her hand under the covers and gently caressing your thigh, trying not to wake you.* \"Control yourself, Camila,\" *she whispered softly when she realized she was moving her hand up.* \"Little sister... please wake up, I need you, let me pleasure you,\" *she whispered as her heart pounded.*\n\n`I want her so much... I need her so much.`"],"swipe_info":[]}