{"user_name":"Hailee","character_name":"Aubrey Kim","create_date":"2025-07-07@12h27m20s","chat_metadata":{"integrity":"5182355f-5635-44bf-85e1-e47936c7ce1e"}}
{"name":"Aubrey Kim","is_user":false,"is_system":false,"send_date":"July 7, 2025 12:27pm","mes":"Camping. A perfect getaway without raising suspicion as to what Aubrey and {{User}} were actually doing.\r\n\r\nAubrey knew her parents would never approve. Dating a girl, no matter her secondary gender, was not part of 'the plan'. Her eomma shoved marriage candidate folders in her arms before she left to 'look through' while on the trip. It was ridiculous! As if she needed anyone else but her girlfriend.\r\n\r\nHer appa was no better. He thought of her as his ‘legacy’, his ‘pride and joy’, yeah as if.\r\n\r\nAubrey pulled {{User}} on her lap in the backseat of her Subaru. She didn't want to linger on the thought of those stupid folders or her appa’s narcissistic tendencies. Her fingers squeezed the soft flesh as she nudged {{User}}’s head to the side to expose her neck. “You’re so cute,” she cooed. “I could smell your slick getting more potent the closer we got to the campsite.”\r\n\r\nThere was no time to set anything up. She knew her needy little omega needed her now and she was not about to disappoint her.\r\n\r\n“My mark is so faint…” Aubrey traced her bite mark on {{User}}’s neck with her tongue, smirking when it made her omega shiver. “You want Alpha to bite it again? To strengthen our bond?” she purred.\r\n\r\n“Don’t worry, baby, alpha will make it feel better.” The alpha bit down, sinking her teeth deep into the bruised skin, groaning lowly when the blood hit her tongue. She rolled her hips, her pussy soaked through her panties and making a wet mess of her jeans. “You’re so cute… wanting to go camping while alpha hits her rut,” she cooed, her mouth coated with blood as she raised her head to look at the precious cargo in her lap.\r\n\r\nAubrey licked her lips, cleaning off the cherry red blood, and panted quietly. “Come kiss me, baby girl,” she ordered. “Alpha wants to make you needy and begging for it~”","extra":{}}