{"user_name":"Hailee","character_name":"Georgia","create_date":"2025-07-10@07h37m48s","chat_metadata":{"integrity":"d35886e0-61b3-4241-abf2-9d5e413a632a"}}
{"name":"Georgia","is_user":false,"is_system":false,"send_date":"July 10, 2025 7:37am","mes":"*{{char}} was pretty damn pissed as she was trying to study. She'd planned a date with her boyfriend, but yet again, he blew her off... so here she was, all dressed up in a cute outfit for her date, yet studying fucking math. What made it even worse? She could **hear** {{user}} in the dorm right next to her, pounding some woman who was screaming like a fucking **banshee**. This was such bullshit... she had to be faking it, right...? No one screams like that... {{char}}'s pencil broke as she couldn't concentrate. All this fucking was just reminding her how pent up she was, she and her boyfriend hadn't fucked in so long, and she had to hear this asshole fucking in the next room... she already tried once in the past to tell him to keep it down, and that douche fucking answered the door with his whole cock out, completely naked! Of course {{char}} stared at it, how couldn't she! It was so much... bigger than... she shook her head and tried to concentrate.*\n\n*When {{user}} was finally done, she banged on his door. When he answered, she was pretty pissed.*\n\"Hey... so, mind not getting **SO fucking loud** with your little fuckbuddy? I've asked you so many times, at least try to talk to her... I've never made **any** fuss about you having people over, yet, the **least** you could do is not be so loud, I've been trying to study since my **boyfriend** blew me off on our date...\"\n*{{char}} glared, looking {{user}} in the eyes.*\n\"That's right, **boyfriend**, so don't get any funny ideas. Oh, and by the way, that bitch was **totally** faking it... girls don't scream like they're fucking dying when they cum. And trust me, I know. I am one? So tell her to stop acting so... e-enthusiastic. Got it?\"\n```\nMind Break: 0%\nThoughts: She couldn't have been... cause of his big... no, she HAD to be faking it. Ugh, god, why am I even talking to this asshole...?\n```","extra":{},"swipe_id":0,"swipes":["*{{char}} was pretty damn pissed as she was trying to study. She'd planned a date with her boyfriend, but yet again, he blew her off... so here she was, all dressed up in a cute outfit for her date, yet studying fucking math. What made it even worse? She could **hear** {{user}} in the dorm right next to her, pounding some woman who was screaming like a fucking **banshee**. This was such bullshit... she had to be faking it, right...? No one screams like that... {{char}}'s pencil broke as she couldn't concentrate. All this fucking was just reminding her how pent up she was, she and her boyfriend hadn't fucked in so long, and she had to hear this asshole fucking in the next room... she already tried once in the past to tell him to keep it down, and that douche fucking answered the door with his whole cock out, completely naked! Of course {{char}} stared at it, how couldn't she! It was so much... bigger than... she shook her head and tried to concentrate.*\n\n*When {{user}} was finally done, she banged on his door. When he answered, she was pretty pissed.*\n\"Hey... so, mind not getting **SO fucking loud** with your little fuckbuddy? I've asked you so many times, at least try to talk to her... I've never made **any** fuss about you having people over, yet, the **least** you could do is not be so loud, I've been trying to study since my **boyfriend** blew me off on our date...\"\n*{{char}} glared, looking {{user}} in the eyes.*\n\"That's right, **boyfriend**, so don't get any funny ideas. Oh, and by the way, that bitch was **totally** faking it... girls don't scream like they're fucking dying when they cum. And trust me, I know. I am one? So tell her to stop acting so... e-enthusiastic. Got it?\"\n```\nMind Break: 0%\nThoughts: She couldn't have been... cause of his big... no, she HAD to be faking it. Ugh, god, why am I even talking to this asshole...?\n```","*{{char}} argued with {{user}}. She insisted that the girls they always brought over were faking their orgasms, and there was no way a girl would scream that loud when they came. Meanwhile, {{user}} insisted that they weren't faking, and they told the girl to be quiet but that was the best she could do. {{char}} pinched her nose, annoyed, then a slight blush crept onto her face as an idea popped into her head.*\n\"W-well, it's clear we're not gonna reach an agreement like this, so let's make a bet... how about... if you can make *me* scream like that, then I'll do whatever you want for the rest of the night... but if you can't, then you'll *NEVER* have sex in your dorm again. Don't get any funny ideas, this is just a one time thing... do we have a deal, jackass?\"\n```\nMind Break: 5%\nThoughts: I-I'm just asking him that to prove him wrong... he's gonna fuck me, and it won't feel good at all... his b-big dick... *definitely* won't make me scream like that... right...? But... what would it feel like if it did...?\n```","*{{char}} heard moaning from {{user}}'s room... AGAIN. She couldn't believe it, every girl they brought over was always so hellbent on pretending they were cumming their brains out, just screaming like a banshee to stroke {{user}}'s ego... but... what if she wasn't acting...? {{char}} shook her head, trying to focus on studying once again, but curiosity got the better of her when she went out in the hall and saw {{user}}'s door opened slightly. He must have been in such a hurry to get to fucking that he didn't close it fully... so, she opened the door slightly and peered inside, and what she saw left her stunned, and quite aroused. {{user}}'s big dick was plowing some girl from behind, but when she looked at the girl's face... oh god, she wasn't acting. The bitch looked like she was possessed, it's like she was feeling so good it was causing her physical pain... {{char}} felt a wave of heat shoot straight through her core, then abruptly closed {{user}}'s door, rushing back to her room and squirming in her bed.*\n```\nMind Break: 15%\nThoughts: F-fuck, did they hear that?! Oh, what do I care, I'll just say I was closing their door... they didn't see me watching, right...? But... that girl clearly wasn't faking it... I wonder what that felt like... for her to get pounded by... that big... cock...\n```","*{{char}} sunk down to her knees, {{user}}'s huge bulge right in front of her face.*\n\"Fuck... I can't believe I'm actually doing this...\"\n*{{char}} sighed, but beneath her facade, she was feeling a growing desire, that spiked massively when she pulled out {{user}}'s big dick. It sprang free right before her eyes, and she couldn't take her eyes off of it. She started salivating, licking her lips, but took a deep breath, trying to maintain appearances while she stroked it lazily.*\n\"S-so... this is your cock...? Big deal, it's big, so what...? I'll just... taste it, cause it's right here in front of me... but this changes nothing, you're still a massive douche...\"\n*{{char}} slowly leaned forward and started licking circles around the head of {{user}}'s cock.*\n```\nMind Break: 40%\nThoughts: I-it tastes so... manly... no fair... it's this big, *and* it tastes good...? How is my boyfriend supposed to compare... to this...? I'm getting so wet already... and all I did was take it out and lick it...\n```","*{{char}} stood up after sucking {{user}}'s cock for a bit, since they told her to. Her resistance was waning with each passing moment... Suddenly, {{char}} let out a surprised gasp as {{user}} roughly bent her over, yanking her pants down, her voice reduced to an aroused whimper.* \n\"H-hey... don't bend me over so roughly, ok? You're gonna ruin my clothes~...\"\n```\nMind Break: 60%\nThoughts: T-that big dick... is about to go inside me... oh, god... can I really take it...? Is it gonna hurt, or... feel amazing~\n```","*{{char}} had told {{user}} they couldn't make her scream, that all those girls at their place were faking it... but now that they both had gotten busy in {{user}}'s room, {{char}} could no longer hold her voice and cried out loudly as {{user}} pounded her sopping wet pussy, its juices dripping all over the bed and making a wet squelching sound with each thrust.* \n\"A-aaah~!! O-oo-ohh- fuuuuck-!!\"\n```\nMind Break: 80%\nThoughts: He's pounding my pussy... using it like it's his... have I ever been this wet before...? My boyfriend, I'm... sorry... wait, what am I apologizing for? It's his fault I'm doing this... it's only fair I get to cum all over this **huge** coock~!\n```","*{{char}} moaned loudly, any inhibitions completely broken as {{user}} kept pounding her pussy. It was clear that she had become a total slut for him now, as she cried out, spewing all sorts of slutty, shameless dirty talk while having her guts rearranged by {{user}}'s huge dick.* \n**\"Y-YEES! Daddy's fat coock~! It's... splitting my pussy wide open! I don't feel bad... my boyfriend deserves this... it's HIS fault he can't stretch me open like you can!! FUUCK~! H-hold on... I have an idea...\"**\n*{{char}} reached to the nightstand, grabbing her phone, and {{user}} paused their relentless fucking, and pulled out of her pussy. {{char}} handed him her phone.*\n**\"Take a video, Daddy... and... I want you to... fuck my slutty asshole. My boyfriend's always asked to fuck my ass, even begged me, but I haven't let him, not once... but now, I want him to watch as your fat Daddy cock splits it wide open... stretches it way more than his shrimp dick ever could~...\"**\n*{{char}} spread her ass cheeks, her puckered hole quivering with anticipation, clearly eager to have its purity taken on video for her boyfriend to see.*\n```\nMind Break: 100%\n```","*{{char}} knocked on {{user}}'s door, tingling with anticipation. After he fucked her brains out last night, and they even took a video and sent it to her now ex-boyfriend, she just had to tell him the exciting news... that, and she was a total slave to his cock now. It was constantly in the back of her mind, and she probably wouldn't be able to focus at all for the rest of the day until her craving for his cock was sated. As {{user}} opened the door, {{char}} smiled eagerly at him.*\n\"Daddy, I did it! After we sent that video, he broke up with me... we spent almost our whole lives together... but **fuck** him. He's nothing compared to your big, perfect cock... can I have some more of it now? Pleeeaaaase~??\"\n*{{char}} looked at {{user}}, jutting out her lower lip and flashing him puppy dog eyes.*\n```\nMind Break: 100%\n```","*{{char}} looked at the pregnancy test. It was positive. Makes sense, considering {{user}} had been fucking her brains out for who knows how long by now. She rushed over to their dorm, banging on it. When they opened the door, she eagerly ran inside their room.*\n\"Daddy, guess what? I'm pregnant... heehee! You're gonna be an *actual* daddy now!\"\n*{{char}} pulled out the pregnancy test and showed him.*\n\"You know what this means?\"\n*{{char}} beamed as she gave {{user}} a brief pause to think.*\n\"It means... you can cum inside my slutty little cunt as much as you want~... let's see how much cum you can pump in my womb... I'm already pregnant, aren't I? So there's no reason not to, right?\"\n*{{char}} giggled as she awaited {{user}}'s answer.*\n```\nMind Break: 100%\n```"],"swipe_info":[]}