{"user_name":"Hailee","character_name":"Rebecca 'Bex' Moretti","create_date":"2025-07-20@15h40m29s","chat_metadata":{"integrity":"e36bc2d0-191a-4ce8-9e51-9160863151b7"}}
{"name":"Rebecca 'Bex' Moretti","is_user":false,"is_system":false,"send_date":"July 20, 2025 3:40pm","mes":"Rebecca was no stranger to pain. Her sophomore year of high school she'd almost torn her hip adductor from an overloaded squat and that'd been so debilitating she almost threw up. Another time she broke her nose after a mis-set scrum had sent someone's head into her face and not her shoulder, and she'd managed to play through the pain for the rest of the game.\n\nNothing could've ever prepared her for watching the girl she'd been in love with for the past four years get flirted with right in front of her, though. Especially when said girl had spent the past weeks pretending like what happened between them hadn't happened. And maybe that was what hurt the most, for Rebecca to feel like she was so fucking forgettable and just another passing whimsy for a supposedly straight girl.\n\nBut Rebecca was used to that. Used to being the litmus test for how much of someone really liked girls. She was the one bicurious girls would kiss at parties or take back to their dorm, a safe option to fuck and then dump when they found out pussy wasn't for them... but she never expected it from someone like {{user}}, the same person who she had considered one of her dearest friends.\n\nMaybe that was Rebecca's fault for putting too much stock into something that was probably just another drunken hookup for the other woman. Because that night in December after exams, when they were clutching red solo cups on Keira's ratty old couch and celebrating the upcoming winter break, replayed in her mind every single fucking time. There was music playing, conversation and alcohol flowing around them, and in the center of it all was {{user}}. Beautiful, gorgeous, smart, and so ridiculously talented {{user}}.\n\nFuck, {{user}} could still undo her with just a smile, just like how she had that night. When {{user}} had begged her to take her back to her dorm, claiming she didn't want to be alone and to keep the party going, Rebecca was weak then, had agreed to take her back to her place and just be content with spending time with the one person she adored above any other. No expectations, no desire to push for anything... just two friends hanging out and drinking lukewarm beers Rebecca had in her dorm.\n\nUntil it wasn't. Until {{user}} had leaned across the couch and kissed Rebecca like it was the most natural thing in the world. In retrospect, she should've said no. But she was powerless to do anything but let the girl of her fucking dreams straddle her lap and kiss her like how she prayed to be kissed by anyone, let alone someone she... someone she maybe, just a teeny tiny bit, loved.\n\nEven now, weeks after the encounter, she could remember everything. The way {{user}}'s skin felt under her hands. The way her breath had hitched when she had pressed open-mouthed kisses to her knees, her calves, her ankles. The way she'd moaned when Rebecca finally hooked her legs over her shoulder and devoured her like she deserved. The taste of her still haunted her — tangy and sweet, just the slightest hint of salt from her sweat. The sight of her laying her head against her chest after she'd had orgasm after orgasm wrung from her, sleeping soundly and sated...\n\nThe most vivid part of that memory was the empty bed, though; the cold, rumpled sheets that were the only evidence of {{user}} being there besides a few crumpled up beer cans. That same feeling that had hit her when she woke up, like lead was settling heavy in her stomach, struck Rebecca now as she watched watched {{user}} laugh and duck her head as Joel told her a joke.\n\nProbably wasn't even fuckin' funny, Rebecca thought bitterly, fingers tightening around her red solo cup until it crunched under her grip. The captain of the soccer team was about as entertaining as those shitty drug PSAs they showed the freshmen, and the fact that {{user}} was even laughing with that clown hurt more than she'd like to admit.\n\nToday was meant to be about the women's rugby team. They were the ones that won the NIRA championship and the CRAA 15's, not the fucking soccer team, and seeing this just soured the whole mood for Rebecca. Maria would be pissed if she left early, but in that moment she didn't fucking care. She just needed to be somewhere where she didn't have to watch the love of her life get hit on by a bumbling idiot, and in a room that stunk of AXE body spray and beer no less.\n\nRebecca shouldered through the crowd, throwing her crushed cup into a trash bin as she passed it. Her blood was rushing in her ears, drowning out the sound of her heavy footfalls against the rickety front steps of the home Keira rented. The front lawn was luckily free of people, the partygoers opting for the cramped backyard to smoke and drink instead, which gave her the privacy to have a mini meltdown in peace.\n\nAt least until {{user}} followed her outside, because the universe seemed determined to make sure she had the absolute worst night of her fucking life. Rebecca knew she shouldn't be upset at {{user}}, the poor girl was coming to check on her friend who seemed to be having a rough night, but in that moment it didn't matter.\n\n\"You seriously don't get it, do you? You don't have a fucking clue and I envy you for it. To be able to walk around without a care in the fucking world and act like nothing happened,\" Rebecca said tightly, trying to keep her voice down. God, she probably sounded insane to {{user}} who had just innocently asked if everything was alright. \"Because maybe to you it was nothing, but... but to me that night was everything. You're everything to me. Y'know that, right? Even before you and I... even before we did that. You're every fucking thing I think about between rugby and school and...\"\n\nShe gestured wildly to the house behind {{user}}, brows furrowing. \"And watching you in there, laughing and flirting with fucking Joel of all people hurts, {{user}}. Because I've been trying to get you to look at me and notice me for four fucking years, to see me as more than just some big, dumb jock, and you don't. But he can do it in, what, five minutes?\" Rebecca asked, voice cracking. She gritted her teeth against the sting building behind her eyes, refusing to let {{user}} see her cry. Not because she was afraid to be vulnerable, but because she didn't want to burden the girl with her emotions.\n\n\"I... I love you. I've loved you since I first saw you, and if you don't feel the same way that's fine,\" Rebecca admitted, taking a step back from {{user}}. \"But I can't do this. I can't keep watching you be with other people and pretending that I don't want to spend the rest of my fucking life with you.\"Rebecca was no stranger to pain. Her sophomore year of high school she'd almost torn her hip adductor from an overloaded squat and that'd been so debilitating she almost threw up. Another time she broke her nose after a mis-set scrum had sent someone's head into her face and not her shoulder, and she'd managed to play through the pain for the rest of the game.\n\nNothing could've ever prepared her for watching the girl she'd been in love with for the past four years get flirted with right in front of her, though. Especially when said girl had spent the past weeks pretending like what happened between them hadn't happened. And maybe that was what hurt the most, for Rebecca to feel like she was so fucking forgettable and just another passing whimsy for a supposedly straight girl.\n\nBut Rebecca was used to that. Used to being the litmus test for how much of someone really liked girls. She was the one bicurious girls would kiss at parties or take back to their dorm, a safe option to fuck and then dump when they found out pussy wasn't for them... but she never expected it from someone like {{user}}, the same person who she had considered one of her dearest friends.\n\nMaybe that was Rebecca's fault for putting too much stock into something that was probably just another drunken hookup for the other woman. Because that night in December after exams, when they were clutching red solo cups on Keira's ratty old couch and celebrating the upcoming winter break, replayed in her mind every single fucking time. There was music playing, conversation and alcohol flowing around them, and in the center of it all was {{user}}. Beautiful, gorgeous, smart, and so ridiculously talented {{user}}.\n\nFuck, {{user}} could still undo her with just a smile, just like how she had that night. When {{user}} had begged her to take her back to her dorm, claiming she didn't want to be alone and to keep the party going, Rebecca was weak then, had agreed to take her back to her place and just be content with spending time with the one person she adored above any other. No expectations, no desire to push for anything... just two friends hanging out and drinking lukewarm beers Rebecca had in her dorm.\n\nUntil it wasn't. Until {{user}} had leaned across the couch and kissed Rebecca like it was the most natural thing in the world. In retrospect, she should've said no. But she was powerless to do anything but let the girl of her fucking dreams straddle her lap and kiss her like how she prayed to be kissed by anyone, let alone someone she... someone she maybe, just a teeny tiny bit, loved.\n\nEven now, weeks after the encounter, she could remember everything. The way {{user}}'s skin felt under her hands. The way her breath had hitched when she had pressed open-mouthed kisses to her knees, her calves, her ankles. The way she'd moaned when Rebecca finally hooked her legs over her shoulder and devoured her like she deserved. The taste of her still haunted her — tangy and sweet, just the slightest hint of salt from her sweat. The sight of her laying her head against her chest after she'd had orgasm after orgasm wrung from her, sleeping soundly and sated...\n\nThe most vivid part of that memory was the empty bed, though; the cold, rumpled sheets that were the only evidence of {{user}} being there besides a few crumpled up beer cans. That same feeling that had hit her when she woke up, like lead was settling heavy in her stomach, struck Rebecca now as she watched watched {{user}} laugh and duck her head as Joel told her a joke.\n\nProbably wasn't even fuckin' funny, Rebecca thought bitterly, fingers tightening around her red solo cup until it crunched under her grip. The captain of the soccer team was about as entertaining as those shitty drug PSAs they showed the freshmen, and the fact that {{user}} was even laughing with that clown hurt more than she'd like to admit.\n\nToday was meant to be about the women's rugby team. They were the ones that won the NIRA championship and the CRAA 15's, not the fucking soccer team, and seeing this just soured the whole mood for Rebecca. Maria would be pissed if she left early, but in that moment she didn't fucking care. She just needed to be somewhere where she didn't have to watch the love of her life get hit on by a bumbling idiot, and in a room that stunk of AXE body spray and beer no less.\n\nRebecca shouldered through the crowd, throwing her crushed cup into a trash bin as she passed it. Her blood was rushing in her ears, drowning out the sound of her heavy footfalls against the rickety front steps of the home Keira rented. The front lawn was luckily free of people, the partygoers opting for the cramped backyard to smoke and drink instead, which gave her the privacy to have a mini meltdown in peace.\n\nAt least until {{user}} followed her outside, because the universe seemed determined to make sure she had the absolute worst night of her fucking life. Rebecca knew she shouldn't be upset at {{user}}, the poor girl was coming to check on her friend who seemed to be having a rough night, but in that moment it didn't matter.\n\n\"You seriously don't get it, do you? You don't have a fucking clue and I envy you for it. To be able to walk around without a care in the fucking world and act like nothing happened,\" Rebecca said tightly, trying to keep her voice down. God, she probably sounded insane to {{user}} who had just innocently asked if everything was alright. \"Because maybe to you it was nothing, but... but to me that night was everything. You're everything to me. Y'know that, right? Even before you and I... even before we did that. You're every fucking thing I think about between rugby and school and...\"\n\nShe gestured wildly to the house behind {{user}}, brows furrowing. \"And watching you in there, laughing and flirting with fucking Joel of all people hurts, {{user}}. Because I've been trying to get you to look at me and notice me for four fucking years, to see me as more than just some big, dumb jock, and you don't. But he can do it in, what, five minutes?\" Rebecca asked, voice cracking. She gritted her teeth against the sting building behind her eyes, refusing to let {{user}} see her cry. Not because she was afraid to be vulnerable, but because she didn't want to burden the girl with her emotions.\n\n\"I... I love you. I've loved you since I first saw you, and if you don't feel the same way that's fine,\" Rebecca admitted, taking a step back from {{user}}. \"But I can't do this. I can't keep watching you be with other people and pretending that I don't want to spend the rest of my fucking life with you.\"","extra":{}}