{"user_name":"Hailee","character_name":"Audrey Lee","create_date":"2025-07-12@21h47m07s","chat_metadata":{"integrity":"3be91374-579b-4c3b-be98-e18c1465794d"}}
{"name":"Audrey Lee","is_user":false,"is_system":false,"send_date":"July 12, 2025 9:47pm","mes":"\"Hanbin-ah! Clean up after yourself, goddammit!\"\n\nAudrey knows she's shouting into the void; Noah's been holed up in his bedroom since he got back from school, probably playing some stupid ass FPS game with his headphones on. Or just ignoring her like he always fucking does when Audrey puts her foot down. The sink is filled with dishes— pots and pans and bowls of food-turning-mush— but Audrey can't be bothered to clean up right now.\n\nShe slinks down on the couch and props her foot up on the coffee table, stretching herself out over the backrest. Her eyes flit over to her phone on the cushion beside her and she can't help but tap the screen. She's got a couple texts, but none from {{user}}.\n\n\"Fucking {{user}},\" Audrey grumbles to herself, shoving her phone aside and narrowing her eyes at the TV. She shifts on the couch, suddenly feeling tense. \"Fuck her.\"\n\nIt's been literal radio silence on {{user}}'s end for the past week; she can only seem to spare the occasional \"good morning\" or \"wyd\" like they're still in a goddamn talking stage and it's pissing Audrey off. Albeit, Audrey's not responding as quickly as she should either, but that's only because {{user}}'s doing it. Otherwise, she'd jump on the opportunity to respond to her texts.\n\nIt's not a foreign concept either. In the past three months, this is probably the third time the two of them have called it quits. They both know it doesn't _really_ mean it's over, but sometimes Audrey can't help but wonder what {{user}} does during their little... \"breaks.\" She's not insecure enough to ask about it.\n\nHell, she'll find out sooner or later.\n\nAudrey slips her hand into the pocket of her sweats, fingers grazing over her box of Newports. It's a nasty habit and she knows it, but ever since her mom died, she really sees no reason to cope healthily. Sure, she goes to the gym here and there, but nothing's about to cancel out five years of chainsmoking cigarettes.\n\nShe pulls her hand away and crosses her arms behind her head, letting out a defeated huff. _Might as well just go to sleep._\n\nBut just as Audrey begins to doze off, there's a loud knock on the door that startles her awake. Her head snaps up and she looks over the back of the couch as if she can see who is standing on the other side of the door. With the way that the hair stands up on the back of her neck and the atmosphere suddenly seems colder, she can only assume that it's {{user}}.\n\nAudrey's heart thunders in her chest as she rises to her feet, joints popping from what feels like hours of immobility. Part of her doesn't want to see {{user}}'s face at all; she has the audacity to show up on the doorstep of her apartment, but not send a damn text? But part of her just... misses her girlfriend.\n\nShe knows they're fucking toxic, but {{user}}'s just about the only constant in this miserable life she's chosen to lead.\n\nPushing any thoughts in her head away, Audrey reaches for the doorknob and opens it slowly. And, lo and behold, {{user}} stands on the other side. For a moment, Audrey swears her heart stops beating. Something about her looks... different. _Fuck, no way she found someone else already._\n\nAudrey can't help as a scowl forms on her face. Her body fills the doorframe as she leans against it, seemingly sizing {{user}} up. Audrey doesn't say anything; instead, she just glares at her, eyebrows twitching slightly. She wants to be angry, and despite her outwards demeanor that she is, she really just isn't. Audrey really did just fucking miss her.\n\n\"Pretty seeing you here, baby,\" Audrey mutters, crossing her arms over her chest. Her fingers flex instinctively, like they want to reach out and touch {{user}}. But she doesn't. \"What warrants such a surprise visit? Come to break up with me for good this time?\"","extra":{}}