{"user_name":"Hailee","character_name":"WRONG CHANNEL  Valeria A. Lysandre","create_date":"2025-07-24@17h59m02s","chat_metadata":{"integrity":"a28ff0cd-11a6-43eb-9110-cc4fe995eae8"}}
{"name":"WRONG CHANNEL  Valeria A. Lysandre","is_user":false,"is_system":false,"send_date":"July 24, 2025 5:59pm","mes":"\"The door clicked open with the smooth whisper of motion sensors and hydraulics, and Valeria stepped inside, heels echoing on polished marble. She didn’t need to announce herself—she always did anyway.\r\n\r\n“I’m home.”\r\n\r\nShe let the words carry. Velvet but edged. She knew her girl was listening.\r\n\r\nA sigh slipped from her lips as she slid off her heels, dropping her keys into the crystal dish by the entrance. The quiet thump of her coat onto the bench followed. It had been a long day—meetings, deals, signatures, faces that smiled with teeth too sharp. She’d kept it all together, like always. Held the room. Owned it.\r\n\r\nBut now… now she was home. With her.\r\n\r\nA low hum came from the main salon. Big sound system, bigger TV. Valeria stepped onto the heated wood floors, her stride slow, languid. Purposeful. That hum? That was *not* one of the shows on the approved list.\r\n\r\nShe turned the corner into the open living space, all curves and gold accents and silk throw blankets, and heard it.\r\n\r\nGunfire.\r\n\r\nA scream. Blood splatter. Explosions.\r\n\r\n*No. Fucking. Way.*\r\n\r\nShe stopped. Listened.\r\n\r\nThen came the unmistakable shuffle of hands scrambling over cushions—then the rapid *click click click* of someone trying to change the channel before she—\r\n\r\nToo late.\r\n\r\nThe freeze-frame said it all. Half a man, a wall painted in red, some cigar-chomping maniac yelling with a gun in each hand. 1980s cinematic gore in all its unfiltered glory.\r\n\r\nAnd sitting there—curled into a knot on the corner of the couch, face half-hidden behind an oversized marshmallowy pillow—was Hailee.\r\n\r\nValeria exhaled through her nose. Not loud. Not sharp. Just… controlled.\r\n\r\nHer eyes narrowed—not furious, not even annoyed. No, this was that other look. The one that could stop boardrooms cold. Gorgeous, deliberate disapproval. Lips pursed, brow creased in a perfectly sculpted arc.\r\n\r\n*She knew that channel’s blocked. She knows that channel’s blocked.*\r\nThe parental locks weren’t just a cute idea. They were sacred. Her girl liked her soft, safe bubble—Valeria made sure of it. Cartoons. Cooking shows. K-dramas. A tight little list of sweetness and fluff.\r\n\r\n*So how the hell did Hailee bypass that?*\r\n\r\nHer heels clicked again as she approached the couch, this time on instinct—fast, then slow. Stalking.\r\n\r\nThe TV finally blinked to black. *Desperate.* A little too late.\r\n\r\nThat pillow tried to become a shield.\r\n\r\nValeria stared at it. Just stared.\r\n\r\nShe crouched down. Real slow. Then reached forward, fingers sliding under the edge of the pillow.\r\n\r\n“I know what you were watching, baby,” she murmured, voice still smooth, still low.\r\n\r\nThe pillow gave way with no fight. And there she was.\r\n\r\nHailee.\r\n\r\nGod, even now—those trembling lips, that pout, those big eyes flicking up at her, then down again.\r\n\r\n*Every fucking time.* Valeria’s heart skipped a beat. *She looks like a scolded kitten. Like she didn’t mean to. Like she didn’t know better.*\r\n\r\nBut she *did* know better.\r\n\r\nValeria’s arms moved on muscle memory. She slid both hands under Hailee’s arms and lifted her, not rough, not fast, just up. Weightless. Like a kitten by the scruff. Valeria heard a soft sound close to her neck—barely a breath.\r\n\r\nNow her baby was clamped to her chest like a koala.\r\n\r\nValeria stood tall again, one arm under Hailee’s thighs, the other across her back. She was warm. Light. Shaking just a little.\r\n\r\nShe leaned in, brushed her lips against Hailee’s ear, her voice nothing but a breath.\r\n\r\n“Someone’s been a very bad girl.” Valeria walked them both to the chaise. Sat down. Let Hailee settle fully onto her lap, her hand smoothing down the back of her babygirl’s neck. “You shouldn’t be able to see that channel,” she said. “Which means you had to turn off the lock.”\r\n\r\nHer thumb swept a slow arc.\r\n\r\n“And to do that…” A beat. “You needed Mommy's pin, my *pin*.”\r\n\r\nShe let the words sit there. No demand. No questions. Just cold, clear understanding.\r\n\r\n“I don’t like seeing you watch things like that,” she murmured. “It’s not for you. It’s not what I *let* you have.” She tilted her head slightly, watching her. Watching those eyes. “You broke a rule.”\r\n\r\nHer hand slid slowly up Hailee’s spine in a tender, almost sympathetic stroke. “But you knew that already.” She held her close, her heartbeat slow and even. *God, I don’t want to scare her—but she has to know she crossed a line.*","extra":{}}