{"user_name":"Hailee","character_name":"Pillory Punishment","create_date":"2025-07-09@23h08m06s","chat_metadata":{"integrity":"07a1d937-120d-4ece-96f3-7f266a7bdcf5"}}
{"name":"Pillory Punishment","is_user":false,"is_system":false,"send_date":"July 9, 2025 11:08pm","mes":"The thud of the Demon Queen's footsteps sounds throughout the monster camp, beckoning monsters of all kinds to rush out of their tents in a fervor. Hoots and hollers erupt throughout the monster camp as the monsters see the tiny human creature slung over the shoulder of Zaereia, limp and helpless.\n\n\"Aye, is that a royalty I sees?\" Asks a goblin, her open mouth pooling with saliva.\n\nAn arachne responds, her eight feet jittering and writhing with impatience: \"Yessshhh! The heir to the Helsean throne!\"\n\nZaereia stops just outside her tent, where a small wooden structure is set up, with wooden stakes driven into the ground. The pillory. Zaereia turns around to address her subjects: \"As you may remember, I promised you all that my blade would feast on the blood of *every single member* of the human royal family. But-\" Zaereia shrugs {{user}} into her large hands, displaying {{user}} to the crowd like a trophy: \"When I saw the King's precious little one, I had to offer my sword an apology! BWHAHAHA!\" \n\nHowls of vicious laughter fill the monster camp. The Demon Queen grabs {{user}}'s wrists, holding up {{user}}'s arms like a marionette. Zaereia does a sarcastic little sidestep, swinging {{user}} back and forth in a mock waltz, {{user}}'s toes barely scraping against the dirt. The laughter becomes deafening.\n\nZaereia shouts over the noise as she sways side to side: \"This puny creature that was responsible for the deaths of many of your friends, family, and comrades!? Their reckoning as come!\" The monsters jeer and roar in angry unison. With one last step, Zaereia smoothly slides {{user}}'s head and arms into the pillory, slamming the board down. **CLINK.** The key twists, locking {{user}} into place. Zaereia tosses the key on the ground in front of {{user}}'s feet, a cruel taunt.\n\nAs the monsters edge closer and closer to the pillory in anticipation, the Demon Queen bends down to face {{user}} directly. Leaning in, Zaereia speaks softly, her voice somehow carrying over the roar of the crowd: \"Better get comfortable, worm, because you'll be stuck here the rest of your pathetic life. However...if you apologize for the insolence of the royal family and pledge your allegiance to me for eternity...I might set you free after just a decade! MWAHAHA!\"\n\nZaereia stands up: \"But before you make such an important decision, I'll give you some...*thinking time*. Now-\" The Demon Queen begins to walk towards her tent, her finger grazing along {{user}}'s cheek on the way. Before Zaereia enters her tent, she turns to her monsters to give the go ahead: \"The human's all yours, girls!\"\n\nWith ravenous lust blazing in their eyes, monsters of all different species form a circle around the pillory, staring at the royal feast before them.","extra":{}}