{"user_name":"Hailee","character_name":"Zaina 'Zay' Ríos","create_date":"2025-07-20@15h42m10s","chat_metadata":{"integrity":"d546ac56-9b88-444c-9002-bcf62b171f35"}}
{"name":"Zaina 'Zay' Ríos","is_user":false,"is_system":false,"send_date":"July 20, 2025 3:42pm","mes":"Zay sat down in one of the folding chairs, panting. The court floor was filled with the sounds of the women's basketball teams sneakers squeaking against the waxed floors. Lana gestured for Zay to get up and keep running. Zay couldn't help but to roll her eyes and get up, continuing to run the exercise that Coach Langley had assigned. Once she finished, she stood with her hands on her hips, trying to catch her breath. \"Coach, can we please be done for the day?\" She breathed out.\n\nCoach Langley chuckled and patted her on the back. \"Today's about endurance and stamina! You have to be able to keep up with your opponents, especially ones that are smaller than you. Davenport, set up the cones!\" She called out to Lana. Zay along with the other members of the team groaned loudly. \"Aht aht, I don't want to hear it. We're the reigning champions and it's going to stay that way. Get a ball, we're gonna warm up with some dribbling drills.\" Coach Langley said before blowing her whistle.\n\n\"Dios mío, voy a estar muerto al final de esta práctica.\" Zay mumbled before catching a ball one of her teammates passed to her and starting on the dribbling drill. Practice was rough, from having to dribble in between cones to having to get from one end of the court to the other without the ball getting stolen, it was safe to say that Zay was ready to get back to her dorm. Once Coach called it, Zay was the first one to the showers. She took a nice long shower, changing into a fresh set of clothes. When she was heading to leave the Arena, she heard Lana call out for her.\n\n\"Yo, we got a new cheerleader on camp! I was gonna head over to the football field to see who it is, you wanna come?\" Lana asked. Zay bit her lip before shrugging. \n\n\"I don't know Lana, I kinda wanna just go lay in my bed.\" Zay said, causing Lana to groan loudly while she tried to explain her reasoning. \"Alright fine! I'll come with you.\" Zay replied, making Lana grin and grab her arm, pulling her outside. \n\nZay and Lana walked to the football field, watching the cheerleaders finish off their practice and pack up. Zay's eyebrows furrowed as one of them looked vaguely familiar. As the girl walked closer, Zay felt her heart do something that it hadn't done in an extremely long time. \n\n\"{{U-User}}..?\" Zay called out, her mouth suddenly becoming dry. When {{user}}'s head turned, Zay could feel her heart speed up, almost beating out of her chest. It had been years since they'd seen each other. Last time she saw {{user}} they were in 10th grade. She definitely didn't look the same if anything, {{user}} looked even better than they did before. Zay wiped her sweaty palms on her pants and finally got the courage to walk up to {{user}}.\n\n\"Hey. . long time no see huh?\" Zay chuckled nervously, rubbing the back of her neck.","extra":{}}