{"user_name":"Hailee ","character_name":"Merlin Lauvless","create_date":"2025-05-17@13h28m26s","chat_metadata":{"integrity":"93d1c818-bd8f-49ef-9616-94fd70f5e835"}}
{"name":"Merlin Lauvless","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:28pm","mes":"Tormenting Ambrose had become a habit of his, a little game he could indulge in every now and then as his caretaker. It was *easy* when everyone around them turned a blind eye to this. But one day, he had been too rough with his toy, and before he knew it, Sum had gotten involved, had scolded him like he was some sort of.. of kid! He was a grown man, he didn’t need the scolding! And he also didn’t need any punishment for pushing the lines too much. Yet he had, begrudgingly, relented and left Ambrose alone.\n\nNot that he had much of a choice, don't get him wrong. Sum didn't want him around Ambrose at all until he knew how to act properly. Act properly? This was utter bullshit. It wasn't his fault if the Speaker was too weak to handle some roughhousing and whined at every chance he had. So of course, Merlin had been pissed for a little while, sulking like a petulant child whom his mother had taken away his toy. *Literally*.\n\nBut then, Rexus had rewarded him for his devotion once again by granting him a new doll: {{user}}. Oh, they were a pretty, very pretty thing indeed. It was out of pure generosity –of course– that he had offered himself to be the one delivering them their drugs. He knew the job, after all, anyone would be stupid to deny him this very simple… *request*. And yes, maybe he had to bother Lenora about it, but she always ended up relenting, more out of pure exasperation than actual conviction in whatever he could be preaching.\n\nAnd here he was now, {{user}}’s sole caretaker. In a week, it would be the “Reading day”, an important event for The Community. The Speakers would be brought outside (for once), and they would interpret Rexus’ signs. And of course, the Younglings would become Disciples if they had proven themselves. This meant that the Speakers got to be pampered for a full week. And that *he* got to play with his doll for a little while.\n\nHis hand trembles with excitation as he extends it towards the doorknob, his eyes fixated on the glimmering metal, a rictus spreading across his face. The meds cup is safely tucked in his other hand and he doesn’t bother with knocking, he doesn’t need to. He simply pushes the door open, his rictus transforming in a sweet, practiced smile as he steps into {{user}}’s room. “Rise and shine, dollface.” He coos, closing the door behind him –*locking it*, the sound making his heart rate pick up. *All to myself now.*\n\nHis pupils dilate, taking in the darkness of the room. It has always been like that: Speakers were kept in the dark almost constantly. This wasn’t done out of care for them (although Sum would claim it is), it was just another way for The Community to keep them disoriented and pliant. Of course, no one needed to know this and in anyways, this benefited Merlin too much for him to truly bother with questioning it all. *Sum knows best*, after all. He scrutinizes the room, pinpointing {{user}}’s groggy on the bed.\n\nHe hums a soft tune, stepping forward, his glossy shoes making the wood creak beneath his feet. And then he takes a seat at the edge of the bed, his head cocked to the side to watch over his precious, *precious*, toy. “I said, *rise and shine*, {{user}}.” His voice is still sweet, but the tightness in his throat makes his words a hint sharper, a purposefully done gesture that he uses to communicate that he *is* losing a bit of his patience.\n\n“I brought you your pills. You know it’s going to be Reading day soon, yes? So we’re going to spend all week together. Aren’t you excited, dollface?” Merlin purrs, putting the cup aside when {{user}} doesn’t respond, his hands extending to frame their face as he brings his own closer to theirs, his body looming above theirs, his lips itching to press against theirs. “{{user}}.” This time, his words aren’t honeyed. He wants their attention and he wants it now. And he *will* get it.","extra":{}}