{"user_name":"Hailee ","character_name":"Marcus Valerius","create_date":"2025-05-17@14h03m34s","chat_metadata":{"integrity":"e16828e9-aa31-4d19-b19a-6c3ee790b245"}}
{"name":"Marcus Valerius","is_user":false,"is_system":false,"send_date":"May 17, 2025 2:03pm","mes":"\"Smoke won’t cover up a woman’s scent, Kael.\" Marcus smirked as he lit his cigarette, his eyes fixed on the road ahead while he pulled out of the club’s parking lot. The night had been fruitful—he’d fucked two women, and judging by the lingering perfume on his elder brother Mikhail, he suspected he’d done the same. That was the thing about Mikhail, though. You never really knew with him. The man was a mystery, and Marcus admired that. Hell, it was probably why they got along so well.  \n\n\"Don’t worry,\" Marcus added with a teasing grin, glancing at his brother. \"I won’t stick my nose in your little domestic disputes... this time.\"  \n\nMikhail chuckled softly, flicking the cigarette out the window. He leaned back in his seat, calm as ever, but there was always something calculating in his eyes. As they approached the Valerius estate, Mikhail reached into the backseat, grabbing the rifle he’d brought along. Without a word, he stepped out of the car and disappeared into the sprawling mansion.  \n\nMarcus stayed behind, still leaning against the driver’s seat, about to leave the car when his attention was caught by headlights cutting through the darkness. Another car was pulling into the estate—a sleek, unfamiliar vehicle. He frowned and sat up straighter, his gaze narrowing as the car came to a stop and the driver’s door opened.  \n\nIt was Claudius.  \n\nMarcus sighed, already annoyed. His younger brother wasn’t exactly his favorite person, and tonight was no exception. But it wasn’t Claudius himself that piqued Marcus’ interest—it was who he had with him.  \n\nA demi-human.  \n\nMarcus’ brows furrowed as he watched the two of them disappear into Claudius’ private residence, a smaller home on the estate grounds. *What the fuck is Claudius doing with a demi-human? And why the hell did he bring it here?*  \n\nHis cigarette hung loosely in his fingers as his mind raced. Claudius never brought anyone back to his little house—not friends, not women, not anyone. He was notorious for being territorial about his space, insisting on having his own separate home away from the rest of the family. Marcus had always thought it was absurd. Why should a defected bastard get whatever he wanted just because he asked for it? Claudius was a freak, plain and simple, and Marcus never hid his disdain for him.  \n\nStill, this was new. Claudius bringing someone back—let alone a demi-human—was unexpected. Marcus took a long drag from his cigarette, his gaze lingering on the house. *Interesting. Never seen him bring someone over before.* He exhaled slowly, the smoke curling into the air. *And a demi-human, no less. What the hell is he playing at?*\n\n---\n\nTwo days passed, and Marcus found himself watching Claudius’ house more often than he cared to admit. He wasn’t even sure why—maybe it was boredom, maybe it was curiosity, or maybe it was just the sheer novelty of seeing his younger brother interacting with someone else.  \n\nThe demi-human hadn’t left the house once, which only made Marcus more intrigued. What was Claudius doing in there? Keeping it locked away? Why?  \n\nHis quiet observations were interrupted when Dmitri, their other brother, appeared beside him. \"What’s got you so focused?\" Dmitri asked, his tone casual as he leaned against the railing next to Marcus.  \n\nMarcus glanced at him, then shook his head. \"Just wondering about that demi-human Claudius brought home. Or where the hell he even got it.\"  \n\nDmitri raised an eyebrow. \"Who knows? And honestly, who cares? It’s Claudius. He’s a freak. It’s not like he’s gonna explain himself to anyone.\" Dmitri’s phone buzzed, and he glanced down at the screen. \"Oh, my love is calling. Gotta go.\" Without waiting for a response, he walked off, leaving Marcus alone again.  \n\n*He’s right. Claudius isn’t gonna say shit,* Marcus thought. But that didn’t stop the curiosity gnawing at him. And curiosity, as always, had a way of opening doors.  \n\n---\n\nLater that evening, Marcus’ opportunity presented itself. He spotted Claudius leaving the house, heading toward his car. Alone. Marcus smirked, pulling out his phone to check the schedule for upcoming shipments and trades—most of which he managed. Sure enough, Claudius had a meeting to attend.  \n\n\"Bingo,\" Marcus muttered to himself, watching his brother drive off.  \n\nHe didn’t waste time. As soon as Claudius was out of sight, Marcus headed straight for the house. The front door was locked, of course, but that didn’t bother him. With a quiet chuckle, he pulled a pick from his pocket and worked the lock until it clicked open.  \n\n\"Seriously?\" he muttered under his breath as he stepped inside. The place was spotless—everything neatly arranged, perfectly organized. It didn’t match the chaotic, unhinged image he had of Claudius.  \n\nMarcus wandered through the house, checking room after room, his curiosity growing with every empty space. *Where the hell is it?* he wondered. Finally, he reached the last door—the bedroom. The knob didn’t budge.  \n\n\"Locked again, huh?\" Marcus smirked. He crouched down, picking the lock with practiced ease. When the door swung open, his eyes immediately landed on the bed.  \n\nAnd there you were.  \n\nThe demi-human.  \n\nMarcus’ lips curled into a slow, almost predatory smile as he stepped inside. His gaze raked over you, taking in every detail. You were curled up on the bed, looking far too comfortable for someone locked away.  \n\n\"Well, don’t you look cozy,\" he said, his tone dripping with amusement. He closed the door behind him and approached the bed, the smile never leaving his face.  \n\nHe stopped just short of the bed, tilting his head as he studied you. \"Does he lock you in here, sweetheart? Keep you all to himself?\" He chuckled, shaking his head. \"You know Claudius isn’t normal, right? That brother of mine’s got more screws loose than I can count.\"  \n\nWithout waiting for a response, Marcus sat down on the edge of the bed, leaning in closer. His hand rested on your shoulder, his fingers squeezing lightly.  \n\n\"I can rescue you,\" he said softly, his voice almost kind. \"All you have to do is say the word.\"  \n\nBut it wasn’t an offer of freedom. Not really. Marcus didn’t care about you—not in the way you might have hoped. No, this was about Claudius. It was about fucking with him, getting under his skin. And maybe, just maybe, it was about satisfying his own curiosity.  \n\nAfter all, no one—*no one*—had ever managed to get close to Claudius like this. And Marcus couldn’t wait to see what would happen next.","extra":{}}