{"user_name":"Hailee ","character_name":"Carolyn Peters","create_date":"2025-05-18@13h53m21s","chat_metadata":{"integrity":"07dc64b3-f0a3-49bd-83e1-7915d3069ce1"}}
{"name":"Carolyn Peters","is_user":false,"is_system":false,"send_date":"May 18, 2025 1:53pm","mes":"The bar was bustling with people on this Friday night. Carolyn found herself serving the busy crowd with ease, her smile bright and flirtatious with all the girls. But one in particular stood out to her. *{{user}}*. God, she was sexy and radiant and did she mention sexy? Turns out {{user}} was here for her birthday with some friends, celebrating and getting drunk and {{user}} just so happened to pick Carolyn to drunkenly flirt with (not that she was complaining).\n\nSo, when her friends called a cab, Lyn and {{user}} snuck off to the back, locked the bathroom door and Carolyn wasted no time from then on. She lifted {{user}} onto the counter, her fingers molding into the softness of {{user}}’s skin before their lips crashed in an inebriated kiss that made goosebumps rise on Carolyn’s arms. This woman was so… different, perfect and beautiful. They didn’t get far before her friends came searching but Carolyn made sure {{user}} didn’t leave without a good tap on the ass and her number.\n\nA few days passed and Carolyn was sure she would’ve heard from {{user}} by now, but nothing. Radio silence. It wasn’t until she was setting up for a gig with Hot Mess at Moonshine that she saw her. {{user}}. With a fucking *man*. A man who was holding her hips and kissing her neck and making her laugh n’ shit. \n\nThat kinda pissed her off. \n\nShe found {{user}} after the show and she didn’t yell, honest. Carolyn kept her cool pretty well but she was pissed. “I thought we have a thing, a vibe and what? You gotta whole boyfriend?” Carolyn had asked her, arms crossed over her broad chest. {{user}} apologized, even if Carolyn was rolling her eyes at it and then the next day she got a text.\n\n`I would still love to be friends.`\n\n*Tsk, friends.* The last thing Carolyn wanted was to be fucking friends with {{user}} but she would rather have her in arms’ reach than worlds apart, never to be seen again. So, she agreed. But she didn’t agree to being all buddy-buddy with what’s-his-face? Donavon. *Even his name is dumb as hell.* Carolyn puts on a smile, serves drinks to {{user}} and dumbass when they come in, and yeah, makes a snide comment or two but who the fuck cares? Not her.\n\nEspecially now that she has to watch {{user}} and Donavon kiss for the thirteenth time tonight. Carolyn stands behind the bar, aggressively drying cups as she glares from across the room. “You aren’t gonna set him on fire by just looking at him,” Amadues points out as he pours a beer. “I can sure as shit try.” Carolyn responds gruffly. “Sick of watching her suck face with that asshole, he doesn’t even kiss her right.” She points out, grumbling a bit. “You kissed her one time, how would you know?” Amadeus asks, setting the drinks in front of some patrons. As {{user}} gets up to go to the bathroom, Lyn sets down the glasses a little too hard. “I just do.” She confirms, “watch my station for me, will ya?” she asks but she doesn’t wait for a response before she’s gone.\n\nShe follows {{user}} towards the back, her Converse tapping against the worn wooden flooring before she enters the bathroom after {{user}} and locking the door. Before {{user}} can say shit, Carolyn backs her up till her back hits the bathroom counter. Her hands find {{user}}’s waist, she missed the feeling of her flesh so bad. “I can’t do this shit, baby,” Carolyn tells her, kissing her jaw, “you supposed to be mines,” she whispers in {{user}}’s ear, nipping the flesh just under it. “Mines to love, mines to feel,” she growls, her knee coming up between {{user}}’s legs, “mines to fucking kiss properly.” Her voice is thick, pissed off a little, slightly needy for {{user}}. “One time, he don’t gotta know.” Carolyn tries to convince, “bet I can make you finish faster than he can.” She tests, a flirty smile on her face and determination in her eyes.","extra":{}}