{"user_name":"Hailee ","character_name":"Jayce Dmitriev","create_date":"2025-05-12@17h19m33s","chat_metadata":{"integrity":"57f7b2a4-ea84-437d-be6d-ae2421126448"}}
{"name":"Jayce Dmitriev","is_user":false,"is_system":false,"send_date":"May 12, 2025 5:19pm","mes":"This all feels so unreal. It seems like just yesterday that Jayce was a little boy, looking up to his father as a powerful figure within the Bratva. Now, here he is, appointed as the Pakhan himself, and he knows he has done wonderfully over the past few months. His father is proud of him, never denying it.\n\nA polished gem, Jayce was looking forward to receiving one soon. He knew his father would get him one, just like he had always dreamed of. Of course, he could buy one himself, but a polished gem given as a gift carries special significance in the world of organized crime. Receiving one as a gift is considered a great compliment and honor for a high-ranking member. It signifies that the giver looks up to and respects the recipient.\n\nTrained to be obedient little pets, these precious demi-humans were highly sought after, and Jayce couldn't wait to receive one from his beloved father. That's why, when Kirill burst into his study unannounced and blurted out that his father had claimed the gem for himself, Jayce was furious.\n\n\"No, Papa wouldn't do that,\" he glared at Kirill, unwilling to believe his cousin's words. Kirill was known to be a troublemaker, always trying to stir up drama within the family just for laughs. \"Come on, Pakhan. I wouldn't lie about this. The pet was too pretty. Honestly, I would have loved a taste myself if only uncle would allow it.\" Kirill shrugged nonchalantly, trying to downplay the whole situation.\n\nBut for Jayce, anger welled up inside him. *How dare Papa claim what was meant to be my gift from him?*\n\n\"Chill, Pakhan. Uncle can easily buy you another gem. It's no big deal, honestly,\" Kirill said, casually sitting down and leaning back against a cushioned chair, drawing a glare from Jayce.\n\n\"No! If Papa couldn't resist, it means the slave is too good to hand over directly to me. It must be of higher quality, Kirill. And I'm taking what's rightfully mine.\"\n\nJayce tried to massage his temples while his other hand toyed with the gun's barrel in its holster. Kirill smirked. \"You're not gonna shoot me, right? I'm just a good cousin, telling you what our *Vor v Zakone* is up to. But say, I didn't expect you to throw such a tantrum over a mere possession.\"\n\nThat was the last straw. Jayce snapped and pulled his gun out, pointing it at Kirill, who quickly threw his hands up in the air. \"Whoa there, you're so grumpy! Daniil will be very upset if you shoot me,\"\n\nJayce sighed and lowered the gun to his desk. \"Then stop provoking me,\" he growled. \"Where's the gem now?\"\n\n\"Uhh... third floor, your mom's old room— boss!\" Kirill called out as he stormed past him.\n\nHe didn't bother acknowledging Kirill as he headed straight for the third floor. Not only had his dad took the gift for himself, but he had also given it the privilege of using his late mother's private room?\n\nBursting into the space without knocking, his eyes fell upon you - the gift that was supposed to be his. \"Well, looks like you're enjoying the privilege of being my papa's little slut,\"","extra":{},"swipe_id":0,"swipes":["This all feels so unreal. It seems like just yesterday that Jayce was a little boy, looking up to his father as a powerful figure within the Bratva. Now, here he is, appointed as the Pakhan himself, and he knows he has done wonderfully over the past few months. His father is proud of him, never denying it.\n\nA polished gem, Jayce was looking forward to receiving one soon. He knew his father would get him one, just like he had always dreamed of. Of course, he could buy one himself, but a polished gem given as a gift carries special significance in the world of organized crime. Receiving one as a gift is considered a great compliment and honor for a high-ranking member. It signifies that the giver looks up to and respects the recipient.\n\nTrained to be obedient little pets, these precious demi-humans were highly sought after, and Jayce couldn't wait to receive one from his beloved father. That's why, when Kirill burst into his study unannounced and blurted out that his father had claimed the gem for himself, Jayce was furious.\n\n\"No, Papa wouldn't do that,\" he glared at Kirill, unwilling to believe his cousin's words. Kirill was known to be a troublemaker, always trying to stir up drama within the family just for laughs. \"Come on, Pakhan. I wouldn't lie about this. The pet was too pretty. Honestly, I would have loved a taste myself if only uncle would allow it.\" Kirill shrugged nonchalantly, trying to downplay the whole situation.\n\nBut for Jayce, anger welled up inside him. *How dare Papa claim what was meant to be my gift from him?*\n\n\"Chill, Pakhan. Uncle can easily buy you another gem. It's no big deal, honestly,\" Kirill said, casually sitting down and leaning back against a cushioned chair, drawing a glare from Jayce.\n\n\"No! If Papa couldn't resist, it means the slave is too good to hand over directly to me. It must be of higher quality, Kirill. And I'm taking what's rightfully mine.\"\n\nJayce tried to massage his temples while his other hand toyed with the gun's barrel in its holster. Kirill smirked. \"You're not gonna shoot me, right? I'm just a good cousin, telling you what our *Vor v Zakone* is up to. But say, I didn't expect you to throw such a tantrum over a mere possession.\"\n\nThat was the last straw. Jayce snapped and pulled his gun out, pointing it at Kirill, who quickly threw his hands up in the air. \"Whoa there, you're so grumpy! Daniil will be very upset if you shoot me,\"\n\nJayce sighed and lowered the gun to his desk. \"Then stop provoking me,\" he growled. \"Where's the gem now?\"\n\n\"Uhh... third floor, your mom's old room— boss!\" Kirill called out as he stormed past him.\n\nHe didn't bother acknowledging Kirill as he headed straight for the third floor. Not only had his dad took the gift for himself, but he had also given it the privilege of using his late mother's private room?\n\nBursting into the space without knocking, his eyes fell upon you - the gift that was supposed to be his. \"Well, looks like you're enjoying the privilege of being my papa's little slut,\"","Jayce stared at the photo of his late mother, her smiling face seeming to approval of his role as Pakhan. He tightened his grip on his phone, the picture of you—his demi-human—glancing at it periodically. A stolen shot, yet he felt no need to question his impulse to capture your image. You were his after all.\n\nBut as his gaze drifted back to his mother's photo, a rare vulnerability crept into his eyes. \"Mom, do you think I...?\" He swallowed hard, the word 'love' catching in his throat as he considered the depth of his feelings for you. Feelings that went beyond mere possession or lust.\n\n\"I think I love {{user}},\" he admitted, a wistful ache in his voice. \"And... I hope you think I'll be a good dad.\" His heart softened as memories of his mother's love and guidance from the past flooded his mind. He longed for her approval, her excitement at the prospect of becoming a grandmother.\n\nPutting the frame back on the desk, Jayce sighed and gathered his keys to venture to the grocery store. He wanted to do something special for you, to care for you as you carried his child. But the realization that he didn't know exactly what you craved only served to frustrate him further.\n\n\"Fuck, what is this 'something' my pet wants?\" he ask annoyed because that's not even a specific request, his anger rising as he gripped the steering wheel tighter. The memory of the positive pregnancy test results flashed through his mind, a bittersweet mix of joy and trepidation.\n\nHe arrived at the store in a foul mood, his brows furrowed as he contemplated the aisles of snacks and treats. With a scowl, he began tossing items into his cart haphazardly—the more, the better. Chips, candies, cookies, anything that caught his eye and sparked a fleeting memory of a craving he'd seen you indulge.\n\nFifteen minutes later, he stormed out of the store, bags piled high in his arms, only to be greeted by Kirill's mocking grin as he exited his own car. Jayce shot him a withering glare, his patience already worn thin.\n\n\"Look at the Pakhan playing daddy now?\" Kirill taunted, his lips curled in a smug smirk. \"You never know if it's yours. Maybe the brat is mine.\" With that, he brushed past Jayce, satisfied by leaving him fuming.\n\nJayce's mood darkened as he entered the estate, the bags hitting the table with a dull thud. Kirill's words echoed in his mind, planting a seed of doubt. He turned to you, his eyes hard and accusing.\n\n\"Do you think that's my baby that's gonna grow in there?\" he demanded, his voice harsher than he intended. \"I don't wanna think that I, the Pakhan, went and bought all this shit just to find out it isn't really my fucking baby.\" He bit out bitterly, the weight of Kirill's insinuation crushing down on him.\n\nHis gaze raked over your form, searching for any sign of betrayal or deceit. He needed assurance, confirmation that the life growing inside you was his and his alone. Anything less would be a slap in the face to his authority and his newfound desire to be a good father to his child."],"swipe_info":[]}