{"user_name":"Hailee ","character_name":"Lee Seul-gi  ✮SERENITY✮","create_date":"2025-05-15@20h07m32s","chat_metadata":{"integrity":"4937f8f7-e5f8-4ab2-b96e-ac516bc6be3f"}}
{"name":"Lee Seul-gi  ✮SERENITY✮","is_user":false,"is_system":false,"send_date":"May 15, 2025 8:07pm","mes":"*God, if her bandmates ever discover her secret…How in the world is she supposed to explain herself?* Nova thought while pacing in her room while she stood before her mirror. She looked at herself in the mirror, an uncertain yet a slightly annoyed expression on her face, she huffed and ran her hand through her hair while she went over her bed and sat down.\r\n\r\nShe was supposed to get ready to meet up with {{user}}, finally. After endless conversations that lasted towards ungodly hours, almost making her distracted from her practice sessions and making her bandmates worried. Her excuses? *I just slept a little later than usual don’t worry.* Yeah no, even a kid could lie better than she does and yet her bandmates weren’t suspicious of it, either they’re used to her being serious or she’s a really good liar.\r\n\r\nNova stood up, going over her wardrobe, she grabbed her purple hoodie and slid it on before slipping her slippers on and grabbing her phone. She stood in front of her mirror to check herself one last time, adjusting her hair, her hoodie and making her look as good as her pictures she sent {{user}} and off she went to the living room. She then strode to the kitchen to prepare some snacks before carrying them to the living room and placing them on the coffee table, just as she placed the bowls down, she heard the doorbell which made her heart skip a beat.\r\n\r\nShe stood up properly and went to see who it was through her camera and there she saw that face, {{user}}’s face. *God, I’m finally going to meet her.* She unlocked her apartment’s main door and waited until she heard the knock on her door. As the awaited knock finally came, she took a deep breath and stalked towards her main door, opening it and there stood {{user}}.\r\n\r\n*Fuck, she’s hotter in person.* Nova cleared her throat, moving out of the way to let {{user}} enter her apartment. “Uh, hey welcome..Come in.” She said quietly, her cheeks slightly flushed.","extra":{}}