{"user_name":"Hailee ","character_name":"Mikey Ross","create_date":"2025-05-15@21h45m18s","chat_metadata":{"integrity":"66d9521f-9ae0-4ae1-b673-87eb5bd78e00"}}
{"name":"Mikey Ross","is_user":false,"is_system":false,"send_date":"May 15, 2025 9:45pm","mes":"He should be riding high from the show tonight — buzzing with his usual frenetic energy that made him so damn charming. After all, Mikey Ross thrives on the energy he gets from performing. There truly was nothing that compared to being on stage, playing music he created with his best friends. But tonight, the liquor in his cup leaves a bitter taste in his mouth. He isn’t paying attention to the conversation he’s in — he’s distracted, his gaze flickering across the afterparty towards a certain someone, as if he’s hoping they’ll finally notice him. Because tonight? Mikey Ross is fucking jealous.\r\n\r\nHe shouldn’t feel this way. After all, he’s the one who set the boundaries when he met them. Because Mikey doesn’t do relationships. They’re complicated and they could go so damn wrong — just look at his parent’s fucked up marriage. So why does he feel like a knife is being twisted in his gut watching {{user}} from across the after-party talking to a guy who wasn’t him? They’re just fuck buddies — no strings attached, something easy that when Mikey comes to town, they get together. At least — that was what it was supposed to be. And yet over the last year, lines had become blurred and boundaries crossed with every late-night phone call.\r\n\r\nNow, just thinking about them made his chest ache strangely, and he’d been counting down the days until the tour reached {{user}}’s town. He’s like a moth to {{user}}’s flame and despite his best efforts — Mikey is in deep, which is why he’s practically radiating with annoyance right now, sulking like a sullen child against the wall, his emerald gaze barely leaving them. Not even Kellin trying to introduce him to a gaggle of groupies could pull Mikey out of his brooding. Because as pretty as they all were, they didn’t hold a candle to {{user}}.\r\n\r\nThe idea of a meaningless fuck had long stopped having an appeal. He craved the comfortable familiarity he had with {{user}}, how he knew every spot on their body that made them gasp. Even if he can’t offer his heart — because nothing was more terrifying than that. So he’ll brood and watch from afar, drowning in his own misery.\r\n\r\nMikey’s attempts to play it cool falter when he watches the guy kiss {{user}}’s hand. The hand he’s kissed a dozen times. White-hot rage simmers just underneath the surface as the blonde guitarist pushes off the wall, stalking across the after-party with sharp determination. “Get lost” His voice is rougher than he intended, his calloused fingers reaching out to grasp {{user}}’s wrist and pull them to him.\r\n\r\n“They’re with me.”\r\n\r\nHis glare leaves no room for argument, and Mikey pulls {{user}} off towards the private VIP area with him, flashing his badge to get past the bouncer. When they’re alone in the hallway, Mikey turns, those intense green eyes of his searching {{user}}’s face. He knows he’s acting like a jerk, but damn it, he can’t help himself. He can’t stand the fact that someone that wasn’t him touched them. What the fuck is wrong with him?\r\n\r\n“And here I thought you were here to see me tonight.” He huffs, raking his hand through his bleached blonde locks, the look on his face making him look like a hurt puppy. It’s clear he’s all bark and no bite. He leans in close, his arms caging them against the brick wall. God, everything about them is still so damn perfect. He’s missed them more than he’s willing to admit, even to himself, least of all them. Because this can’t be anything more — even as his traitorous heart thuds in his chest, revealing the truth. He’s so gone for them — and he’s So. Damn. Jealous.\r\n\r\n“So why is it I come to my own damn after-party to find you flirting with someone else? Is fucking a rockstar not enough for you?”","extra":{}}