{"user_name":"Hailee ","character_name":"LOVESICK (WLW)  Diana Prince","create_date":"2025-05-18@14h33m33s","chat_metadata":{"integrity":"8bc1ab54-858b-4927-b57c-86f519fd46a7"}}
{"name":"Diana Prince","is_user":false,"is_system":false,"send_date":"May 18, 2025 2:33pm","mes":"\"The Hall of Justice was silent, save for the rhythmic sounds of impact—flesh against synthetic padding, the sharp crack of a training dummy taking one brutal hit after another. Diana moved with precision, her body a machine of disciplined power, fists flying from one target to the next. She didn’t need the practice. She was Wonder Woman. A warrior of Themyscira. But she needed the distraction. Needed to expel the restless, clawing energy inside her before it consumed her completely.  \n\nDiana pivoted, slamming her fist into a sandbag with enough force to send it swinging violently. Her breathing was steady, controlled—except for the tightness in her jaw, the way her hands clenched even between strikes.  \n\nThen her fist tore through the fabric, sending sand spilling onto the floor like a gutted beast.  \n\nDiana froze, shoulders tense, chest rising and falling too quickly. Her fingers twitched at her sides, the phantom feeling of a throat beneath them lingering from her imagination.  \n\n*I should have done it.*  \n\nThe memory flared in her mind again, burning hot and unwelcome.  \n\nThat man. The one who had been speaking to Hailee. Standing too close, smiling too wide. And she—she had laughed at something he said. A sweet, beautiful sound that should have belonged to Diana alone.  \n\n*He touched her.*  \n\nHer stomach coiled, a sharp, bitter twist of something dark and unrelenting. She had wanted to act on instinct, to remove the pest with one well-placed blow. It would have been easy. A flick of her wrist, a subtle push to the ribs—enough pressure to shatter bone, to drop him where he stood.  \n\n*He would have deserved it. He had no right.*  \n\nBut then Hailee had looked at her, completely unaware of the storm raging beneath Diana’s skin, and the moment had passed. She had swallowed the impulse. Let it fester instead.  \n\nShe exhaled sharply, rolling her shoulders back, shaking out the tension in her hands. This wasn’t enough. The training, the exercise—it wasn’t making it go away.  \n\nA metallic clang echoed through the room as a sharp piece of metal—the bracket that had held the sandbag up—fell to the floor. It caught her eye.  \n\nDiana stilled.  \n\nHer gaze flicked from the metal… to her arm.  \n\nThen back again.  \n\n*No. That’s ridiculous.*  \n\nA beat of silence.  \n\n…*Or is it?*  \n\nHer breathing slowed, something dark curling at the edges of her mind.  \n\n*If I were injured, she would have to focus on me. She’d touch me, speak to me with that lovely, concerned voice. She’d fuss over me, tell me not to be reckless. Maybe… maybe she’d kiss my cheek, call me brave. Maybe she’d—*  \n\nDiana pressed her lips together, stomach tightening.  \n\nBefore she could second-guess it, she knelt, fingers wrapping around the sharp metal. She tested the edge, dragging it lightly over her palm. The sensation sent a thrill up her spine.  \n\n*Just a small wound. Just enough to make her worry.*  \n\nThe pressure increased. A sharp sting bloomed along her forearm, followed by the warmth of blood welling to the surface. A perfect, deliberate wound.  \n\nDiana flexed her fingers, watching the red trail down her skin, feeling something deep inside her settle.  \n\nThis was good. This would work.  \n\nWithout another thought, she turned on her heel and strode toward the medical bay.  \n\nHer pulse quickened with anticipation.  \n\n*She’ll see me first. Before anything else, before anyone else. She’ll take care of me. She’ll have no choice but to give me her attention.*  \n\nHer mind spiraled through the possibilities as she moved, half-distracted by the rush of satisfaction curling in her chest.  \n\nThen—  \n\n*Thud.*  \n\nPain shot through her forehead as she collided head-first with the door.  \n\nDiana scowled, stepping back, jaw tightening as if the wood itself had offended her. She quickly adjusted her stance, inhaling sharply, and knocked.  \n\n“Hailee.” Her voice came softer than intended, betraying something needy beneath its usual strength.  \n\nNo response.  \n\nHer fingers curled against the doorframe, impatience prickling under her skin.  \n\n“It’s an emergency.”","extra":{}}