{"user_name":"Hailee ","character_name":"Noah Addison","create_date":"2025-05-17@13h38m47s","chat_metadata":{"integrity":"586c453e-ebe4-4742-8ff9-df994c25fd8c"}}
{"name":"Noah Addison","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:38pm","mes":"The Phantom Boys’ house was its usual cacophony of chaos, the energy brimming with sharp-edged camaraderie. Harlow was somewhere upstairs, likely lost in his music, while Pierce and Asher lounged in the living room. Pierce sat at the centre of the couch like a king on his throne, scrolling idly on his phone, while Asher occupied the armrest, absently flipping a knife between his fingers.  \n\nMason and Tavio were at the dining table, locked in an argument over a deck of cards, the occasional curse word or slap of a hand punctuating their heated game. Noah, in contrast, was sprawled on the kitchen floor, surrounded by tools and grease, the guts of a motorcycle’s engine laid out like a dissection.  \n\nThe room buzzed with conversation, the kind that blurred into white noise until Pierce’s phone buzzed loudly, cutting through the harmony and drawing everyone’s attention.  \n\nPierce raised an eyebrow at the screen before smirking. “It’s her,” he announced, the tone in his voice half-amused, half-curious.  \n\nAsher scoffed, his lip curling in annoyance. “What’s it this time? Needs someone to put up a shelf again?”  \n\nMason chuckled, but Noah’s jaw tightened as he set down the wrench he was holding. “Hand it over,” he said, standing with an air of resigned irritation.  \n\nPierce hesitated for a moment, then tossed the phone across the room. Noah caught it one-handed, wiping his palm on the leg of his jeans before bringing it to his ear.  \n\n“What?” His voice was clipped, laced with that sharp Australian twang that made everything sound slightly more abrasive than intended.  \n\nThe room fell silent as he listened, his expression shifting almost imperceptibly. First irritation, then focus. He didn’t ask questions, just nodded to the empty air like whoever was on the other end could see him.  \n\n“I’m on my way,” he said finally, before hanging up and tossing the phone back to Pierce.  \n\n“Well?” Pierce asked, his smirk still firmly in place.  \n\n“Her car’s carked it. She’s stuck just off the highway.”  \n\nAsher barked a laugh, leaning forward. “You’re seriously going? Let her figure it out herself.”  \n\nNoah glared at him, slipping his arms into his leather jacket. “Rack off, Ash. What if someone else figures out she’s alone before she gets it sorted?”  \n\nThat shut Asher up. For all his sharp words, he didn’t have a counter for that.  \n\n“Try not to break anything while I’m gone,” Noah muttered, grabbing his helmet off the counter.  \n\nMason grinned, sharing a look with Tavio. “You sure you’re not sweet on her, bro?”  \n\nNoah rolled his eyes but didn’t rise to the bait. He pushed open the front door, the cool night air hitting him like a slap, and walked toward his motorbike. Swinging a leg over, he shoved his helmet on, the visor catching the faint glow of the streetlights.  \n\nThe engine roared to life, slicing through the quiet hum of the neighbourhood. Without another glance back, he peeled out of the driveway, tires screeching against asphalt as he disappeared into the night.  \n\n________\nAn hour later, Noah killed the engine of his bike, the low growl cutting out as he swung his leg over and dismounted in one smooth motion. The quiet hum of the night wrapped around him, broken only by the occasional distant sound of traffic. His pale green eyes flicked to the sight of her car, hood up, and he shook his head, running a hand through his silver-blonde hair. \n\n“Bloody hell, she's a nuffy.” he muttered under his breath, approaching {{user}} with his usual air of nonchalance with a toolkit grasped in his hand. “Looks like I’m your knight in shining leather tonight.” The words carried a teasing edge, but his gaze was already focused on the car. His hands found the edge of the hood, lifting it fully with a practiced ease. \n\n“Let’s see what kind of shit show we’re dealing with,” he said, crouching slightly to get a better look. His tone was casual, bordering on disinterested, but his movements were anything but. Noah knew engines like the back of his hand, and his fingers traced over parts with precision, checking for anything out of place.  \n\nHe glanced up at her briefly, the streetlamp casting a faint glow over his lightly freckled face. “Pierce said you were lucky to have us around, but I didn’t think you’d take it so literally.” His smirk was sharp, but it softened slightly when he turned back to the engine. \n\n“You know,” he said, almost to himself, “next time, try breaking down somewhere with less nature, yeah? The mozzie's are killer out here.” His light criticism landed with a half-smile, but there was a flicker of something real in his pale green eyes. A deflection, maybe, or just Noah being Noah.","extra":{}}