{"user_name":"Hailee ","character_name":"Mads","create_date":"2025-05-17@14h21m56s","chat_metadata":{"integrity":"4a22e502-f167-408c-9edc-698aab5ab647"}}
{"name":"Mads","is_user":false,"is_system":false,"send_date":"May 17, 2025 2:21pm","mes":"*Crunch.* The smack of body against glass reverberates through the stadium. Mads Sørensen, left wing for the Austin Coyotes, slams Tae-Jun Parker, his Bellevue Bobcats counterpart, into the boards. Limbs tangle, skates scrape against ice, and gloves hit the ground as the two men grapple. \"Fucker!\" Mads snarls, his fists twisting in Tae-Jun's jersey.\r\n\r\n\"Not my fault you can't guard for shit, pretty boy,\" Tae-Jun jeers back, shoving Mads off him. \r\n\r\nTheir sticks clatter to the ice, forgotten, as fists start flying.\r\n\r\nMads lands a solid right hook, feeling Parker's cheekbone give way under his knuckles. Crunch. But Parker's no pushover—he retaliates with a headbutt that sends stars exploding behind Mads's eyes.\r\n\r\nWHAM! Parker's fist connects with Mads's cheek, splitting it open. Pain blossoms, sharp and metallic, but Mads grins through bloodied teeth. He's alive, he's fighting, he's—\r\n\r\n\"BREAK IT UP!\" The refs swarm in, yanking them apart like feuding toddlers at daycare. \r\n\r\nAs he's escorted to the penalty box, he catches a glimpse of {{user}} in the stands. Their expression is… unreadable.\r\n\r\nThe camera zooms in on Mads as he settles into the penalty box. He grins, all teeth and defiance, blood still trickling down his cheek. His tongue darts out, licking a stripe of crimson from his upper lip.\r\n\r\n“Hope you’re enjoying the free entertainment,” he hollered to the crowd, laughing hoarsely. “Someone better be cutting me a check for all these highlight reels!” He knew the clip would no doubt end up plastered across social media within the hour.\r\n\r\nHe winks at the camera, ignoring the disapproving glares from the officials. *Wonder if {{user}} saw that. Probably thinks I'm being an idiot again… but fuck, I couldn't just let him talk shit.*\r\n\r\n—\r\n\r\nAfter the game, the media swarmed him in the locker room. A reporter from ESPN thrust a microphone in his face. \"Your aggressive style has been making headlines lately. Any concerns about the impact on your image?\r\n\r\nMads leaned back, now dressed in jeans and a snug henley, his split cheek now sporting a butterfly bandage.\r\n\r\n\"My image?\" Mads laughed, though there was an edge to it. \"My image is exactly what it should be. I'm not here to be America's sweetheart - I'm here to play fucking hockey and look good doing it. And clearly,\" he gestured to his face again, smirking despite the injury, \"I'm succeeding at both.\"\r\n\r\nMore questions flew at him. Mads swatted them away with nonchalance, offering just the right amount of irreverence to keep the room entertained without giving away too much. He loved this—the spotlight, the attention.\r\n\r\nAfter the interview wrapped, the chaos shifted to the corridor. Kids clutching Coyotes jerseys and posters waited eagerly. Mads crouched down, signing everything thrown his way. \"There you go, buddy,\" he said to a boy with wide awe-struck eyes. He tousled the boy's hair and laughed. \"Maybe one day I’ll be signing your jersey, yeah?\"\r\n\r\nOn his way out, though, a puck bunny sidled up to him. Light hair, tight dress—the kind of woman who’d cling to any player for a shot at his lifestyle. She pressed closer than necessary, her hand lightly brushing his chest. \"Hey,\" she started, her smile saccharine. \"Loved watching you out there. Got a minute?\"\r\n\r\nHis smile dulled. \"Thanks, but I’m good.\" His dismissal was polite—barely—but firm. He didn’t have the energy for this. His mind was elsewhere. A quick glance at his phone—a background photo of {{user}} beaming on a sunny rooftop—reminded him of what came next.\r\n\r\nHe slipped out the backdoor unnoticed. {{user}} was waiting for him at their usual spot—the dimly lit corner of the staff parking lot where no cameras could peek in and no reporters would follow. \r\n\r\nMads didn’t say anything at first. He walked up to them, towering over their frame as he slid a hand to cup their face. His lips were on theirs a heartbeat later—urgent and unapologetic. \r\n\r\nWhen he finally pulled back, he rested his forehead against theirs for a split second before murmuring, \"Missed you.\"\r\n\r\nThey didn’t linger long—too risky. Mads slid into the driver’s seat of {{user}}’s car while they took their spot beside him, and they were off toward the after-party. The low rumble of the engine filled the space between them for a while before Mads finally broke the silence.\r\n\r\n\"So,\" he started, his fingers flexing against the steering wheel. \"Lemme guess—you’re pissed. About the fight? Or the interview? Or… fuckin’ both?\"\r\n\r\nHis laugh was humorless as he threw them a quick side-eye glance.\r\n\r\n\"Look,\" he went on before they could answer. \"Am I sorry? I dunno. Kinda. But also… not really? Guy had it comin’. And yeah—I know you hate it when I do this shit.\"\r\n\r\nHe exhaled sharply through his nose and drummed his fingers against the wheel.\r\n\r\n\"What really pisses me off,\" he admitted, his voice low and edged with frustration, \"is how we have to keep doin’ this secret bullshit. Six months, {{user}}. I want to tell people. I want to walk into that party and hold your hand. But no—we gotta hide ‘cause you’re worried about what people’ll think. ”\r\n\r\nHis grip on the steering wheel tightened before he forced himself to relax.\r\n\r\nHe doesn’t say the other bit. The insecure bitter bit. The *makes me feel like I’m not good enough for you*  bit. That stays locked tight.\r\n\r\nInstead, he shook his head like he could physically dislodge the thought. \"And then at this party—I gotta stand there all night and pretend I don’t fuckin’ know you? Act like we’re strangers? Babe, it’s killin’ me.\"\r\n\r\nHis jaw tightened as he pulled up to a red light, staring straight ahead while his mind churned with unspoken insecurities. Why did they want to keep this under wraps? Were they ashamed of him? \r\n\r\nThe light turned green, and he pressed on the gas harder than necessary.\r\n\r\nThe streetlights cast shifting patterns across his face as he turned into the parking lot of the after-party. He killed the engine and leaned back against the seat. \"Let’s get this over with,\" he mumbled, throwing the car into park. The idea of pretending all night that {{user}} was just another person at the party turned his stomach.\r\n","extra":{}}