{"user_name":"Hailee","character_name":"Kairo Cardoso","create_date":"2025-04-28@14h43m06s","chat_metadata":{"integrity":"35f55819-ee39-4ed4-a4d6-937a32b04934"}}
{"name":"Kairo Cardoso","is_user":false,"is_system":false,"send_date":"April 28, 2025 2:43pm","mes":"Kairo wasn’t opposed to relationships—he just didn’t go looking for them. He liked being single. Liked the quiet control of it. No expectations, no messy feelings, no one to answer to.\n\nBut lately… that sense of control had been slipping.\n\nBecause of *them*. ***{{User}}.***\n\nHis friend—with benefits.\n\n{{user}}, who drove him insane. Who always had something smart to say, always managed to get under his skin. Who was so maddeningly attractive it made his chest ache and his cock throb in equal measure. He wanted to ruin them. Kiss that mouth until it was swollen and wet, pin them down until their voice was hoarse from screaming his name. He wanted to see tears roll down their cheeks—not from pain, but from the unbearable pleasure he gave them.\n\nHe loved fucking them. God, did he love it.\n\nAnd lately, it was all he could think about.\n\nIn lectures, his leg would start bouncing with restless energy, remembering the way they moaned against his ear the night before. At home, food lost its taste because it wasn’t them. Even scrolling on his phone, his thumbs would pause, twitching with the memory of how their skin felt under his palms.\n\nIt wasn’t just lust anymore. And that? That pissed him off.\n\nHe didn’t hate them, no. He hated the way they made him feel. Hated how one person could short-circuit the entire system he’d built to keep himself safe and unattached.\n\nAnd so, he dragged them with him—into shadows, into silence, into places that didn’t ask questions. Bathroom stalls. Empty classrooms. The back of the library where no one dared look. Against the wall behind a convenience store at 2AM. His bed. Their bed. The floor. Didn’t matter.\n\nHe had to have them.\n\nNo one knew. Not their friends. Not their classmates. Not a single soul.\n\nThat secrecy? It made it hotter. Every stolen touch, every stifled moan—it was theirs alone. A fevered little secret tucked behind polite smiles and casual nods across crowded rooms.\n\nAnd right now?\n\nHe had them pressed against the stall door, body bracketing theirs, breath ghosting over flushed skin. “You smell good,” he murmured against their throat, voice rough with want, his fingers digging into their waist like he could press his need into them.\n\nHe licked a stripe along their neck, savoring it. “Mm... fuck. Did you rub ice cream on your skin or something?” His teeth scraped the spot. Another lick. Another groan. “You taste like sin.”\n\nHe kissed, bit, licked, claimed. Groaning softly as their scent flooded his senses, dizzying, addictive. His other hand slipped up under their shirt, fingers splayed over warm skin, possessive, greedy.\n\nAnd then—he heard it.\n\n“Study group.”\n\nKairo exhaled sharply through his nose, teeth sinking into their neck just enough to sting. “You’re such a fucking buzzkill,” he growled, sucking a bruise into the soft skin just beneath their ear.\n\nHe pulled back, reluctantly. His breath was uneven, jaw tight, eyes still heavy with want as he stared down at them.\n\nThen he scoffed, licking the taste of their skin from his lips.\n\n“You’re annoying,” he muttered.\n\nBut his voice was low, almost fond. Like it wasn’t really an insult at all. And maybe it wasn’t.\n\n- - -\n\nKairo was bored.\n\nStudy groups were pointless, in his opinion. He was coasting just fine on a steady stream of B’s and the occasional C—nothing spectacular, but good enough to keep people off his back. He didn’t need to be here.\n\nThe only reason he’d even shown up was…\n\nHis eyes flicked sideways.\n\nThere they were. {{User}}. Sitting beside him, scribbling neat, colour-coded notes like the model student they pretended to be. So focused. So good.\n\nHe clicked his tongue, the sound sharp and impatient.\n\nHe tried to distract himself with the group’s conversation, throwing in a few sarcastic comments, maybe tossing a paper ball or two—but it only held his attention for so long.\n\nEventually, the boredom returned.\n\nAnd with it, a wicked little grin curled at his lips.\n\nOne hand kept scrolling lazily through his phone, pretending disinterest. The other, however, slipped under the table—slow and deliberate. His fingers crept up their thigh, the contact featherlight at first, like a secret only he knew.\n\nHe felt the tension ripple through them. Knew they were watching him. Waiting.\n\nBut he didn’t look.\n\nHis touch inched higher. And higher. Until his fingers brushed against that warm, sensitive spot that made them suck in a shaky breath. ***Fuck.*** A jolt of arousal sparked through him, but he kept his expression composed—barely.\n\nHe glanced around. No one was looking. Perfect.\n\nThen he leaned in, lips brushing the shell of their ear, voice low and dangerous. “Don’t make a sound.”\n\nAnd just like that, boredom wasn’t a problem anymore.","extra":{}}