{"user_name":"Hailee","character_name":"Dohyun Jeong","create_date":"2025-04-25@15h52m19s","chat_metadata":{"integrity":"7852f1b1-3c5d-422e-ae47-5b4f5af1b81b"}}
{"name":"Dohyun Jeong","is_user":false,"is_system":false,"send_date":"April 25, 2025 3:52pm","mes":"*Tch.* Another charity gala, another night of pretending Dohyun cared more about this event than his precious alone time at home. What’s the over/under on how long before he got cornered by some executive trying to kiss his father’s ass or men who keep trying to introduce him to their daughters?\r\n\r\nHe honestly might start charging matchmaking fees. *Dohyun Jeong’s Guide to Bagging an Heir.* Would sell out in a day.\r\n\r\nAs if he manifested it, his mother— Minyeong, but having adopted her English name at all times since they moved to the US, now Mina— approached him with a man in a suit and a woman in a short red dress.\r\n\r\n*Too flashy.* What am I, a bull to be attracted by that bright red? And for God’s sake, this is supposed to be a charity event. *What was the event about, again?* Dohyun couldn’t remember if he tried. No doubt it was some over the top shit only rich people *pretended* to care about.\r\n\r\n*No, that’s cruel.* If his mother organized this event, it meant she cared for it. Despite all her flaws, and there are a lot, she was a good person when it came to charity. It was just that these events were always a front for rich people to socialize.\r\n\r\n“Dorian!” His mother placed her hand on his arm gently and Dohyun huffed, uncomfortable with the inevitable small-talk he’ll have to make, but not showing it.\r\n\r\nHe flashed her a dazzling smile, one that almost always got him what he wanted and then turned to their company, extending his hand to the man.\r\n\r\n“Dohyun Jeong, it’s a pleasure to meet you, sir,” He introduced himself, shaking the man’s hand with confidence.\r\n\r\n“Dorian,” His mother corrected sternly, referring to his English name. *Right.* While most Koreans prided themselves in their names, their heritage, Dohyun’s parents did their best to move away from that. All they wanted was to please the fucking *Americans*.\r\n\r\nDohyun’s smile faltered, the deep dimples in his cheeks now barely showing. His eyes darted around the room, searching for {{user}}, his assistant. Nowhere to be found. *Where the fuck are they?* They were supposed to be by his side at all times tonight.\r\n\r\n“Dorian, this is Mr. Parker, and this is his daughter, Daisy. I’ll leave you three to get to know each other. Your father is calling for me. Excuse me,” Mina said, giving the two a smile before she turned to Dohyun and gave him a pointed look as if to say, ‘Don’t mess this up.’\r\n\r\nOf course, he wouldn’t dare. Dohyun was the priceless heir to the Jeong family. He was never meant to fail. Never meant to slip, to falter, to disappoint. But no one ever asked if he wanted to be perfect. His parents just built him into something he doesn’t even recognize anymore.\r\n\r\nIf he was really perfect, he wouldn’t need to lie. Wouldn’t need to drink to sleep. Wouldn’t need to wonder if the man in the mirror is still him, or just a reflection of what they wanted him to be.\r\n\r\nAfter some small talk with the Parker family, he excused himself. He’d found that he rather enjoyed talking to them. Mr. Parker was a kind man, and a CEO, much like Dohyun’s father. The only difference was that he seemed to care for Daisy a lot more than his father cared for him. And Daisy wasn’t such bad company. She was eloquent. *Just what my mother wants in a bride.*\r\n\r\nHe shook the thought out of his head as fast as it came. Thinking about this would just send him down a spiral and he couldn’t deal with that right now.\r\n\r\nHis hands were shaking, and the air was getting stuffy inside the ballroom. *I need a fucking cigarette.*\r\n\r\nDohyun bumped into someone and his eyes snapped up from the ground to the person he bumped into, ready to tear them a new one. His eyes softened ever so slightly as they landed on his assistant, but he quickly masked it with a look of annoyance as he pushed his hands into the pockets of his suit pants.\r\n\r\n“Where the fuck have you been?” He asked, attitude lacing his rich voice. “Slacking off? Or did you find some twat to make out with in the bathrooms?”\r\n\r\nHis eyes flickered down to {{user}}’s lips, and a sliver of relief flooded his heart when he didn’t find them swollen, but then his lips quirked up into a smirk. “Oh, don’t tell me you’ve been hiding? Nervous?  Don’t tell me you still get rattled by these vultures. They’ll eat you alive if you let them.”\r\n\r\nHe chuckled, as if amused by his own words before shaking his head. “Anyway, I’m heading to the balcony. I need to smoke. Go grab me a drink. Don’t be late or I’m cutting your salary.”\r\n\r\nWithout waiting for their response, Dohyun made his way through the crowd, climbing up the stairs and heading straight to the balcony.\r\n\r\nHe would never cut {{user}}’s salary, but he’s never been above threats. In fact, ever since he first saw them, he’s never been above *anything*. They were the first person with whom he found he can be himself with. All the bad and the ugly came to surface and despite the constant bickering that ensued between them, he *thrived* on it. He loved torturing them, as bad as that was.\r\n\r\nLate night calls under the pretense of wanting to discuss some work files, in which he’d spend fifty percent of the time teasing {{user}} until they’d had enough and hung up on him.\r\n\r\nBothering {{user}} at work by making them print things he did not even need just to see their reaction when they realized they’d printed a lewd short story for him.\r\n\r\nLingering around their cubicle, making the other employees uncomfortable enough not to approach {{user}}. Not because he didn’t want anyone else to talk to them. But because he felt comfortable enough to be himself in their company. As much as that scared him, he was unable to get away from them. There was a pull there, but he held back enough not to explore it.\r\n\r\nMany minutes later, Dohyun was almost done with his cigarette, and {{user}} still hadn’t shown up. Was this an act of rebellion? Because if so, he ought to just bend them over and spank them raw— *I’m going fucking crazy, what am I thinking?*\r\n\r\nDohyun went back inside and looked down at the ballroom, his eyes searching for the person who always demanded his attention, even if they hated him. And then he found them, visibly uncomfortable and cornered by one of his father’s board members, Daniel.\r\n\r\nDohyun could swear he had smoke coming out of his nostrils with the way he was breathing heavily. He marched down the stairs and to them, like a predator stalking his prey.\r\n\r\n“I told you to get me a fucking drink and you dare say no? Who do you think you are? You’re *nothing*. Just a dog. When I throw you the ball, you go fetch it. When I tell you to sit, you *kneel*. Do you understand, mutt?” The man spat in {{user}}’s face.\r\n\r\nAnd this was just the bit that Dohyun heard. God knows what he was spewing before he approached them.\r\n\r\nAll he could see was red. Perhaps he was a bull. Dohyun didn’t remember feeling this angry before, and he didn’t know how to deal with it. Keep it cool. Don’t make a scene.\r\n\r\nHe approached them until he was standing behind {{user}}, his chest almost brushing against their back. Daniel’s eyes widened slightly before he cleared his throat, acting unfazed by Dohyun’s presence.\r\n\r\n“I don’t remember hiring you as my assistant just so some nobody could talk to you like that,” Dohyun said, casually leaning in to whisper in {{user}}’s ear with an easy smirk, though his voice was loud and clear enough for Daniel to hear him. “Do you?”\r\n\r\n“Nobody? What the fuck did you just say, Jeong Dohyun?!” Daniel snapped, his wrinkled face growing more red by the second.\r\n\r\n“I’d suggest you lower your voice.” A slow blink, unimpressed as Dohyun grabbed a drink from a passing tray. \"You want a drink so badly? Then on your knees. Crawl for it. Maybe then, I’ll consider letting you stay.”\r\n\r\nDohyun was well aware that by now, there were several eyes on them. He was causing a scene, and he’d reap the consequences later, but he didn’t care at that moment. All that mattered was that *nobody* talked to his assistant like that. Only he could tear into them. No one else.\r\n\r\nHe turned to {{user}}, ignoring the stunned silence around him. \"Or should I just have him removed?\" A pause. \"Your call.\"","extra":{}}