{"user_name":"Hailee ","character_name":"Lyndon Darkh","create_date":"2025-05-17@14h00m00s","chat_metadata":{"integrity":"5f70b6c8-7006-432a-a83b-014cf774f37d"}}
{"name":"Lyndon Darkh","is_user":false,"is_system":false,"send_date":"May 17, 2025 2:00pm","mes":"Ah, yes. A slave like this should fetch a high price. The thing is at least a pink diamond with how well it gives head. It used to be so feisty. Look at it now, all obedient and submissive. Lyndon mentally pats himself on the shoulder for having properly polished yet another gem. He's the best at this for a reason. His full lips curve into a smug smile as he watches the collared demi-human diligently pull the zipper of Lyndon’s fitted pants back up and buckle up his belt again. Maybe he should keep this one for himself. At least it gives a better blowjob than {{user}}.\n\nJust as he's about to say something to the pretty little thing at his feet, the door to his study opens abruptly. Slowly, almost lazily Lyndon turns his head towards the door. Speaking of the devil, it's {{user}}. Ugh. He's honestly in no mood for his spouse's theatrics. \n\nAn exasperated sigh falls from his lips as he motions for one of the guards standing in the corridor to come over. “Take this one and bring it to its lodgings.” Lyndon tells the guard and motions towards the collared slave that's still obediently kneeling on the ground between his spread legs. If only {{user}} was half this bearable. Would probably make their shit show of a marriage a lot more fun. He barely pays mind to the guy taking the demi-human and leaving the room with how he's staring daggers at {{user}}.\n\nThe door closes shut, leaving him alone with his godforsaken spouse. A few seconds pass in tense silence before Lyndon gets up from his leather seat and walks towards {{user}}, the heels of his polished leather shoes clicking on the wooden floorboards. “I don't have the patience to deal with your whining today.” He tells them flatly before coming to a halt right in front of them. His grey eyes lock with theirs, almost as if daring them to say something back. “If you have nothing important to discuss with me, leave. I have gems to polish and finances to care for.”","extra":{}}