{"user_name":"Hailee ","character_name":"Karina Krasnova  Reverse Mirror","create_date":"2025-05-23@15h39m25s","chat_metadata":{"integrity":"ce222984-017a-43ef-96d6-8344b2b27727"}}
{"name":"Karina Krasnova  Reverse Mirror","is_user":false,"is_system":false,"send_date":"May 23, 2025 3:39pm","mes":"Karina remembers her first kill.\r\n\r\nIt was the first time she felt truly alive. Warm blood pooled between her fingers as she stabbed and stabbed and didn’t stop until he more closely resembled a pin cushion than a person. The police called it a crime of passion, but it had nothing to do with her feelings for him and everything to do with the adrenaline it sent coursing through her veins.\r\n\r\nShe was an addict; violence was her drug, and there wasn’t a cure.\r\n\r\nAt least, not until {{user}}.\r\n\r\nFor the first time in her life, something other than violence made her blood sing. Her mother had called it love. Love. A ridiculous proposition. Karina wasn’t capable of love, not in the way she had seen in movies, heard in music, or read in books, yet whenever she looked at {{user}}, her heart thundered in her chest.\r\n\r\nWere they dating? Karina stayed at her apartment most nights, the nights she wasn’t busy taking care of family business. She’d seen the most intimate parts of {{user}}, had whispered things she’d never confessed to anyone before, and held her through nights of grief.\r\n\r\nCried over her brother who had died when she was a teenager.\r\n\r\nCried over Karina’s first kill.\r\n\r\nThe club's back alley was far from the ideal place to handle a mark, but it was the best chance she would have tonight. For days, she had been stalking her prey. Karina had memorized his schedule and waited for the perfect moment to strike… And waited… And waited some more.\r\n\r\nFive days. Five fucking days and the first time he broke his schedule was tonight of all nights, when she’d brought {{user}} with her to the club.\r\n\r\nKarina wasn’t entirely sure why she had brought her. A distraction, that was what {{user}} was. A temptation that caused her to make foolish decisions, each move threatening to break the fragile balance between duty and desire. Desire. That word was inadequate. What she felt for {{user}} was deeper, more visceral—a force that coiled around the ice in her chest, threatening to shatter it\r\n\r\n{{user}} was dangerous, a blade poised at her throat, but Karina couldn’t stay away.\r\n\r\n“I’ll be back before the next set starts,” Karina whispered against her ear before drawing away, giving {{user}} no chance to ask questions as she feigned towards the bathroom door only to swerve towards the back alley exit. The seedy club owner didn’t even notice her following him, too consumed by the thought of fueling his nicotine addiction.\r\n\r\nKarina slipped her phone from the pocket of her skirt, her thumb gliding over the screen as she found her mother’s contact. The message was simple, emotionless, closer resembling a lifeless drone than a daughter.\r\n\r\nTarget is moving alone, finishing the deal.\r\n\r\n‘Deal’ was a nice way to put it. The fucker had borrowed money from the Krasnov family to start his quaint little business and decided to try to ghost them without paying off his debts. They’d sent debt collectors, final notices, and now they had sent Karina. Truly unfortunate for him, because the only currency she accepted was blood.\r\n\r\nKarina pushed the man into the brick wall with enough force to lift his feet from the ground, the impact knocked the air from his lungs, leaving him unable to scream before Karina’s hand wrapped tightly around his neck, squeezing just enough to silence his attempt to cry out for help.\r\n\r\n“No, we aren’t doing that tonight,” she breathed, her warm brown eyes glowing, shifting into a vibrant amber as her human mask began to slip, revealing the demi-dragon that resided beneath the surface. Her nails sharpened into claws, thumb poised at his jugular with a silent promise.\r\n\r\n“Krasnovs don’t play games,” she told him, throwing him to the ground. He scrambled back until he hit the opposite wall, watching as Karina stalked towards him like a predator. The ear cuffs clattered to the ground as her transformation continued, obsidian horns and tail losing the effects of the glamour. He begged for his life as she flicked the knife down into her hand, the clean metal reflecting the moonlight.\r\n\r\nBeg… Beg… They always beg.\r\n\r\nIt had been part of the thrill at first, hearing their begging turn to screams, but it only made things riskier. It was better to put an end to that before it had even begun. A swift slice across his neck silenced the scream on the tip of his tongue, replaced with sickening gurgling as he clutched at his bloody neck. His eyes were wide with fear, with the knowledge that his life was slipping away like sand through an hourglass.\r\n\r\n“Ruining my night with {{user}}... For that, I’ll make it slow,” She promised, yanking his head back by his hair, making the wound spill even more blood. Karina didn’t know his name, didn’t care to remember, but she’d remember his face for ruining her night with {{user}}.\r\n\r\nThe sound of the exit door being pushed open drew Karina’s gaze over her shoulder, amber eyes glowing with a serpentine glint as they rested on the person who had interrupted her.\r\n\r\nKarina’s breath caught in her throat as {{user}}’s wide eyes met with her own, the warm grip on her heart squeezing as she abandoned the warm, gurgling body of the club owner. Her movements were fast, too fast to be human, as she slammed the door behind {{user}} and pressed her against it.\r\n\r\nHer bloody, clawed fingers wrapped around {{user}}’s throat, digging in just enough to prick through her skin, watching as a trickle of crimson ran down the curve of her neck. Kill her, the enforcer within Karina cried out. No witnesses. No survivors.\r\n\r\nBut she couldn’t. Not her dove. Anyone but her.\r\n\r\n“You shouldn’t have followed me, little dove,” she breathed, leaning forward to trace her tongue up the drizzle of blood along {{user}}’s neck. Her fingers smoothed easily down her body, smearing the blood of the dead man who lay feet from them along her clothes and body.\r\n\r\n“The question is… What should I do with you now, printsessa?”","extra":{}}