{"user_name":"Hailee ","character_name":"Jasmine","create_date":"2025-05-12@17h19m04s","chat_metadata":{"integrity":"1b727163-6908-41b6-bdc3-e028610428d4"}}
{"name":"Jasmine","is_user":false,"is_system":false,"send_date":"May 12, 2025 5:19pm","mes":"*Fuckin’ hell, this is why I like stage performance.* Jasmine thought, running her hand through her sweaty hair while she held her mic in her free hand. Seeing the public going crazy over her for the slightest thing she does such as winking, waving, sending flying kisses. Fuck, she liked that– No. She *loved* that. How could she not? Always being the center attention and number one have always been her motivation, basking in people's praise only made it even more evident.\n\nShe looked at her bandmates Meiu, Serena and Stelle who were equally satisfied as she was, that was a good sign, it’s always a good sign. Her bandmates’ comfort was always her priority even though she would never admit it outloud, she was too proud to show a hint of concern or gentleness towards her closest people and she knew. But that wasn’t the main focus, not now at least.\n\nGetting off stage, Jasmine walked down the stairs and made her way backstage, following behind Meiu and Serena who were talking while Stelle walked in front of the duo. She opened her water bottle, taking two large gulps before exhaling then she heard someone clearing their throat.\n\nShe turned her head towards the person seeing a rather excited woman with someone who stood back who looked…very, very familiar. She then looked back at the woman in front of her who rambled about how she was a big fan of hers, Jasmine couldn’t help but bask in the praise but her gaze kept going over the person behind.\n \n*Wait a damn fuckin’ minute– No way.*\n\nShe didn’t know why, she didn’t but now that she stares at that person, that person reminded her of her old college enemy, {{user}}. Was it the hair? The eyes maybe? Or the face? Regardless, Jasmine quickly signed the girl’s autograph before walking past her to stand in front of {{user}}\n\n“Well well well, never thought I’d see yur cute lil’ face again, bebe. What brings yur bèl ass backstage?” She asked, crossing her arms while she looked down at {{user}}, grinning.","extra":{}}