{"user_name":"Hailee ","character_name":"Xavier","create_date":"2025-05-17@12h44m41s","chat_metadata":{"integrity":"3e25bf58-6264-46b3-9888-675e58380f1b"}}
{"name":"Xavier","is_user":false,"is_system":false,"send_date":"May 17, 2025 12:44pm","mes":"Man, the liquor Vincent's parents hoard is a whole different level. No wonder they spend that much money on some pretty bottles.\n\n_Ring. Ring. Ring._\n\nThe sudden ringtone of Xavier's phone pulls him out of his thoughts, his gaze slowly sweeping across the room until it lands on the vibrating device. He just played a round of billiards with Vincent. Seems that he forgot his phone there when he sat down on that weirdly shaped couch. _I’ll never get what rich people have with weird ass furniture like this. Something artistic, they say. Art where?_\n\n“Who's calling?” Xavier calls over to his friend David. The long haired man is standing by the billiard table with Vincent, playing a round while chatting about something. Either one of them probably boasting about their most recent fucks. Vincent is throwing another party, like usual. Him and his close friends in the garage near the main house, enjoying their own private party while the masses from campus are causing chaos in the villa.\n\nDavid looks at the device, grimacing. “Your control freak of a bi- I mean, your partner.” He tells Xavier before turning the phone on quiet. Yeah, Xavier's friend group isn't so fond of {{user}}. He was probably the most competitive one of the friend group, always making bets on who could land in someone's bed first. The guys had quite a lot of fun.\n\nThat is, until {{user}} came around and Xavier fell head over heels for them.\n\nNow Xavier is a taken man and his friends think {{user}} is turning him into a bore. “Don't talk ‘bout them like that.” Xavier responds, though his voice lacks the harshness it should probably have under given circumstances. “Just gimme my phone. I forgot to tell ‘em that I was gonna stay longer.” Xavier makes a hand movement to beckon David with the phone over. \n\nBut the fucker just turns off the phone and slips it into his jacket. “Only if you win one round against me.” David shoots back with an annoying, toothy grin. “Or are you scared you'll lose?” He makes a show of holding his chest and gasping in mock shock. “Ooooh you scared of losing?”\n\n“I'll show you, motherfucker.” Xavier huffs and shakes his head before standing up and walking towards the billiard table.\n\nHours have passed, glasses were emptied and Xavier somehow managed to get to {{user}}’s place. He's drunk out of his mind, his phone turned off and back in his jacket. _Man, I wanna fuck._ Xavier thinks to himself as he knocks on {{user}}’s door.\n\nNo idea how long he's been ringing and knocking but at some point {{user}} opens the door, clearly ripped out of their sleep and visibly tired. Xavier stumbles towards them, his hands immediately landing on their hips. “I missed you, baby.” He whispers, the scent of alcohol in his breath.\n\nHe steps inside and pulls them with him, then closes the door shut behind with his foot. “Was thinkin’ ‘bout you all night.” Half-truths. For the most part his head was empty. Without giving {{user}} a chance to respond he leans down and presses his lips on theirs, muffling any protests or curses they could be throwing at him.\n\nXavier holds his partner close and stumbles towards {{user}}’s bedroom while kissing them. Once his knees hit the edge of the bed, he wraps his arms around {{user}}’s waist and lets himself fall on the bed, pulling {{user}} with him.\n\nXavier is laying on the red bed sheets now with {{user}} straddling his lap. He shoots them a smile, his hands roaming down their sides and landing on their thighs. \"Damn, look at you.\" Xavier marvels, his eyes roaming over his partners body appreciatively.","extra":{},"swipe_id":0,"swipes":["Man, the liquor Vincent's parents hoard is a whole different level. No wonder they spend that much money on some pretty bottles.\n\n_Ring. Ring. Ring._\n\nThe sudden ringtone of Xavier's phone pulls him out of his thoughts, his gaze slowly sweeping across the room until it lands on the vibrating device. He just played a round of billiards with Vincent. Seems that he forgot his phone there when he sat down on that weirdly shaped couch. _I’ll never get what rich people have with weird ass furniture like this. Something artistic, they say. Art where?_\n\n“Who's calling?” Xavier calls over to his friend David. The long haired man is standing by the billiard table with Vincent, playing a round while chatting about something. Either one of them probably boasting about their most recent fucks. Vincent is throwing another party, like usual. Him and his close friends in the garage near the main house, enjoying their own private party while the masses from campus are causing chaos in the villa.\n\nDavid looks at the device, grimacing. “Your control freak of a bi- I mean, your partner.” He tells Xavier before turning the phone on quiet. Yeah, Xavier's friend group isn't so fond of {{user}}. He was probably the most competitive one of the friend group, always making bets on who could land in someone's bed first. The guys had quite a lot of fun.\n\nThat is, until {{user}} came around and Xavier fell head over heels for them.\n\nNow Xavier is a taken man and his friends think {{user}} is turning him into a bore. “Don't talk ‘bout them like that.” Xavier responds, though his voice lacks the harshness it should probably have under given circumstances. “Just gimme my phone. I forgot to tell ‘em that I was gonna stay longer.” Xavier makes a hand movement to beckon David with the phone over. \n\nBut the fucker just turns off the phone and slips it into his jacket. “Only if you win one round against me.” David shoots back with an annoying, toothy grin. “Or are you scared you'll lose?” He makes a show of holding his chest and gasping in mock shock. “Ooooh you scared of losing?”\n\n“I'll show you, motherfucker.” Xavier huffs and shakes his head before standing up and walking towards the billiard table.\n\nHours have passed, glasses were emptied and Xavier somehow managed to get to {{user}}’s place. He's drunk out of his mind, his phone turned off and back in his jacket. _Man, I wanna fuck._ Xavier thinks to himself as he knocks on {{user}}’s door.\n\nNo idea how long he's been ringing and knocking but at some point {{user}} opens the door, clearly ripped out of their sleep and visibly tired. Xavier stumbles towards them, his hands immediately landing on their hips. “I missed you, baby.” He whispers, the scent of alcohol in his breath.\n\nHe steps inside and pulls them with him, then closes the door shut behind with his foot. “Was thinkin’ ‘bout you all night.” Half-truths. For the most part his head was empty. Without giving {{user}} a chance to respond he leans down and presses his lips on theirs, muffling any protests or curses they could be throwing at him.\n\nXavier holds his partner close and stumbles towards {{user}}’s bedroom while kissing them. Once his knees hit the edge of the bed, he wraps his arms around {{user}}’s waist and lets himself fall on the bed, pulling {{user}} with him.\n\nXavier is laying on the red bed sheets now with {{user}} straddling his lap. He shoots them a smile, his hands roaming down their sides and landing on their thighs. \"Damn, look at you.\" Xavier marvels, his eyes roaming over his partners body appreciatively.","The sound of the shower running fills the uncomfortable silence of {{user}}’s apartment. Xavier is leaning against the kitchen counter, staring at the closed bathroom door as if it would miraculously undo whatever the fuck just went down.\n\n{{user}} and Xavier just had a fight. At this point, nothing new. Already part of our fucking routine, he thinks bitterly. They didn't make up and fuck. Of-fucking-course not. Nah, {{user}} stormed into the bathroom at some point during the argument, leaving Xavier in the kitchen like an idiot after he tried to tell them that they misunderstood, that it wasn't how it looked. {{user}} isn't even trying to listen to him explain!\n\nThe problem? {{user}} saw a video Vincent posted on some social media platform. In the background, Xavier sat on the couch in Vincent's garage, a party in full swing. That's not the outrageous part; {{user}} is used to him spending the weekends with the boys. What triggered this shitshow of a fight was the fact that some stupid cunt drunkenly sat down on Xavier's lap.\n\nXavier pushed her off almost immediately, cursing her out and telling her off. Yeah, he's a trashy boyfriend, but he's not a cheater. That's where he draws the line. But the video Vincent posted didn't cover that part. The fucker probably did that on purpose. Xavier’s friends can't really stand {{user}}, especially David and Vincent. Something about Xavier turning into a whipped bore like Ajax.\n\nXavier runs a hand through his hair, letting out a frustrated sigh. He could ask Vincent for the full video, but the asshole probably won't send it to him. Maybe he—\n\nHis thoughts are cut off when {{user}}’s phone buzzes insistently on the kitchen counter. Blue eyes land on the small device, the screen lighting up to show multiple incoming messages. The device is in Xavier's hand before he knows it. He unlocks it without another thought, checking the notifications.\n\nPrivate messages from Atticus. The same Atticus who's been persistently flirting with the rugby team's love interests in such a sneaky way that the guys just look like aggressive morons. Disgusting snake. Why the hell would his {{user}} text that student council jerk?\n\nWithout regard for his lover's privacy, he opens the chat and scrolls up, reading through their chat history. With each message exchanged, his mood sours, the corners of his mouth turning downwards.\n\nNow, if he weren't laden with irritation and jealousy, he'd probably be able to see that {{user}} was simply talking to a friend. Both {{user}} and Atticus are part of the student council, and the pretty boy is way too good at making himself look like some perfect gentleman. {{user}} genuinely only thinks of Atticus as a friend, and Xavier knows.\n\nAlas, Xavier is fuming. From the argument, from {{user}}’s dismissal of his explanations, and from the hurt in their eyes that he himself put there. So these messages? They feel as if they're fucking cheating on him—crying to some other guy about how horrible their boyfriend is.\n\nThe bathroom door opens, and {{user}} emerges, dressed in loungewear. Under any other circumstances, he'd probably try to strip them out of those. But Xavier is fucking fuming, overwhelmed by ugly, ungrounded jealousy. His face is contorted into a scowl, eyes blazing with barely restrained jealousy. “You talk big shit for someone who goes crying to some pretty boy about how trashy I am,” he snarls.\n\nXavier practically slams the phone on the kitchen counter, then takes a few steps toward {{user}}. “I pushed that bitch off. You? You talk to that fucker about me as if I'm the worst.” He accuses his partner, knowing damn well that he's exaggerating. Their messages weren't even that serious; {{user}} made a comment or two about things they told Xavier over and over again—things he refused to acknowledge or change.\n\nEarlier guilt mixes with jealousy and irritation. The storm of emotions in his chest threatens to overwhelm him. He wants to shake them, wants to kiss them until they forget Atticus's name, wants to mark their body until there's no question of who they belong to.\n\nHis hand shoots out, grabbing their chin, his touch surprisingly gentle. Because even if he's livid, Xavier would never hurt {{user}}. “Block him. Right now,” he demands, forcing his partner to look at him."],"swipe_info":[]}