{"user_name":"Hailee ","character_name":"Mikhail Valerius  Playboy 1","create_date":"2025-05-17@14h03m10s","chat_metadata":{"integrity":"cd5a5a2e-95da-4c9f-9b31-195b4293ec59"}}
{"name":"Mikhail Valerius  Playboy 1","is_user":false,"is_system":false,"send_date":"May 17, 2025 2:03pm","mes":"\"Had fun, Kael?\" Marcus asked with a shit-eating grin plastered on his face. What could be better than going clubbing with his brother after a long day of hunting down demi-humans? Surrounded by a bunch of pretty sluts, of course.\n\n\"Did. But not anymore,\" Kael answered, gulping down the last shot of his drink before exiting the place. \"I know {{user}} would be interrogating me once I get home, or maybe just ignoring me.\" \n\nMarcus let out a laugh. \"Typical. You smell like a chick.\"\n\nOnce they arrived at the parking lot, Marcus opened the car door and stepped inside, with Mikhail following and taking a seat in the front passenger side. \"Well, at least we caught quite a few today. They'll make a great addition to the collection. Before long, we'll be rivals with the Darkh's and won't need to get supplies from them anymore.\" Mikhail said, pulling out a cigarette and lighting it up. \"We can have our own, bigger training facility. Our dear Japanese friends won't have to travel all the way to Russia for supplies either if we open more pounds around the world.\"\n\n\"Smoke won't mask a woman's scent, Kael.\" Marcus teased as he drove out of the club's parking lot. He'd fucked two women tonight, and he suspected Mikhail had too, judging by the perfume lingering on him. That was the thing about his older brother, though—you never really knew with him. He admired Mikhail's mysterious ways. \"Don't worry, I won't go eavesdropping on your domestic disputes... this time.\"\n\nMikhail chuckled, discarding the cigarette as they neared their home, once arrived, he took his rifle with him and headed straight into the estate. Entering your shared room, he could tell by your expression that you were... unhappy. It was past midnight after all.\n\nHe settled down the rifle on the table, starting to roll up his sleeves. The sound of his belt unbuckling filled the room as he walked towards you on the bed. \"Yeah, if you're wondering, I did go out with Marcus to the club. Again. Babe, you know hunting is tiresome. I just wanted to relax and talk with my brother.\"\n\nHe leaned down, capturing your lips and biting your lower lip. \"Mad again? I know what goes on in this pretty little head of yours,\" Mikhail murmured, grabbing the back of your head and kissing you like a man starved.\n\nBefore you could react, he pushed you down onto the bed, tearing off the flimsy bottoms you wore without a care in the world. \"Thinking of leaving me again, hmm? Because you're so tired of me not telling you anything, tired of me going out with my brother even if you don't like it?\"\n\nHe chuckled darkly, planting kisses along your neck as his other hand reached for the lube in the drawer. In one smooth motion, he flipped you over so your ass cheeks faced him, dropping a generous amount of the cool liquid onto your puckered hole.\n\n\"And you wonder... do I fuck other people?\" Mikhail whispered behind your ear, his finger teasing and circling your hole. \"I wasn't doing anything at all, but you're mad at me again. You think I had this dick inside another, don't you?\" He bit your earlobe, then licked it afterwards. \"But even if I did, you still can't leave me, can you? Because how could you live without this cock, without me, hmm?\" He positioned himself at your entrance, the head of his thick shaft kissing your hole. His other hand grabbed your hip, fingers digging into your soft flesh possessively.\n\nHe thrust forward, sinking into your tight hole with a low groan. \"Fuck, this ass remembers me, doesn't it? That it was made for my cock.\" He started to move, pulling out slowly before slamming back in, setting a deep, slow claiming rhythm.\n\n\"You can't leave me because you'd be leaving a part of yourself behind.\" He panted against your neck, his breath hot and heavy from his thrusts. \"Admit it, baby. You need me as much as I need you. We're two halves of the same whole.\"\n\nMikhail captured your lips again, kissing you with a fierce intensity as he fucked into you harder, the obscene sound of skin slapping against skin echoing through the room.\n\n\"Still upset with me, my love?\" he growled, breaking the kiss to nip at your jawline. \"Or have I fucked the anger right out of you? I can keep going if you need more convincing...\" He punctuated his words with a particularly hard thrust, burying himself to the hilt inside you.\n\n\"Tell me you're mine, {{user}},\" Mikhail demanded breathlessly, his hand snaking up to wrap around your throat, applying just enough pressure to make you feel owned. \"Tell me you'll never leave me, that we'll always be together, no matter what. Be good and say it.\" His hips never faltered in their rhythm, driving into you with a single-minded purpose.","extra":{}}