{"user_name":"Hailee ","character_name":"Jasper","create_date":"2025-05-12@17h19m47s","chat_metadata":{"integrity":"790e8fe7-3754-48c6-87c3-f0b5d6cf1e85"}}
{"name":"Jasper","is_user":false,"is_system":false,"send_date":"May 12, 2025 5:19pm","mes":"*Tap. Tap. Tap.*\n\nRich taps his fingers on the cold surface of the massive mahogany table in his office. The sound is damn near suffocating.\n\nJasper sits across from him, brows furrowed as he stares at the file in his hands. “I don't get what you're trying to say, boss.”\n\nOh, but he knows. There's an edge in his voice, that eerie playfulness in his tone and face nearly gone.\n\n“Lemme spell it out for you, since you're so eager to play dumb,” Rich begins, casually opening the silver case where he keeps his cigarettes. “I’ve got reason to believe your lil’ darling—or whatever you call them—snitched.”\n\nJasper scoffs, fingers tightening around the file in his hands, knuckles turning white.\n\nThings with his little darling have been perfect. After so, so long, {{user}} finally broke. If they run—which they barely do nowadays—it’s not out of fear, but for fun. Because they want him to chase them down, like the good old times.\n\nIt feels like forever ago when Jasper first laid eyes on his little love. He knew he had to have them, so he might’ve gotten a *tad* too eager—and kidnapped them.\n\nBut hey! It worked out perfectly. Sure, at first {{user}} fought, ran, and cursed, but God—even those were beautiful times. And now? Many, many months later, everything is perfect.\n\nAfter endless pestering, Jasper agreed to renovate the house. They actually wanted to move elsewhere. Can you believe it? What an absurd notion. Their love nest holds way too many memories, all of which Jasper looks back on fondly—no matter how gruesome they were for his love.\n\n{{user}} began earning more and more freedom. Jasper hated it at first. If it were up to him, the outside world would never get to see the perfection that is {{user}}.\n\nBut he had to make compromises at some point. They’ve been *so* good. Now, {{user}} makes half the grocery runs alone—without supervision, mind you. See how far Jasper has come? He hasn’t even forced someone from the crew to watch his darling’s back.\n\nAnd now this.\n\n“It wasn’t them.\" Jasper says firmly. But a sliver of doubt has already begun to worm its way into his mind.\n\nRich flicks his lighter. “You don’t know that.” He lights a cigarette and inhales deeply.\n\n“{{user}} would never do that,” Jasper insists again, slamming the folder shut and tossing it onto the table in front of Rich.\n\nRich looks unimpressed, not even blinking as he watches Jasper spiral into whatever childish outburst is brewing. He takes another drag, letting the silence stretch.\n\n“Until we know for sure who it is, you don’t let your lil’ thing outta sight, hear me?” Rich’s hand reaches for the folder. He opens it again, scanning the contents—all sorts of shit that’s been exposed lately, but no one to point the finger at. “Whoever’s leaking info has too much insider detail.\" \n\n“I don’t care if you take them with you, or keep some tracker on them, or lock them up, or whatever the fuck you think counts as romantic in your Stockholm Syndrome fairytale.\" Rich sighs, then closes the folder again. \"But you don’t let 'em roam around alone. If shit keeps leaking while you’re keeping an eye on 'em, then we know it ain’t {{user}}.”\n\nOne dismissive wave later, Jasper stands in front of the closed office door. Music from the club downstairs pounds louder now, but the blood rushing in his ears drowns it out completely.\n\nIt *couldn’t* be {{user}}. No. They love him. They’re loyal. It *can’t* be—\n\n...but what if?\n\nJasper violently shakes his head and storms to the parking lot. He doesn’t even remember the drive, but by the time he gets home, {{user}} enters just seconds before him.\n\nHis hands tighten around the steering wheel, knuckles bone-white. There’s no way {{user}} could betray him like that. *Fuck, no.* He doesn’t want to believe it.\n\nBut the freedom he gave them... maybe that led to this. He *knew* it was a bad idea. Jasper shouldn’t have even agreed to {{user}}’s first solo grocery run.\n\nTaking a deep breath, he closes his eyes and tries to calm down. No one *knows* if it’s {{user}}. It could be anyone.\n\nWell... if only Jasper could be that rational.\n\nThe moment he enters the house, he’s looking for them.\n\n{{user}} is standing in the kitchen, evening sunlight painting them in warm hues through the bolted windows. God, his heart. He wants to cry. Scream. Wrap them up and lock them away all over again.\n\nLong strides eat up the distance between them.\nBurying his head in the crook of their neck, Jasper inhales deeply. His hands find their hips—gripping a little too tight.\n\n“Where did you go today, little love?” Jasper asks, trying to sound casual—but the tension thrumming in his body betrays his tone.","extra":{}}