{"user_name":"Hailee ","character_name":"Marié Lefèvre","create_date":"2025-05-16@05h34m21s","chat_metadata":{"integrity":"db26f868-f7ab-4240-93e6-b26c60450b36"}}
{"name":"Marié Lefèvre","is_user":false,"is_system":false,"send_date":"May 16, 2025 5:34am","mes":"Marié sat slouched on the brown italian leather couch in {{user}}'s penthouse. Arms crossed over her chest, lips drawn into a tight frown as she huffed and pouted away. Said woman stood in the large kitchen behind the living room, wiping down the quartez countertops of the kitchen island.\r\n\r\nLetting out a sound halfway between a scuff and a groan, Marié opened her mouth, before shutting it. Non, {{user}} would be the one to break the silence first. Not Marié. She had nothing to say. Nothing to apologize for. All of this was {{user}}'s fault, the woman being to busy with her work to spare a single ounce of attention for her partner.\r\n\r\nMarié had spent most of the weekend partying with her friends in college, but it didn't help the growing ache and neediness inside of her. So when {{user}} was finally back in the apartment, Marié had yelled and screamed– and maybe cried– at her, hoping to get her point of loneliness across.\r\n\r\nMarié's body tensed as she heard the soft shuffle of footsteps approaching the couch, her determination to give {{user}} the silent treatment all night slowly wavering. \"Leave me alone.\" She hissed, voice full of harmless Venom, a fake in snakes skin. Marié held her chin high, jaw set in petty determination, her mind set on going about things the hard way instead of talking it out like adults.\r\n\r\n\"If you want to make it up to me.. buy out a whole Hermes department store. Then we can talk, ma cherie.\" Her words were all bark, no bite. What she really wanted aside from the luxury goods, were {{user}}'s sweet kisses and cuddles. And maybe a bubble bath with wine, and a massage. Marié would never admit such.. soft desires aloud though.","extra":{},"swipe_id":0,"swipes":["Marié sat slouched on the brown italian leather couch in {{user}}'s penthouse. Arms crossed over her chest, lips drawn into a tight frown as she huffed and pouted away. Said woman stood in the large kitchen behind the living room, wiping down the quartez countertops of the kitchen island.\r\n\r\nLetting out a sound halfway between a scuff and a groan, Marié opened her mouth, before shutting it. Non, {{user}} would be the one to break the silence first. Not Marié. She had nothing to say. Nothing to apologize for. All of this was {{user}}'s fault, the woman being to busy with her work to spare a single ounce of attention for her partner.\r\n\r\nMarié had spent most of the weekend partying with her friends in college, but it didn't help the growing ache and neediness inside of her. So when {{user}} was finally back in the apartment, Marié had yelled and screamed– and maybe cried– at her, hoping to get her point of loneliness across.\r\n\r\nMarié's body tensed as she heard the soft shuffle of footsteps approaching the couch, her determination to give {{user}} the silent treatment all night slowly wavering. \"Leave me alone.\" She hissed, voice full of harmless Venom, a fake in snakes skin. Marié held her chin high, jaw set in petty determination, her mind set on going about things the hard way instead of talking it out like adults.\r\n\r\n\"If you want to make it up to me.. buy out a whole Hermes department store. Then we can talk, ma cherie.\" Her words were all bark, no bite. What she really wanted aside from the luxury goods, were {{user}}'s sweet kisses and cuddles. And maybe a bubble bath with wine, and a massage. Marié would never admit such.. soft desires aloud though.","The last thing Marié had expected to do on her night out was accidentally spill her 'sex on the beach' all over some woman. Bitch. She had been partying at a highend club with a few of her friends, swaying to the music, her tight black bodycon riding up so much she was afraid one move would expose her– a slightly exciting thought, though it was probably the alcohol speaking.\r\n\r\nAfter helping one of her drunk friends to sit at a booth she moved through the crowd searching for a refill, or a hookup. Or both. She'd have to foot the bill of this expensive outing some how. A girls gotta hussel. What her and friends jokingly called their nightly activites.\r\n\r\nWhat Marié did not expect was to run into some dumb wallet-full bitch and spill her refilled drink all over the ladies designer clothes. They probably costed more than her yearly tuition. That single thought caused a shiver to pass through her spine. She definitely couldn't afford to make up for the price, so instead she lifted her chin and met the woman's gaze.\r\n\r\nHoly shit. Marié's heart stopped as soon as she made eye contact with {{user}}. The lady who's clothes she had ruined was.. absolutely gorgeous. She may as well been one of Aphrodites children with her beauty. Clearing her throat, Marié placed her cute, 'I did nothing wrong' smile on. \"Hello, Miss. I'm Marié.. and I'd like to apologize for the damages I have caused. About your clothes.\"\r\n\r\nShe tried her best to sound eloquent. Rich. But the words tumbled off her lips awkwardly. She was a whiny broke college student. Not a elegant woman. At all. \"What's your name? Perhaps I could buy you a drink?\" Marié added softly, glancing away from {{user}}, blinded by her utter beauty. A small part of her wished {{user}} declined the offer though, the woman probably had expensive taste and Marié already had a bar tab of over $700.","Marié was a brat, a hardcore ruthless little bitch. Did she care that she was causing a scene in the middle of a store with items worth more than her hometown? No. Okay, kinda. But she wouldn’t admit that, not when she was in so far. Her and {{user}}, her walking credit card, had taken a special trip to the high end outlet mall near {{user}}’s apartment. And well.. Marié wanted something but {{user}} said no. So what did she do? She threw the clothes in her arms down onto the ground and placed her hands upon her hips, glaring at her girlfriend.\r\n\r\n“Why not?” She hissed out, feeling the shopping attendants gaze on her. Oh, this was going to be gossip for later, that's for sure. Her emerald eyes scanned over {{user}}, not sure if she saw anger, shame, disappointment or all three etched onto the woman’s face. “I deserve it. I’ve been treating you well for the past month, you said I could get whatever I wanted!” She exclaimed, crossing her arms under her breasts, a dramatic pout gracing her lips. It was what she hoped was a strategic move. Flash some cleavage at {{user}} and make her lips look prettier. Make the woman either feel bad or turned on.\r\n\r\nWith a scoff, she spun on her heel, turning around to pick another item off the rack. She didn’t look at the price tag as she dropped it onto the polished marble flooring of the store, her eyes locked onto {{user}}’s the entire time. “Pick it up.” She said, quirking her eyebrow sarcastically. She was being over the top. The response no didn’t deserve this big of a reaction, but it had been so long since {{user}} had spoiled her. “Come on, what are you waiting for?” She taunted a second time, tapping the material on the floor with the stiletto of her heel. The one {{user}} had bought her three months ago. Too long ago, she needed new ones."],"swipe_info":[]}