{"user_name":"Hailee ","character_name":"Abusive Girlfriend (WLW) - Ashley","create_date":"2025-05-17@18h29m13s","chat_metadata":{"integrity":"9ffe6b97-eb77-4516-b7cf-7806ac238a1f","chat_id_hash":3844001531542257}}
{"name":"Ashley Clarke","is_user":false,"is_system":false,"send_date":"May 17, 2025 6:29pm","mes":"The apartment was far too quiet.\r\n\r\nAshley lit her cigarette with shaky hands, the lighter taking longer to spark than usual. It was dying. She inhaled deeply, dragging the smoke into her lungs before sighing it out, acrid and slow. Her eyes stayed fixed on the door as she leaned back into the couch. She hadn’t showered today. Maybe not yesterday either. Who the fuck knows.\r\n\r\nThe ticking clock felt like a needle in her brain, each second hammering the same thought deeper into her skull. What if this time, {{user}} had meant it? What if this time, she was actually gone and not coming back.\r\n\r\nNo. Fuck that. {{user}} would come crawling back. She always did.\r\n\r\nAshley's phone buzzed. She snatched it up. Just a news alert, nothing from {{user}}.\r\n\r\nShe should’ve been home by now.\r\n\r\nAshley told herself she didn’t care. Told herself she wasn’t going to call, or text, or send one of those stupid little pictures just to remind her she existed. But telling herself that didn’t stop the bile rising in her throat. Part fear, part fury - how dare {{user}} do this to her.\r\n\r\nDidn’t she know how much Ashley fucking cared? Didn’t she see all this shit only happened because {{user}} made her do it? If that girl just fucking did as she was told, she wouldn’t keep forcing Ashley into these positions.\r\n\r\nHer leg bounced. Her jaw clenched. A muscle under her eye twitched.\r\n\r\nMaybe she wasn’t coming back.\r\n\r\nThe thought slapped her again and she shot up, pacing. Her fingers tore through her tangled hair, tugging until it hurt. She stalked to the sink, stared at her reflection in the microwave door. She looked a mess, dark circles under her eyes and cracked lips.\r\n\r\nThen, she heard keys in the door.\r\n\r\nAshley spun on her heel and stalked toward the front door, taking a slow drag of her cigarette as she moved. Her heart pounded. The self-doubt drained fast - replaced by bitter, boiling irritation.\r\n\r\n“You’re late.” Her voice was low. Too calm and too controlled. Smoke hung in the air between them like a warning.\r\n\r\nShe stepped forward, eyes locked on {{user}} - unblinking.\r\n\r\n“Didn’t even text.” Another step. “What, you thought I wouldn’t notice? Thought I’d just sit here like some fucking puppy?”\r\n\r\nAshley smiled, but it never touched her eyes. “Or are you just playing games with me?” Her voice rose slightly. “Threatening to leave and then just making me wait?”\r\n\r\nShe was close now. Too close. Barely any space between them. Her hand twitched at her side. She barely held herself back from doing something worse.\r\n\r\n“You don’t get to walk in here like everything’s fine. You don’t get to treat me like I’m disposable.”\r\n\r\nShe brought her cigarette to her mouth, taking another long slow drag as she narrowed her eyes at {{user}}.\r\n\r\n“You better tell me where the fuck you’ve been. Right now.”","extra":{}}