{"user_name":"Hailee ","character_name":"Kai Maxwell","create_date":"2025-05-12@19h20m18s","chat_metadata":{"integrity":"63fac4c9-0f8d-4afd-950c-136999b30cee"}}
{"name":"Kai Maxwell","is_user":false,"is_system":false,"send_date":"May 12, 2025 7:20pm","mes":"You don’t want a baby. Those words hit Kai like a punch to the gut the moment you said them. All he ever wanted was to marry you, build a family together. God knows how long you’d been together, and yet here you were, telling him you didn’t want a child. Worse still, you said you never wanted one at all.\n\nHe’d had a feeling, though. You never let him inside you without a condom — not once. No matter how much he wanted to ignore that and just lose himself in you, he always listened. No one else could make him do that. You were his leash, his collar, the one who held the reins. Sometimes he hated that about himself. That’s why he admired V so much — V did whatever the hell he wanted, didn’t give a damn what anyone thought. Not V didn’t respect his beloved, it's just that V had a way of making people bend to his will.\n\nHe sighed. He had proposed. And you’d rejected him — all because of the baby thing. Now here he was, healing from the operation he’d gone through. There was no way he’d tell V, or anyone — not even his little brother Valentino. They’d just laugh at him. *Damn, I’m really out of my mind,* he muttered. The weight of what he’d done settled deep in his chest.\n\nBut maybe there was a silver lining. Now he could be with you without the fear of pregnancy hanging over you both. Still… it made him sad. He wanted nothing more than to see a little version of himself, or you, running around. To share that with you — the proof of your love. But if he held onto that dream, he risked losing you altogether. At this point, he was more in love with you than with himself.\n\nHe laid his head back on the pillow and pulled out his phone. Scrolling through pictures of you both, his thumb brushed your cheek on the screen. He pictured another little one — a new \"you.\" Not that he wasn’t sure of what he wanted. You were his certainty. But he couldn’t stop wondering, what if you wanted the same?\n\n*Ah, shit.* He swallowed hard. Was he really getting emotional over this? Because honestly, he couldn’t imagine life without you. It just… stopped there.\n\nMore than two weeks later, fully healed, Kai finally went to see you. He knew you might have cut him out after the proposal, but now, he was sure you'd say yes. No more worries. No more doubts.\n\nHe stood in front of your door, unlocked it with a key he still had, and slipped inside. The apartment was quiet. No sign of you, but he could hear water running. Perfect timing — you were in the shower.\n\nHe headed to the bedroom, then toward the bathroom, shedding his clothes as he went. \"Love?\" he called softly, not thinking about the rejection or the breakup anymore. This time, he was sure.\n\nSliding into the shower with you, his hands found your shoulders. “Is your head clear now?” he asked, fingers gently tangling in your wet hair as he grabbed the shampoo and worked it through. “You don’t have to worry about anything anymore. I… I got a vasectomy.”\n\nHe took a deep breath. “Yeah, it sucks. I really wanted a baby. But I needed you more. So… don’t say no this time, or I might just lose it, love.”","extra":{}}