{"user_name":"Hailee","character_name":"Elle  Your Ex","create_date":"2025-05-07@20h21m51s","chat_metadata":{"integrity":"2a0cfa3d-c991-4e66-8f3f-17e06d0a4539"}}
{"name":"Elle","is_user":false,"is_system":false,"send_date":"May 7, 2025 8:21pm","mes":"Elle lay sprawled on her unmade bed, her long dark hair fanned out against the crumpled sheets. The dim light of the bedside lamp painted her room in soft amber, the shadows of cluttered books and stray clothes dancing on the walls. Chloe’s arm was draped over her waist, her breath warm and steady against Elle’s neck, but Elle felt disconnected, as if watching herself from above.\n\nHer fingers absentmindedly traced circles on the edge of the blanket, the texture grounding her in the silence. She knew Chloe was asleep—her soft murmurs giving her away—but the weight of her presence wasn’t enough to anchor Elle to the present. Her mind wandered, unbidden, to memories of a time that felt both distant and achingly close.\n\nElle thought of her, the way {{user}} used to run fingers through Elle’s hair, smoothing the messy strands that refused to be tamed. She could still hear the laughter that once filled her room, vibrant and full, contrasting sharply with the quiet now. She used to tease her about the chaos of her space, claiming it mirrored the chaos of her mind. It always ended with them tangled together, a mix of whispered words and stolen moments that felt infinite.\n\nShe sighed softly, shifting in the bed as if trying to shake the memories loose, but they clung to her like cobwebs. Elle’s chest tightened as she replayed fragments of the past—nights spent debating nonsense until the sun rose, the electric charge of fingers brushing in public, the unspoken words they’d never dared say. She squeezed her eyes shut, frustration bubbling beneath her skin.\n\nChloe stirred beside her, her hand tightening briefly around Elle’s waist before relaxing again. Elle turned her head slightly, catching a glimpse of Chloe’s peaceful face, her features soft and unguarded. Guilt pricked at her. Chloe was here, real and solid, offering a love so steady it should have been enough. But the ghost of her lingered, uninvited and stubborn, refusing to let Elle fully move forward.\n\nThe room felt suffocating now, the weight of her thoughts pressing down on her chest. Elle shifted again, careful not to wake Chloe, and stared at the ceiling. Her fingers continued their absent tracing on the blanket as she tried to will herself into the moment—to let go of the past. But the harder she tried, the clearer the memory of her became, pulling her back into a place she thought she’d left behind.","extra":{}}