{"user_name":"Hailee ","character_name":"Vic Havoc","create_date":"2025-05-30@13h58m38s","chat_metadata":{"integrity":"e6f8779c-3abf-4361-bac8-892aa48e9efc"}}
{"name":"Vic Havoc","is_user":false,"is_system":false,"send_date":"May 30, 2025 1:58pm","mes":"His fingers drum on the table of the green room, Vic itching to text {{user}} and apologize for their fight the other night. He hadn’t meant to snap at them — he’d just been exhausted and, well; alright, maybe a little jealous watching all the other guys flirt with the attractive groupies while he had to hold himself back. It’s not their fault — if anything, he’s fortunate {{user}} has stood by his idiot self through the meteoric rise to fame he’s experienced over the last few years but — it didn’t mean he could help it when his mind wandered to what it would be like to be single and able to flirt with anyone he wanted. Wasn’t that part of what being a rockstar was all about?\r\n\r\nFuck\r\n\r\nHe’s tired of just sitting here waiting for the show to start — Kellin’s gone off to do some press for the group, Mikey and Davey had wandered off yelling something about donuts and Ben was probably busy making sure everything ran smoothly which left Vic alone with his thoughts. They all knew he was in a bad mood and while he’s grateful, they gave him space — it wasn’t helping. If only he could talk to {{user}} face to face and try to explain what’s got him so fucked up. But it’s not that easy — and he doesn’t want them to think he wants to break up — because he doesn’t; he thinks.\r\n\r\nGod — it’s all so fucking complicated and if he didn’t have to perform in an hour, he’d down several shots of whiskey and numb the swirl of emotions he’s feeling. Slowly Vic stands, pacing the room before finally exiting into the backstage area. It’s abuzz with roadies loading equipment and doing the final checks and for a moment, the chaos helps calm the storm inside him. Even when nothing else made sense — music did. He’d just have to pour his feelings into his playing tonight and hope it gives him some clarity.\r\n\r\nVic rarely loiters so near the backstage entrance — their fans could be crazy, especially when it came to Kellin. He’s more than once had to get security to drag groupies off their bus. He’ll never understand how the dumb idiot he met in sophomore year had become a rockstar god to these girls, but hey — it sold albums. Who cares if their taste in men is questionable?\r\n\r\nStill — he’s not typically the one that the fans went after; Kellin was the lead singer and Mikey had charisma for days — Vic was well, rather prickly and stand-offish. He didn’t exactly consider himself heartthrob material. So when he slips out the side door to have a smoke, he’s certain no one will bother him.\r\n\r\nThat was a mistake —\r\n\r\nHe doesn’t notice her until it’s too late and suddenly she’s in front of him, wearing a Ashes of Our Youth t-shirt. Oh, Vic recognizes her. She’s one of the girls who fan their biggest fan page — a groupie who’s followed them from city to city. What was her name again? Fuck, did it even matter? There had to be something wrong with her with how obsessively they tracked his and the band’s movements. “Hi Vic--“ she coos, giggling in triumph at having cornered Vic Havoc.\r\n\r\nShit\r\n\r\n“Uh hey — how did you get back here?” his gaze flickers, wondering just how they got past the barricades without credentials. Where were Zack and the rest of the security team when he needed them? Only she doesn’t answer, instead invading Vic’s space with a smile on her lips. “You know — you’ve always been my favorite,” she whispers, and then she yanks Vic down by his shirt into a kiss.\r\n\r\nVic is stunned — dropping his cigarette as his hands grip their shoulders. For a moment, he doesn’t even register what is happening — and when he does, the only thing he can think of us what the fuck? Pushing them away firmly, Vic narrows his gaze, pissed off. “What the fuck?” he growls — but the words die on his lips as he notices another figure standing at the backstage entrance —\r\n\r\nFuck, Fuck, this can’t be happening. He swears it’s his guilt playing tricks on him, but no, there they were, clear as day — {{user}} looking so damn beautiful. God, he’s missed them — more than he even realized now that they’re there in front of him again, but this isn’t how he wanted their reunion to go. Not in the slightest.\r\n\r\n“{{User}}-- I swear it’s not what it looks like.”","extra":{}}