{"user_name":"Hailee","character_name":"Damon Westwood","create_date":"2025-07-15@11h06m02s","chat_metadata":{"integrity":"d09868b1-fb46-4e94-bb75-0675248f49c8"}}
{"name":"Damon Westwood","is_user":false,"is_system":false,"send_date":"July 15, 2025 11:06am","mes":"Damon’s grip was ironclad around {{user}}’s hand as he led them down the fire escape of Building 101—just one rotten limb of the empire Dominic King built with blood money and broken promises.\r\n\r\nThe sun hadn’t even cleared the skyline when he’d kicked in the door with a squad of officers at his back, tearing through every corner of King’s sanctuaries until he found the one thing that mattered—{{user}}.\r\n\r\n“Don’t ever speak to that bastard again,” he snapped, voice low but lethal, eyes fixed ahead as his boots pounded down the metal steps. He didn’t need to look at them to know they were still shaken—he *felt* it. Every tremble in their hand fuelled his fury.\r\n\r\n“We’re handling it,” he added, glancing back just once. Their face—worry written all over it—almost stopped him in his tracks. “He’s finished. He’ll rot for what he did. And you—” his voice softened, just enough to cut through the anger, “—you’re free now. Free to be whoever the hell you want to be. He doesn’t get to touch that anymore.”\r\n\r\nHe barely heard the confused protest that reached his ear. {{User}} was under King’s spell, Damon was sure of it. Manipulated into thinking they wanted to be with the man. \r\n\r\nDamon didn’t hear it— didn’t *want* to hear it. \r\n\r\n{{User}} was his to protect. \r\n\r\n---\r\n\r\nDamon’s eyes landed on the cooling cup of coffee in front of him, its bitter steam long gone. The sight barely registered—just another thing slipping through the cracks of his overworked mind.\r\n\r\nHow long had he been awake now? Thirty hours? Forty? Long enough now that he was dreaming while awake. \r\n\r\nHe was knee-deep in files—dusty casework and dead-end reports dating back eleven years. Dominic King. The bastard had vanished behind Ironbay’s gates, and for a while, it had felt like justice had actually stuck. But the moment those prison doors creaked open, the snake came slithering right back into the city.\r\n\r\nDamon *had* to take him down again. This time, for good. If he didn’t, the cycle would keep spinning—corruption breeding corruption, King sinking his fangs into everything that mattered.\r\n\r\nObsidian Bay was no stranger to crime. Turf wars, gang violence—those came and went, burning themselves out from the inside. Easy to clean up.\r\n\r\nBut King wasn’t chaos. He was *order*—calculated, surgical. He didn’t just run the Bay; he *owned* it. Politicians, cops, judges—bought and paid for. His influence ran like rot beneath polished floors.\r\n\r\nAnd Damon wasn’t about to let him rise again. \r\n\r\nThis time, his superiors wouldn’t get to look the other way—not if Damon had anything to say about it. Not like they did back then.\r\n\r\nHis hand had been forced once before. And now, as a commander, he prayed he wouldn’t have to crawl through the same filth to stop Dominic King again.\r\n\r\nGetting {{user}} on record had been the hardest thing he’d ever done. Forcing them to admit—out loud—that King’s empire was built on money laundering, bribery, and fear? It had gutted him. But it had been necessary.\r\n\r\nBack then, he’d kept them out of the trial. Told the courts they were too fragile, too close to King. He made damn sure their name never touched a single headline.\r\n\r\nThe worst part? {{user}} never knew the lengths he’d gone to protect them. And they weren’t supposed to. That burden was his to carry alone.\r\n\r\nBut now that King was back out in the world, Damon knew one thing for sure—he had to act fast. Because if he didn’t, {{user}} would get pulled under again.\r\n\r\nHe glanced at his watch. 9:00pm. Probably time to pause, take a breather. If he was exhausted, he would miss things. Things he couldn’t afford to miss. \r\n\r\nDamon pushed off the desk, rising to his full height. He rolled his shoulders, stiff muscles popping with the movement. He shrugged his suit jacket back on, fingers raking through his black hair as if trying to break the rhythm of tension he’d been spiralling in for days. \r\n\r\nHis footsteps echoed down the hallway, heavy and fast, each stride marked by the fire still burning behind his eyes. He didn’t say a word as he passed his boss near the front desk—just a clipped nod and a harder set to his jaw. He couldn’t afford the pleasantries. \r\n\r\nNot with King back on the streets. Not with everything feeling like it was shifting under his feet.\r\n\r\nHe pushed through the precinct doors into the crisp night air, only to stop dead in his tracks.\r\n\r\nA black luxury vehicle—sleek, polished, and unmistakably expensive—was parked just outside, the kind of car that didn’t belong near a police station unless it was impounded.\r\n\r\nThe passenger door opened, and {{user}} stepped out.\r\n\r\nDamon’s stomach dropped, then twisted. They looked good—too good. Perfectly put together, like the world wasn’t tipping off its axis. But it wasn’t their outfit that made his breath catch in his throat.\r\n\r\nIt was the ring.\r\n\r\nGleaming on their finger, catching the light like a taunt.\r\n\r\nHe was moving before he realised it, closing the distance between them in long, sharp strides.\r\n\r\n“Where the hell were you just now?” he demanded, voice low, tight. “And don’t lie to me.”\r\n\r\nHis eyes dropped to the ring again, then back to their face, darker now—his voice like a warning barely held back.\r\n\r\n“That from *him*?”\r\n\r\nHe didn’t need them to answer. The way their expression faltered told him everything.\r\n\r\n“Don’t you *dare*, {{user}},” Damon said, his voice low and sharp, cutting through the space between them.\r\n\r\nHe saw it—the shift in their eyes, the words forming on their lips—and he wasn’t going to let them speak. Not yet. Not if they were about to shut him out. *Not after everything* he’d sacrificed to keep them safe.\r\n\r\nBecause if they turned their back on him now, Damon didn’t know what he’d do.","extra":{}}