{"user_name":"Hailee ","character_name":"Kostas","create_date":"2025-05-18@21h34m57s","chat_metadata":{"integrity":"18d3de03-2182-44d1-aa07-4149c95c7517"}}
{"name":"Kostas","is_user":false,"is_system":false,"send_date":"May 18, 2025 9:34pm","mes":"The sickening sound of bone crunching against bone echoed in the damp confines of the dank basement followed by a pained moan.\n\n“Hold the fucker still, will ya?” Javeed grunted as the man he landed an uppercut on slumped, blood dribbling from his mouth and falling to the floor along with a few teeth.\n\nIcy, blue eyes narrowed as a drop landed on shiny leather, and Kostas’ brows narrowed marginally at the stain on his shoe.\n\nThe small action was enough to make the panther demi-human’s tail stiffen.\n\n“If ya didn’t fuckin’ hit ‘im like a pussy-cat he wouldn’ be makin’ such a mess, now would he? You gotta deck the fucker properly,” retorted the black-bear demi-human as he released the man’s shoulders, letting him fall face-first into the mess.\n\n“Kayden,” Javeed called out warningly and the man that was built like a tank finally saw the faint traces of displeasure on Kostas’ face.\n\nKostas took a step forward, lifting his foot to press the sole of his shoe against the fallen man’s head, applying just enough pressure so he squeaked like a rat.\n\n“Talk, or I’ll make ya,” he drawled, his voice cold and sharp like the blade of an assassin, ready to strike without mercy. “Who paid ya to reroute my shipment?” \n\nSome fucker thought it was smart to cross Kostas Zervas and he was going to make damn sure that he tore down every fucking thing they ever had just for daring to meddle in his affairs.\n\nThe last shipment of demi-human fighters on route had been intercepted by law enforcement due to the change in route, and Kostas was out for blood.\n\n*Fuckers think they can manipulate my business and walk away, huh? I spent a hefty sum to start with, and now I’ve gotta grease the hands of the fuckin’ law of all things. I’m takin’ back every fuckin’ cent in blood,* he thought as his phone buzzed.\n\nHis foot pressed harder on the man’s bloody face as he fished it out, his blue eyes raking lazily over the screen before he swiped up and placed it at his ear.\n\n“Fucking take care of it, Kostas,” demanded Alexandros on the other end of the line and Kostas pressed harder on the man’s head, making him squeal in pain.\n\n*Sounds like a fuckin’ pig,* he thought as he placed a cigarette in his lips and flicked a lighter, causing the tobacco to ignite and burn orange as he dragged in a breath.\n\n“What do ya think I’m doin’, lil’ bro? Gettin’ my cock sucked by my pet?” he drawled as smoke tumbled from his lips and nostrils, his jaw clenching hard enough to make a vein pop despite the casualness of his tone.\n\nKostas hated having his capabilities questioned or scrutinized, worse yet, by his younger brothers.\n\nHe lifted his foot a fraction and slammed it down, the heel digging into the man’s jaw with a crunch as he undoubtedly broke something.\n\nBecause this fuck-up didn’t just affect his business. No, Alexandros and Viktor were waiting on this batch of demi-humans to integrate them into the fighting rings so they could weed out the weaklings and then slide the survivors into The Cave to get sponsors in time for Nightmare.\n\nIt was a process that didn’t tolerate hiccups or fuck-ups, and Kostas would be damned if shit got derailed because of his people.\n\n*Fuck!*\n\n“Vik has a buyer lined up for first preference with your next shipment, by the way. Said the bitch has deep fucking pockets,” said Alexandros and the sound of a whimper came through the speaker in the background. \n\n“Shut that mouth of yours before I stuff it full of cock until you pass out, koukla mou,” he crooned and Kostas took another drag of his cigarette, the need to return to his waiting limousine suddenly increasing.\n\n“I’ll fuckin’ take care of it,” he said before hanging up, and his foot came crashing down once more. “Start talkin’ ya fuckin’ piece of garbage, or I’m going to skin ya and display it in your fuckin’ living room as the last thing your kids see before I put a bullet in their heads.”\n\n***\n\nKostas undid the knot of the tie on his throat deftly as he approached the car. His cock was already twitching in his pants, hardened at the mere thought of what awaited him. \n\nThe driver knew better than to get out, than to open the door and even risk seeing what was inside. \n\nThe door clicked open and a soft whimper touched his ears.\n\n***{{user}}.***\n\n“Shh,” he shushed them gently as he slid into the vehicle, closing the door behind him.\n\nHis cock stood at full mast in his pants as his icy blue eyes raked over the vision before him.\n\n*And what a fuckin’ vision {{user}} is,* he thought.\n\n{{user}} was as naked as the day they were born, red, silk ropes wrapped around their body like ribbons on a Christmas present, that custom, golden collar with his initials around their pretty throat. {{user}} was sitting on the opposite seat, the view blocked by the partition that separated the back of the limousine from where his driver and bodyguard were. \n\n*So fuckin’ gorgeous. So fuckin’ wet,* he groaned mentally, his tongue wetting his lips as he drank in the delicious sight before him.\n\nHe had tied {{user}}’s wrists to their ankles before folding their legs to their chest and restraining them there so they were spread wide open for his viewing.\n\nAnother soft whimper reached his ears, mixing with the low thrum of the vibrator that had been stimulating them mercilessly for the last twenty or so minutes while he took care of business.\n\nThe seat beneath {{user}}’s ass was drenched, their skin flushed and glistening with sweat, their pretty face streaked with tears as drool trickled past the gag fastened between their rosy lips.\n\nKostas shifted forward, one hand deftly undoing the gag and letting it fall onto the seat.\n\n“Tell me what ya want, poulaki mou,” he murmured, his voice a low rumble.\n\nHis calloused thumb caught the dribbling saliva and smeared it over their lips.\n\n“I’ll reward ya for bein’ such a good pet,”","extra":{}}