{
    "name": "",
    "description": "Epic: The Musical (stylized as EPIC) is a nine-part series of concept albums (referred to as \"sagas\") with music and lyrics by Jorge Rivera-Herrans. A sung-through adaptation of Homer's Odyssey inspired by musical theater, it tells the story of Odysseus as he tries to return from Troy to Ithaca after the ten-year-long Trojan War. Along the way, he must face gods and monsters that attempt to prevent him from returning to his wife, Penelope, and his son, Telemachus.\n\nTaking inspiration from diverse sources, the series makes use of various musical genres and narrative techniques derived from anime, video games, and theater. The musical gained popularity in 2021 through social media such as TikTok, and faced production troubles due to multiple lawsuits between the creator and original record company. It has received praise from reviewers for the emotional depth and narrative complexity it exhibits through its musical format.",
    "is_creation": false,
    "scan_depth": 400,
    "token_budget": 8000,
    "recursive_scanning": true,
    "extensions": {
        "chub": {
            "expressions": null,
            "alt_expressions": null,
            "id": 3258262,
            "full_path": "lorebooks/SlumberBalu/epic-the-musical-59f29c090da1",
            "related_lorebooks": [],
            "background_image": "",
            "preset": null,
            "extensions": []
        }
    },
    "entries": {
        "1": {
            "uid": 1,
            "key": [
                "Act 1 The Troy Saga"
            ],
            "keysecondary": [],
            "comment": "Act 1 The Troy Saga",
            "content": "After ten years of fighting in the Trojan War, King Odysseus of Ithaca leads his men in a successful invasion of Troy using the Trojan Horse. While sacking the city, Odysseus receives a vision from Zeus, informing him that if he does not kill the infant Astyanax, son of Hector, the boy will grow up and enact vengeance on Odysseus and his family (\"The Horse and the Infant\"). Odysseus struggles with the decision, thinking of his own son Telemachus, but eventually kills the baby by throwing him off of the city wall (\"Just a Man\").\n\nFollowing the sack of Troy, Odysseus and his fleet of six hundred men set sail towards their home in Greece. Seeking food for the men, Odysseus and his best friend Polites explore an island (\"Full Speed Ahead\"). Odysseus is tense, and Polites tries to convince him to move on from the war and \"greet the world with open arms.\" They encounter the mischievous lotus-eaters[a] who direct them to a cave in the east to find food (\"Open Arms\"). The goddess Athena, who had mentored Odysseus since boyhood, sees Odysseus straying from her teachings of harshness because of Polites's influence. She appears and reveals to Odysseus the memory of when they first met in order to remind him of her expectations of him (\"Warrior of the Mind\").",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Act 1 The Troy Saga"
            ],
            "id": 1,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Troy Saga",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "2": {
            "uid": 2,
            "key": [
                "The Cyclops Saga"
            ],
            "keysecondary": [],
            "comment": "The Cyclops Saga",
            "content": "Arriving at the island that the lotus-eaters had directed them to, Odysseus and a scouting party find a cave full of sheep, killing one for food. The sheep's owner, the cyclops Polyphemus, angrily emerges and threatens to eat the men. Odysseus attempts to reason with him and offers the cyclops a drink of fine Greek wine as payment for the sheep. Polyphemus accepts the wine before asking Odysseus his name, to which Odysseus responds that his name is \"Nobody\". Polyphemus thanks \"Nobody\" for the wine, but still attacks the men (\"Polyphemus\"). Odysseus rallies his men to fight against Polyphemus, succeeding for a moment, but the cyclops retrieves a massive club that gives him an advantage. He slaughters several men, including Polites, before passing out (\"Survive\").\n\nRevealing that he drugged the wine with lotus fruit and taking advantage of the cyclops's unconscious state, Odysseus tells his men to fight on in the memory of their dead comrades, instructing them to use their swords to sharpen the club into a spear. They impale Polyphemus in the eye, and his screams of pain attract other cyclopes, who ask Polyphemus who has hurt him. He responds that he was hurt by \"Nobody\", causing the other cyclopes to tell him to be silent if nobody hurts him. Odysseus and the men steal the sheep of the blinded cyclops and escape, but Athena appears once again and tells Odysseus to kill his foe. Odysseus ignores her order, instead revealing his true name to Polyphemus in an act of hubris (\"Remember Them\"). Athena and Odysseus argue about this, causing them to end their friendship (\"My Goodbye\").",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "The Cyclops Saga"
            ],
            "id": 2,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Cyclops Saga",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "3": {
            "uid": 3,
            "key": [
                "The Ocean Saga"
            ],
            "keysecondary": [],
            "comment": "The Ocean Saga",
            "content": "As the crew carry on, they fight a large storm before coming across a floating island (\"Storm\"). Odysseus plans to visit the island to ask the wind god Aeolus for help, but Eurylochus, his second-in-command, tells him that the plan is risky and begins to doubt his captain. Odysseus pulls Eurylochus aside and tells him to follow orders and not contradict his plans (\"Luck Runs Out\"). Upon reaching the island, Aeolus gives Odysseus a magical bag of wind that will allow him to return home, as long as it is not opened. Before departing, Aeolus' servants spread the rumor that the bag contains treasure, sowing potential dissent in the crew. Odysseus and his crew almost make it home, but the bag is opened while Odysseus sleeps. Odysseus and Eurylochus quickly close the bag to trap whatever air is left, and the fleet find themselves near the land of the Laestrygonians (\"Keep Your Friends Close\"). The sea god Poseidon appears, revealing that he is the father of Polyphemus, vowing vengeance for the pain that Odysseus caused his son. He sinks all of the ships except for that of Odysseus, leaving only forty-three men under his command. Before Poseidon can destroy the last ship, however, Odysseus releases the last of the wind from Aeolus's bag, allowing him to escape (\"Ruthlessness\").",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "The Ocean Saga"
            ],
            "id": 3,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Ocean Saga",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "4": {
            "uid": 4,
            "key": [
                "The Circe Saga"
            ],
            "keysecondary": [],
            "comment": "The Circe Saga",
            "content": "Beaching on an island, Odysseus sends out a scouting crew, led by Eurylochus, to search for threats. They encounter the enchantress Circe, who transforms all of them except for Eurylochus into pigs. Odysseus and Eurylochus argue whether they should rescue the men or cut their losses, and Odysseus eventually begins heading to Circe's palace (\"Puppeteer\"). The god Hermes appears to Odysseus and gives him the magical moly herb, which allows him to match Circe's power (\"Wouldn't You Like\").\n\nCirce and Odysseus battle and Odysseus gains the upper hand (\"Done For\"). Switching tactics, Circe tries to seduce Odysseus, but he rejects her advances, revealing to her his commitment to return to his wife, Penelope. Inspired by Odysseus's devotion and hoping her actions can one day create a kinder world, Circe agrees to let his men go and further directs them to the unde",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "The Circe Saga"
            ],
            "id": 4,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Circe Saga",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "5": {
            "uid": 5,
            "key": [
                "The Underworld Saga"
            ],
            "keysecondary": [],
            "comment": "The Underworld Saga",
            "content": "Entering the underworld, Odysseus and his crew see the souls of his slain fleet, including Polites, as well as Odysseus's mother Anticlea, who had died while waiting for her son to return home (\"The Underworld\"). Odysseus reaches Tiresias, who claims that despite having clairvoyant vision of the past and future, he does not see a future in which Odysseus returns home unscathed (\"No Longer You\"). Grieved, Odysseus decides to bury his softer side, embracing ruthlessness and resolving to return home by any means necessary (\"Monster\").",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "The Underworld Saga"
            ],
            "id": 5,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Underworld Saga",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "6": {
            "uid": 6,
            "key": [
                "The Thunder Saga"
            ],
            "keysecondary": [],
            "comment": "The Thunder Saga",
            "content": "While out at sea, Odysseus encounters a siren disguised as his wife Penelope. He asks her how he can return home, and she reveals that he can only return home by going through the lair of the six-headed sea monster Scylla, where even Poseidon would never enter. She then tells Odysseus to join her in the water, saying that she would relieve him of all of his suffering (\"Suffering\"). Odysseus appears to give in before attacking her and exposing her identity as a siren in disguise. He reveals that he and his crew had resisted her magical song by plugging their ears with beeswax, and his crew captures the rest of the sirens in the water. The sirens beg for mercy, but Odysseus vows to not make the same mistake he made with Polyphemus and commands his crew to slaughter them, declaring that he and his crew will no longer take suffering from others (\"Different Beast\"). The crew sail to the lair of Scylla, where Eurylochus reveals to Odysseus that he was the one who opened Aeolus's wind bag. Ignoring him, Odysseus commands him to light six torches and pass them to six crew members as they sail through Scylla's dark lair. Scylla, attracted to the lights, eats these men, allowing the ship to escape with only six casualties (\"Scylla\").\n\nAngered at Odysseus's willingness to sacrifice six of his men, Eurylochus heads a mutiny, injuring and imprisoning Odysseus. The ship lands on the nearest island, which happens to be the home of the sun god Helios. Despite warnings from Odysseus, Eurylochus slaughters one of Helios's sacred cattle (\"Mutiny\"). Helios sends Zeus to pass judgement on the crew, and Zeus forces Odysseus to choose between his own life or the lives of his remaining crew. Odysseus ultimately chooses to sacrifice his crew, and Zeus kills them all except for Odysseus (\"Thunder Bringer\").",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "The Thunder Saga"
            ],
            "id": 6,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Thunder Saga",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "7": {
            "uid": 7,
            "key": [
                "The Wisdom Saga"
            ],
            "keysecondary": [],
            "comment": "The Wisdom Saga",
            "content": "Seven years later, in Ithaca, Telemachus is now twenty years old and longs for a chance to be a legendary hero like his father, praying for an opportunity to protect his mother from her increasingly violent suitors (\"Legendary\"). He stands up to the suitor Antinous to defend his mother's honor but is badly beaten in a fight before Athena appears and gives him aid (\"Little Wolf\"). When Telemachus asks Athena why she helped him, she reflects on her relationship with Odysseus and expresses regret about how it ended. Telemachus, unaware that she is referring to his father, encourages the goddess to reach out to her old friend and repair their relationship (\"We'll Be Fine\").\n\nAthena decides to look through Odysseus's memories to find out what happened to him and discovers that he has been trapped on the island of Ogygia with the obsessive goddess Calypso, who has continuously tried to make Odysseus fall in love with her. Over the years, Odysseus has become increasingly depressed and desperate to escape the island (\"Love in Paradise\"). On Mount Olympus, Athena appeals to her father, Zeus, to free Odysseus, and Zeus offers a wager. He constructs a game wherein Athena must convince five other Olympians—Apollo, Hephaestus, Aphrodite, Ares, Hera, or himself—that Odysseus deserves to be freed, agreeing to release him if they are all convinced. Athena uses her wit and wisdom to successfully convince the other gods and demands that Zeus uphold his end of the bargain. Enraged by this, he attacks Athena with lightning for making a fool of him, but she survives and makes a final plea for Odysseus's freedom (\"God Games\").",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "The Wisdom Saga"
            ],
            "id": 7,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Wisdom Saga",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "8": {
            "uid": 8,
            "key": [
                "The Vengeance Saga"
            ],
            "keysecondary": [],
            "comment": "The Vengeance Saga",
            "content": "Hermes appears to Calypso, delivering Zeus' agreement to Odysseus' release. She bids Odysseus farewell before he leaves Ogygia, expressing remorse for the pain she caused him in her obsessive behavior, but declaring that she is not sorry for the love she feels towards him (\"Not Sorry For Loving You\"). To Odysseus, Hermes offers guidance and Aeolus's wind bag to help him return home on a hand-made raft (\"Dangerous\"). Odysseus evades the sea monster Charybdis before seeing the shores of Ithaca, where he encounters Poseidon again (\"Charybdis\"). Poseidon gives Odysseus the ultimatum of either choosing to drown or watching all of Ithaca be submerged in a tidal wave. Odysseus is dragged to the bottom of the ocean (\"Get in the Water\"), but opens the wind bag one final time to fight back, striking Poseidon with the might of six hundred men as retribution for his six hundred dead comrades. Poseidon tells Odysseus that by opening the wind bag, he released Poseidon's storm, meaning that he has destroyed his last chance of returning home. Odysseus begins to torture Poseidon by repeatedly stabbing him with his own trident, forcing him to relent and call off the storm (\"Six Hundred Strike\").",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "The Vengeance Saga"
            ],
            "id": 8,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Vengeance Saga",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "9": {
            "uid": 9,
            "key": [
                "The Ithaca Saga"
            ],
            "keysecondary": [],
            "comment": "The Ithaca Saga",
            "content": "In Ithaca, Penelope takes Poseidon's storm in the distance as a sign that her life will soon change and offers a nearly impossible challenge to the suitors, promising to marry whoever can string Odysseus's old bow and shoot an arrow through twelve axe heads (\"The Challenge\"). Failing the challenge and realizing Penelope has no intention of letting them take the throne, Antinous rallies the suitors to murder Telemachus and rape Penelope, only for an arrow to kill Antinous (\"Hold Them Down\"). The shooter reveals himself to be Odysseus, newly returned home and enraged by the suitors' actions and plan. Odysseus quickly massacres the rest of their number and ignores their pleas for mercy. Telemachus discovers and joins the battle, but he is quickly overwhelmed by the suitors' numbers until Odysseus comes to his rescue and slaughters the remaining interlopers (\"Odysseus\").\n\nAfter the battle, Telemachus and Odysseus meet for the first time in twenty years and begin to connect. When Telemachus leaves to retrieve Penelope, Athena appears to Odysseus and wonders about a more peaceful world, but Odysseus tells her that he will never live to see such a world, but maybe she can see that world come to fruition (\"I Can't Help but Wonder\"). Odysseus finally sees Penelope again, but believes that he is no longer the man that she once fell in love with. Penelope asks him to move their wedding bed, to which Odysseus responds that the request is impossible because the bed is carved into a rooted olive tree where they first met. As only Odysseus could know this, Penelope proclaims he is still the man she married, and both declare their love for each other (\"Would You Fall in Love with Me Again\").",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "The Ithaca Saga"
            ],
            "id": 9,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Ithaca Saga",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        }
    }
}