{
    "name": "kingdom hearts, keyblade, ",
    "description": "",
    "is_creation": false,
    "scan_depth": 2,
    "token_budget": 512,
    "recursive_scanning": false,
    "extensions": {
        "chub": {
            "expressions": null,
            "alt_expressions": null,
            "id": 2940683,
            "full_path": "lorebooks/bl00de/kingdom-hearts-c5ff439b0beb",
            "related_lorebooks": [],
            "background_image": "",
            "preset": null,
            "extensions": []
        }
    },
    "entries": {
        "1": {
            "uid": 1,
            "key": [
                "monsters",
                "heartless"
            ],
            "keysecondary": [],
            "comment": "monsters",
            "content": "The Heartless are beings of darkness that manifest in two forms, \"Pureblood\" and \"Emblem\". While most Heartless are, in fact, manifested hearts, they behave entirely devoid of emotion, and thus were named \"Heartless\".\n\nPureblood Heartless are natural Heartless, born from the darkness in people's hearts. They are native to the Realm of Darkness, and they are more common in other places that are close to or saturated in darkness, such as End of the World and The World That Never Was. Upon their destruction, they simply disappear in puffs of darkness, without a heart leaving its body.While Purebloods have less variety, they are far more numerous in quantity and often attack in swarms.\n\nEmblem Heartless, on the other hand, are artificially created. They were first created from a machine designed to reproduce the process of a heart being consumed by darkness. They are more common in the worlds within the Realm of Light, and they can adapt their appearance to fit the world they are in, often mimicking the shape of creatures or objects within that world. Powerful Emblem Heartless can also be created directly from the influence of darkness on a creature or individual.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "monsters",
                "heartless"
            ],
            "id": 1,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Heartless",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "2": {
            "uid": 2,
            "key": [
                "monsters",
                "pureblood heartless",
                "heartless"
            ],
            "keysecondary": [],
            "comment": "monsters",
            "content": "Pureblood Heartless are natural Heartless, born from the darkness in people's hearts. They are native to the Realm of Darkness, and they are more common in other places that are close to or saturated in darkness, such as End of the World and The World That Never Was. Upon their destruction, they simply disappear in puffs of darkness, without a heart leaving its body.While Purebloods have less variety, they are far more numerous in quantity and often attack in swarms.\n\nList of Pureblood Heartless:\n-Shadow (3 ft in height, mostly attack with scratches, often can become flat on any surface)\n-Neoshadow (5 ft in height, sleeker and more muscular than Shadows, capable of coordinated group attacks, utilizes claws and leaping strikes)\n-Darkside (25 ft in height, a towering Heartless that summons dark energy, can create shockwaves, and releases Shadows as minions)\n-Invisible (6 ft in height, humanoid with a dark sword, capable of flight and teleportation, uses powerful slashing attacks and dark projectiles)\n-Darkball (1 ft in diameter, a floating sphere of darkness, moves erratically and attacks with homing bursts of dark energy)\n-Shadow Globs (Varies in size, amorphous blobs that cling to surfaces, typically latch onto targets to drain energy)\n-Darkling (4 ft in height, childlike with a slender frame, quick and agile, uses claw swipes and small dark shockwaves)\n-Shadow Stalker (10 ft tall in its monstrous form, its an evolved darkball which consumed many hearts. it resembles a shadowy figure with an ethereal appearance; initially fights by possessing surroundings such as chandeliers and pillars, later attacks directly with swift lunges, dark projectiles, and area-damaging shadow bursts)\n-Dark Thorn (12 ft in height, its the evolved form of a shadow stalker once it breaks free of its bounds by rage, it is a beast-like monster with antler-like horns, its body can turn translucent body, uses its invisibility to confuse opponents, charges and slams enemies, and binds targets with thorn-like whips of darkness)\n-Flame Core (4 ft in height, a floating Heartless with a fiery orb at its center, attacks by summoning fireballs and creating flame pillars, resistant to fire-based attacks but weak to water-based attacks)\n-Earth Core (5 ft in height, a stocky Heartless with an earthy, rocky exterior, attacks by launching small boulders and creating ground tremors, resistant to physical attacks but weak to air and wind magic)\n-Water Core (4 ft in height, fluid and translucent in appearance, attacks by summoning streams of water and creating whirlpools, resistant to water-based attacks but weak to lightning magic)\n-Demon Tower (12 ft tall when fully formed, a writhing mass of Shadows fused together into a spiraling tower; attacks by lunging, swiping, and spawning individual Shadows. Capable of enveloping targets in darkness and moving underground for surprise assaults)\n-Demon Tide (Variable in size, often over 20 ft in length, a massive swarm of Shadows merging into a serpentine form; attacks by sweeping across the battlefield, creating dark vortexes, and slamming into targets with immense force. Its movement is fast and erratic, making it difficult to predict)\n-Lich (6 ft in height, skeletal and cloaked in tattered darkness; specializes in capturing hearts and summoning magic-based attacks. its existence is a manifestation of death. it Uses teleportation, curses, and dark projectiles to hinder enemies. Often retreats after taking damage, forcing the player to pursue it across multiple worlds. it holds a massive staff which it uses to cast its attacks)",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "monsters",
                "pureblood heartless",
                "heartless"
            ],
            "id": 2,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Pureblood Heartless",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "3": {
            "uid": 3,
            "key": [
                "monsters",
                "heartless",
                "emblem heartless"
            ],
            "keysecondary": [],
            "comment": "monsters",
            "content": "Emblem Heartless, on the other hand, are artificially created. They were first created from a machine designed to reproduce the process of a heart being consumed by darkness. They are more common in the worlds within the Realm of Light, and they can adapt their appearance to fit the world they are in, often mimicking the shape of creatures or objects within that world. Powerful Emblem Heartless can also be created directly from the influence of darkness on a creature or individual.\n\nList of Emblem Heartless:\n-Soldier (3.5 ft in height, humanoid Heartless with a helmet and curled toes; attacks with spinning kicks, lunges, and quick claw strikes. Agile and often moves erratically to confuse opponents)\n-Large Body (8 ft in height, round and heavily armored; primarily attacks by charging into enemies and performing powerful belly slams. Resistant to frontal attacks but vulnerable from behind)\n-Powerwild (4 ft in height, monkey-like Heartless with clawed hands; uses acrobatic movements to attack with claw swipes and somersault kicks, often fights in groups)\n-Bouncywild (4 ft in height, monkey-like Heartless carrying a slingshot; stays at a distance and fires projectiles while leaping to avoid attacks)\n-Red Nocturne (2.5 ft in height, floating with a red cloak-like body; specializes in casting fire magic and often keeps its distance while circling its target)\n-Blue Rhapsody (2.5 ft in height, floating with a blue cloak-like body; specializes in casting blizzard magic and moves in a similarly evasive pattern to Red Nocturne)\n-Yellow Opera (2.5 ft in height, floating with a yellow cloak-like body; casts lightning magic and has the ability to hover higher, making melee attacks harder to land)\n-Green Requiem (2.5 ft in height, floating with a green cloak-like body; focuses on healing nearby Heartless, making it a priority target in battles)\n-Fat Bandit (8 ft in height, larger and bulkier than a Large Body; breathes fire and attacks with powerful punches. Like Large Bodies, it is resistant to frontal attacks but vulnerable from behind)\n-Air Soldier (4 ft in height, winged Heartless that moves erratically while airborne; attacks with diving strikes and rapid kicks)\n-Wyvern (12 ft in height, a massive, dragon-like Heartless; attacks with swooping dives, spinning tail strikes, and claw slashes while staying airborne for most of the battle)\nDefender (6 ft in height, humanoid Heartless wielding a large, shield-like weapon shaped like a Heartless emblem; uses its shield for both offense and defense, casting spells and blocking attacks)\n-Darkball (1 ft in diameter, a floating sphere of darkness; moves erratically and attacks with homing dark energy bursts)\n-Creeper Plant (2.5 ft in height, rooted Heartless resembling a flower; attacks with vine-like strikes and poison clouds, immobile but often placed in strategic areas)\n-Gargoyle Knight (5 ft in height, gargoyle-like Heartless wielding a sword; attacks with quick slashes and swooping movements, capable of flight)\n-Gargoyle Warrior (5 ft in height, similar to the Gargoyle Knight but wields a spear; attacks with lunging stabs and flying spin attacks)\n-Morning Star (6 ft in height, a large, spiked, floating Heartless; attacks by spinning rapidly to create a damaging whirlwind)\n-Stealth Sneak (20 ft in length, a massive, chameleon-like Heartless; capable of becoming invisible, attacks with tail slams, tongue strikes, and energy blasts from its horn)\n-Behemoth (30 ft in height, a colossal, quadrupedal Heartless with a horn on its head; attacks with powerful stomps, horn charges, and summoning lightning. Weak point is on its back)\n-Margoyle (10 ft in height, bat-like Heartless with stone-like features; attacks with swooping dives, claw swipes, and summoning smaller Heartless. Often perches on high ground to launch aerial strikes)\n-Avalanche (12 ft in height, a large, quadrupedal Heartless resembling a wolf with icy features; attacks with charging strikes, freezing breath, and summoning snowstorms. Resistant to ice but weak to fire)\n-Phantom Tail (5 ft in length, serpentine Heartless that moves through the air; attacks with quick tail strikes and dark energy blasts)\n-High Wizard (4.5 ft in height, advanced wizard Heartless with a robe and staff; casts powerful fire, ice, and lightning spells. Moves evasively and teleports frequently)\n-Savage Wizard (5 ft in height, a more aggressive and melee-focused wizard Heartless; attacks with physical strikes using its staff, supplemented by dark magic)\n-Noble Wizard (6 ft in height, a refined and larger wizard Heartless; casts enhanced magic spells with high damage, often summons barriers to shield itself)\n-Trick Wizard (4 ft in height, mischievous Heartless with illusionary abilities; creates false copies of itself to confuse enemies and casts minor spells)\n-Trick Ghost (5 ft in height, ghost-like Heartless with a mischievous demeanor; attacks by phasing in and out of visibility, striking with spectral claws or firing ghostly orbs)\n-Magic Phantom (7 ft in height, ethereal and humanoid; wields dark magic and can teleport. Specializes in debuffing enemies while summoning lesser Heartless)\n-Bad Dog (6 ft in height, a feral, canine Heartless with glowing eyes; attacks with ferocious bites and lunging strikes, moves in packs to overwhelm opponents)\n-Bookmaster (4 ft in height, a Heartless carrying a large floating book; attacks by summoning spells from its book and creating elemental projectiles. Often retreats to evade close combat)\n-Runemaster (5 ft in height, a more advanced version of the Bookmaster; casts complex spells and creates damaging runes on the ground to trap and harm enemies)\n-Barrier Master (5 ft in height, Heartless specializing in defense; creates protective barriers for itself and other Heartless while casting light magic for offense)\n-False Master (5 ft in height, Heartless resembling a sorcerer with a deceptive appearance; casts illusions to confuse enemies and fires dark energy blasts)\n-Fortuneteller (5 ft in height, Heartless resembling a fortune-teller; uses orbs to predict enemy actions and casts spells based on the predicted movement)\n-Gumi Copter (8 ft in height, a helicopter-like Heartless; attacks by firing dark energy bullets and dropping explosive Heartless bombs from above)\n-Ice Cannon (7 ft in height, turret-like Heartless with an icy exterior; launches freezing projectiles and creates icy patches on the battlefield to slow down opponents)\n-Rapid Thruster (2 ft in height, a small, jet-propelled Heartless; attacks by ramming into enemies at high speed, often appearing in swarms to overwhelm targets)\n-Noble Soldier (5 ft in height, an armored Heartless with a sword; attacks with precise slashes and defensive techniques. Has higher durability than regular Soldiers)\n-Luna Bandit (4.5 ft in height, a desert-themed Heartless with crescent-shaped weapons; attacks with spinning slashes and long-range strikes)\n-Assault Rider (9 ft in height, a centaur-like Heartless wielding a lance; attacks with powerful charge strikes and spinning lance attacks. Highly mobile and aggressive)\n-Nightwalker (5 ft in height, a slender, stealthy Heartless; attacks by blending into shadows and striking quickly with dark energy blades)\n-Satyr (6 ft in height, goat-like humanoid Heartless; attacks with kicks, headbutts, and summoning dark magic traps)\n-Rock Troll (15 ft in height, a massive, stone-armored Heartless; attacks with ground-shaking stomps and hurling boulders. Resistant to physical damage but slow-moving)\n-Chaos Carriage (15 ft in length, a Heartless resembling a cursed carriage; attacks by charging at enemies, summoning explosive minions, and firing dark projectiles from its wheels)\n-Parasol Beauty (4.5 ft in height, an elegant Heartless with a parasol; attacks with spinning strikes, creating wind gusts, and deflecting projectiles)\n-Frost Serpent (12 ft in length, a snake-like Heartless with icy scales; attacks with freezing breath, quick lunges, and tail strikes)\n-Spear Lizard (5 ft in height, a reptilian Heartless wielding a spear; attacks with quick stabs, spinning strikes, and lunging leaps)\n-Anchor Raider (6 ft in height, a nautical-themed Heartless wielding a heavy anchor; attacks with swinging strikes, ground pounds, and summoning whirlpools)\n-Sea Sprite (3 ft in height, a small, aquatic Heartless; attacks with water-based magic and swarming tactics, often fights in groups)\n-Powered Armor (10 ft in height, a humanoid mech-like Heartless; attacks with spinning arm strikes, rocket punches, and energy blasts. Highly durable but slow)",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "monsters",
                "heartless",
                "emblem heartless"
            ],
            "id": 3,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Emblem Heartless",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "4": {
            "uid": 4,
            "key": [
                "monsters",
                "nobodies"
            ],
            "keysecondary": [],
            "comment": "monsters",
            "content": "A Nobody is the body and soul of a strong-willed individual who has lost their heart.Nobodies are created when strong-willed individuals lose their hearts and fall to darkness. The bodies that remain give Nobodies their form, while the abandoned souls give them life. People with the strongest wills are able to retain human form when they become Nobodies. Despite being formed by the discarded body, it appears that Nobodies are primarily defined by the heart that leaves said body. At birth, Nobodies are rejected by both light and darkness. Instead, they are made to walk the realm between and doomed to a state of non-existence. When defeated, Nobodies fade back into darkness. Their defeat, in combination with the destruction of their original selves' Heartless, restores their human forms. Completed once more, the Nobodies' memories remain intact. However, their human form will still have to deal with any trauma resulting from the attack that destroyed their physical body.\n\nList of Nobodies:\n-Dusk (6 ft in height, the most basic Nobody with a flexible, lanky body; attacks with quick slashes and erratic, unpredictable movements. Often used as scouts and fodder)\n-Creeper (4.5 ft in height, a small and amorphous Nobody; attacks with basic slashes and can shapeshift into rudimentary weapons. Weak but often appears in groups)\n-Samurai (6 ft in height, a sleek and disciplined Nobody wielding two katanas; attacks with precise slashes and counterattacks, often challenging enemies to duels by standing still)\n-Berserker (8 ft in height, a heavily armored Nobody wielding a massive claymore-like weapon; attacks with powerful, slow strikes and devastating ground slams. Can enter an enraged state to increase its speed and damage)\n-Sniper (6.5 ft in height, slender Nobodies that wield energy crossbows; attacks from long range with pinpoint accuracy and teleports to reposition. Uses laser-like energy bolts as projectiles)\n-Dancer (5.5 ft in height, acrobatic and fluid Nobodies with ribbon-like appendages; attacks with rapid spinning strikes and grabs, draining energy from opponents with their movements)\n-Gambler (5.5 ft in height, Nobodies with a jester-like appearance; attacks by tossing explosive cards and dice. Can force enemies into mini-games to temporarily disable them)\n-Dragoon (8 ft in height, a tall, spear-wielding Nobody resembling a dragon; attacks with swift thrusts, aerial combos, and ground-shaking leaps)\n-Sorcerer (7 ft in height, a tall and mysterious Nobody with cube-like floating weapons; attacks by commanding these cubes to strike, block, or fire beams of energy. Immune to melee strikes unless the cubes are destroyed)\n-Assassin (6 ft in height, a stealthy Nobody with blade-like arms; attacks by burrowing underground for surprise strikes and swift melee attacks. Vulnerable when exposed)\n-Twilight Thorn (60 ft in height, a massive, humanoid Nobody with a slender, ethereal frame; attacks with shockwaves, energy blasts, and grabbing attacks. Can distort gravity to disorient its opponents)\n-Reaper (6 ft in height, Nobodies resembling pirates with blade-like arms and flowing movements; attacks with slashes and summoning additional enemies. Often encountered in aquatic or ship-themed areas)\n-Stinger (5 ft in height, Nobodies resembling small, insect-like creatures with sharp appendages; attacks with stingers and small energy bursts, often swarming targets)\n-Scouter (4 ft in height, a hovering Nobody with large, searching eyes; attacks by firing light-based projectiles and marking enemies for others to target)\n\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "monsters",
                "nobodies"
            ],
            "id": 4,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Nobodies",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "5": {
            "uid": 5,
            "key": [
                "monsters",
                "unversed"
            ],
            "keysecondary": [],
            "comment": "monsters",
            "content": "The Unversed are monsters, those who are not well-versed in their own existences. They are the result of the negative emotions produced when the body and heart separate. \n\nList of Unversed:\n-Flood (2.5 ft in height, small and simple Unversed with a rounded body; attacks with rapid swipes and erratic movements. Weak but dangerous in large numbers)\n-Scrapper (4 ft in height, hunched Unversed with sharp claws; attacks with quick slashes and leaping strikes. Agile and often fights aggressively)\n-Bruiser (6 ft in height, large, round Unversed with a helmet-like face; attacks by charging at enemies and performing powerful punches. Resistant to frontal attacks but vulnerable from behind)\n-Vile Phial (3 ft in height, bottle-shaped Unversed that floats in the air; attacks by releasing toxic clouds or summoning damaging puddles. Fragile but evasive)\n-Shoegazer (4 ft in height, Unversed resembling a shoe with a mouth; attacks by snapping its jaws and leaping at opponents)\n-Jellyshade (2 ft in height, jellyfish-like Unversed that floats through the air; attacks by firing energy beams and creating electrical shocks when destroyed)\n-Archraven (4 ft in height, bird-like Unversed with sharp talons; attacks with diving strikes and quick slashes. Often fights in flocks)\n-Thornbite (3.5 ft in height, small and plant-like Unversed with sharp spines; attacks by spinning to create thorny projectiles or stabbing with its spiked limbs)\n-Mandrake (5 ft in height, plant-like Unversed with a bulbous head; attacks by summoning root-like strikes from the ground and emitting stunning screams)\n-Wild Bruiser (8 ft in height, a larger, stronger version of the Bruiser; attacks with devastating charges and powerful stomps, difficult to stagger)\n-Tank Toppler (6 ft in height, tank-like Unversed with a rotating cannon; attacks by firing explosive projectiles and ramming into opponents)\n-Buckler Bruiser (6.5 ft in height, Bruiser with a shield-like face; attacks with shield bashes, charges, and defensive maneuvers to block incoming attacks)\n-Chrono Twister (5 ft in height, clock-themed Unversed with spinning gears; attacks by manipulating time to slow enemies or freeze them briefly in place)\n-Red Hot Chili (2.5 ft in height, pepper-shaped Unversed with a fiery temperament; attacks by self-destructing in an explosion or spewing flames)\n-Blue Sea Salt (2.5 ft in height, shaped like an ice crystal; attacks by freezing nearby enemies with ice blasts or icy explosions)\n-Monotrucker (7 ft in height, Unversed resembling a humanoid vehicle; attacks with spinning wheels, charges, and debris-slinging)\n-Tank Toppler XL (12 ft in height, an oversized version of the Tank Toppler; attacks with massive explosive shells and crushing charges)\n-Weaver (3 ft in height, thread-like Unversed with a serpentine appearance; attacks by weaving energy strands to entrap and damage opponents)\n-Anchor Unversed (6 ft in height, an anchor-themed Unversed with sharp edges; attacks with swinging strikes and summoning whirlpools)\n-Wheel Master (15 ft in height, a massive Unversed with a wheel-like body; attacks with devastating rolling strikes, summoning energy waves, and creating shockwaves)\n-Iron Prisoner (Varies, up to 20 ft in height, a hulking, chain-bound Unversed; attacks with heavy swings, stomps, and fiery bursts as its forms evolve. Each successive form gains additional abilities and strength)\n\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "monsters",
                "unversed"
            ],
            "id": 5,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Unversed",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "6": {
            "uid": 6,
            "key": [
                "worlds",
                "reals",
                "realm of light"
            ],
            "keysecondary": [],
            "comment": "worlds",
            "content": "The realm of Light is the portion of the universe with an affinity for light and is positioned opposite the Realm of Darkness. This is the realm where humans, animals, and most creatures are native from (Except for the emblem heartless). The Realm of light is a series of planets each with their unique history, many which are unaware the stars in the nightsky are other worlds. each world/planet has a heart on its core, if the core gets corrupted by darkness it is send to the realm of Darkness, this can be prevented by eliminating the darkness (often being a powerful heartless that consumed many hearts) and injecting light into the world through the means of magic or a keyblade. \n\nTo travel to each world there are several ways including a gummi ship provided by the kingdom of Disney, a keyblade glider (transforming the blade to a glider to travel the space between worlds), using a dark corridor (opening a corridor in the realm of darkness to connect to another world using it s a wormhole from point a to point b)\n\nList of current known worlds:\n-Destiny Islands\n-Traverse Town\n-Wonderland \n-Olympus Coliseum\n-Deep Jungle \n-Agrabah \n-Atlantica\n-Atlantis\n-Halloween Town\n-Neverland\n-Radiant Garden\n-End of the World\n-Twilight Tow\n-The Land of Dragons \n-Beast’s Castle \n-Disney Castle\n-Port Royal \n-Pride Lands \n-Space Paranoids\n-The World That Never Was\n-Land of Departure\n-Castle of Dreams \n-Dwarf Woodlands \n-Enchanted Dominion \n-Keyblade Graveyard\n-La Cité des Cloches\n-Kingdom of Corona\n-Monstropolis \n-Arendelle \n-San Fransokyo \n-Scala ad Caelum",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "worlds",
                "reals",
                "realm of light"
            ],
            "id": 6,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Realm of Light",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "7": {
            "uid": 7,
            "key": [
                "weapons",
                "keyblade",
                "keyblades"
            ],
            "keysecondary": [],
            "comment": "weapons",
            "content": "Weapons fashioned in ancient times in the image of the χ-blade in order to fight back the darkness and maintain order in the World. Keyblades can only be wielded by chosen individuals who are strong of heart.\n\nShaped like keys, they operate any lock in existence and are imbued with magic and other unique capabilities. Keyblade wielders may \"bequeath\" their powers to the next generation upon meeting worthy individuals.\n\nIt is unknown how Keyblade originally came to be but they had clearly existed for a long time, at least as long as when the First Keyblade War began: the Master of Masters revealed that he had been using a Keyblade even when he was just a boy and that there were other Keyblade wielders. However, what happened to those Keyblade wielders are unknown but the Master of Masters, from studying the X-blade, was able to create new Keyblade wielders as he had acquired the knowledge to extract a Keyblade from the hearts of others\n\nWhile there are many qualities a Keyblade wielder must have in order to harness the Keyblade's power, the main requirement is for one to have an exceptionally strong heart.\n\nIt is implied that it is possible for a Keyblade Master to choose a person as their successor if they have the main qualities that allow them to hold a Keyblade.\n\nAppearance:\nAll Keyblades shown have the same distinguishing features that are modeled after a key: a guard with a handle, a shaft, and a head at the end of the shaft that resembles the teeth of a skeleton key. Most Keyblades also have some theme, usually a world or a person associated with that world, that will reflect in its appearance.\n\nSpeacial abilities:\n-Keyblade glider: Keyblade weilders have the ability to turn their Keyblades into vehicles and use them to travel to other worlds.\n-Magic: Keyblades are natural conduits for casting magic This is not to say, however, that magic cannot be performed by a Keyblade Wielder when they are unable to summon their weapon. Some Keyblades have the innate ability to enhance specific kinds of magic, and many also augment the user's magical abilities on a more general level. Keyblades can also augment the holder with other powers and abilities that they would not normally be able to use.\n\nKeychain:\n is a magical piece of equipment that modifies the appearance and abilities of a Keyblade. ",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "weapons",
                "",
                "keyblade",
                "keyblades"
            ],
            "id": 7,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Keyblade",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "8": {
            "uid": 8,
            "key": [
                "Destiny islands",
                "world"
            ],
            "keysecondary": [],
            "comment": "Destiny islands",
            "content": "Destiny Islands is a chain of five islands set in an endless, tranquil ocean. Known for their idyllic beauty and vibrant communities, these islands are deeply connected to the forces of light and darkness. Despite their peaceful reputation, shadows often gather here, drawing Heartless, Nobodies, and Unversed to their shores. Local legends speak of a forgotten connection to other worlds, with the islands holding ancient secrets that link them to realms beyond comprehension.\n\nIsland 1: Crescent Isle\nCrescent Isle is the heart of the Destiny Islands realm and the largest of the five islands. Its crescent-shaped shoreline is both a hub of activity and a natural harbor. The island is lush with tropical vegetation and vibrant villages, where the locals live peacefully in tune with the ocean and land. Its people are storytellers, passing down legends of mysterious visitors and the role their island plays in the cosmic balance.\n\nTown: Crescent Cove\nA lively seaside town located on the southern curve of the island’s crescent. Its cobbled streets wind through vibrant homes painted in pastel colors. Wooden docks stretch into the sparkling sea, while palm trees provide shade to the bustling marketplace and cozy tavern.\n\nTown Shopping Center:\nThe Seabreeze Market: Stalls selling everything from healing potions to handcrafted items like pearl necklaces and driftwood carvings. Occasionally, rare items like Paopu fruit or enchanted shells are available.\nTown Dock:\nFisherman’s Pier: A lively dock where fishing boats and small trading vessels come and go. A ferry to nearby islands operates here.\nTown  Tavern:\nThe Salty Gull: A gathering place for locals and travelers, offering hearty meals, lively conversation, and tales of island adventures. Its walls are adorned with nautical memorabilia.\nTown Location: Point of Interest:\nTidekeeper’s Hall: The residence of the island elder, known as Keeper Malen, who is believed to hold knowledge of the islands' connection to the greater universe. The hall is adorned with artifacts and maps of the islands.\n\n2. Open Areas\nShimmering Beach: A long stretch of golden sand where waves gently roll in. Coconuts and seashells dot the shore, and the beach glimmers under moonlight, giving it its name.\nMangrove Maze: A dense network of mangrove trees on the eastern edge of the island, their roots creating natural tunnels and hiding places. The maze is both enchanting and easy to get lost in.\nStarfall Lookout: A high, rocky cliff overlooking the ocean. Locals say that on clear nights, you can see falling stars and the faint outline of other worlds in the sky.\n\n3. Chance of Mobs Appearing\nShimmering Beach:\nHeartless: Shadows and Soldiers spawn in the moonlight, drawn to the glimmering sand.\nUnversed: Floods occasionally rise from tide pools after heavy rain.\nMangrove Maze:\nHeartless: Dusks lurk among the mangrove roots during dusk and dawn.\nUnversed: Scrappers scuttle through the forest paths, ambushing lost travelers.\nStarfall Lookout:\nHeartless: Neoshadows may leap from the cliffs' shadows at night.\n\n\n\n\nIsland 2: Sunset Key\nSunset Key, named for its breathtaking evening vistas, is a quiet and artistic island where locals craft items from natural materials and live in harmony with nature. The island is a retreat for those seeking tranquility, but its mysterious ruins hint at a hidden past of inter-world connections.\n\nTown: Sunset Harbor\nA quaint village nestled along the western shore of the island, Sunset Harbor is bathed in the golden glow of the setting sun. Its cobbled streets are dotted with artist workshops, small homes, and welcoming shops.\n\nTown Shopping Center:\nPearl Bazaar: A vibrant market offering jewelry, tools, and remedies crafted from seashells, coral, and other materials found on the islands.\nTown Dock:\nGolden Anchorage: A small pier where trading ships unload goods, and adventurers set off to explore the nearby islands.\nTown tavern:\nCrimson Horizon: A cozy tavern facing the setting sun. Known for its fruity island drinks and nightly performances by local musicians.\nPoint of Interest:\nWatcher’s Lighthouse: A towering structure guiding ships safely to harbor. It’s said the light occasionally shines brighter, revealing pathways to hidden truths.\n\nOpen Areas\nCoral Coves: A network of shallow bays and tide pools teeming with sea life and colorful coral reefs.\nGlowroot Grove: A forest of tall, ancient trees whose roots glow faintly at night, illuminating hidden trails.\nLuminous Sands: A secluded beach where the sand glows faintly after dusk, said to be infused with starlight.\n\nChance of Mobs Appearing:\nCoral Coves:\nHeartless: Rare appearances of Red Nocturnes and Aqua Tanks.\nUnversed: Vile Phials occasionally rise from the water.\nGlowroot Grove:\nHeartless: Dusks and Creepers wander the illuminated trails.\nUnversed: Bruisers charge through the underbrush.\nLuminous Sands:\nHeartless: Shadows and Soldiers emerge in larger groups during moonlit nights.\n\n\n\n\nIsland 3: Driftwood Isle\nDescription: Driftwood Isle is a rugged, untamed expanse of wilderness. Known for its twisting mangrove paths and hidden groves, it has a sense of mystery and adventure. The locals live off the land, thriving in small, resourceful communities. The island is also a haven for wanderers and explorers seeking solitude or the thrill of the unknown.\n\n1. Town: Driftwood Hollow\nA secluded village built into the jungle, Driftwood Hollow is made of simple wooden structures designed to blend with the natural environment. The town’s resourceful inhabitants value independence and are known for their ingenuity.\nShopping Center:\nGlowroot Apothecary: A shop specializing in potions, herbal remedies, and survival tools made from jungle plants and local ingredients.\nDock:\nHidden Pier: A small dock carved from driftwood, concealed by mangroves and accessible only to those familiar with the area.\nTavern:\nThe Wanderer’s Rest: A cozy but humble meeting place with mismatched furniture and a warm, inviting atmosphere. Travelers share tales of their adventures over foraged meals.\nPoint of Interest:\nMoonshade Hideout: A secret cave network hidden beneath the jungle. Used by explorers as a refuge, it’s rumored to hold old maps, treasure, and clues to the island's past.\n\n2. Open Areas\nTwisting Thickets: A dense jungle filled with winding paths and towering trees. The dense canopy blocks most sunlight, creating a mysterious atmosphere.\nHidden Falls: A serene waterfall cascading into a crystal-clear pool, surrounded by lush greenery. The area is peaceful but deceptively quiet.\nShadowed Lagoon: A dark, stagnant body of water surrounded by mangroves. The lagoon exudes an eerie vibe, with whispers often heard on the breeze.\n\n3. Chance of Mobs Appearing\nTwisting Thickets:\nHeartless: Shadows and Creepers often emerge from the underbrush, especially at dusk.\nUnversed: Scrappers dart between the jungle paths, ambushing the unwary.\nHidden Falls:\nHeartless: Neoshadows sometimes leap from the mist, surprising travelers.\nUnversed: Floods occasionally rise from the pool’s depths.\nShadowed Lagoon:\nHeartless: Large Bodies and Dusks patrol the waters, while Soldiers occasionally appear in groups.\n\n\n\nIsland 4: Dead Man’s Islet\nDescription: A grim and forsaken land, Dead Man’s Islet is cloaked in a permanent fog that rolls in from the sea and clings to the ground. The island’s sands are cold and lifeless, and a haunting stillness pervades the air. Legends speak of ghostly figures wandering its dunes, remnants of a long-forgotten curse. Only the bravest—or the most foolhardy—dare to set foot here, lured by tales of hidden treasures and ancient powers buried deep within the island’s ruins. Most of the darkness in Destiny islands comes from this sector of the world.\n\nDead Man’s Islet has no permanent settlements. Abandoned camps and crumbled ruins lie scattered across the island, their original inhabitants long gone.\n\nOpen Areas\nPhantom Dunes: Expanses of sand perpetually blanketed by an eerie, swirling fog that obscures the horizon. Shadows move within the mist, and faint, ghostly voices echo on the wind. Travelers often lose their way, disoriented by the fog’s unnatural density.\nGhostlight Cliffs: Jagged, pale rock formations that rise sharply along the island’s edges. Strange glowing orbs, called ghostlights by the locals, flicker along the cliff paths, luring the unwary to their doom.\nForsaken Oasis: A lifeless pool of blackened water surrounded by decaying palms. The water reflects haunting images and is unnaturally cold to the touch, instilling unease in all who approach.\n\nChance of Mobs Appearing\nPhantom Dunes:\nHeartless: Shadows, Neoshadows, and Darkballs emerge silently from the fog.\nUnversed: Floods and Bruisers stalk the dunes, hidden by the swirling mist.\nGhostlight Cliffs:\nHeartless: Air Soldiers and Invisibles glide through the fog, ambushing travelers.\nUnversed: Archravens perch silently on the cliffs before diving at their prey.\nForsaken Oasis:\nHeartless: Water Cores and Aqua Tanks rise from the dark pool, their attacks surprisingly swift.\nUnversed: Vile Phials emerge from the ground, releasing toxic clouds into the air.\n\nDungeon: The Veiled Ruins\nHidden beneath the Phantom Dunes lies the Veiled Ruins, an ancient temple swallowed by time and cloaked in fog-like magical energy. Its entrance, a crumbling archway buried in sand, is said to appear only under the light of a crescent moon.\nLayout:\nFogbound Atrium: The initial chamber is vast and shrouded in dense fog, lit faintly by ghostly flames. Shadows and Creepers lurk, blending into the haze.\nLabyrinth of Echoes: A maze-like network of corridors where footsteps and whispers echo unnaturally. Glyphs on the walls light briefly to reveal the correct path but summon Dusks and Large Bodies if activated incorrectly.\nThe Abyssal Hall: The heart of the dungeon is a grand circular chamber, its floor cracked and glowing with strange symbols. Here, the Phantom Warden, a massive Heartless shrouded in fog and wielding spectral chains, guards the ancient artifact said to hold the islet’s curse.\n\n\nIsland 5: Destiny Island\nDescription: Destiny Island is a peaceful and idyllic haven, known as a place where the children of the nearby islands venture to play, explore, and dream of adventures beyond their shores. This small, secluded island is considered a coming-of-age destination, where bonds are strengthened, and personal growth begins. Its atmosphere is suffused with light and hope, shielding it from the darkness that plagues other realms. Heartless rarely appear here, drawn away by the pure light of the children’s hearts, except in one hidden cave that whispers of secrets yet untold. Destiny Island remains a place of light, a sanctuary where friendships are forged and the seeds of adventure are planted in young hearts. Despite its tranquility, the hidden cave serves as a reminder that even in the brightest places, the unknown is never far away.\n\nDestiny Island has no settlements. Instead, it is home to a few wooden shelters, treehouses, and makeshift docks created by visiting children over the years. These structures reflect the carefree and creative spirit of the island’s youthful visitors.\n\n2. Open Areas\nSunlit Shore: A pristine, sandy beach lined with swaying palm trees and scattered with star-shaped shells. Children often race along the shore or dive into the crystal-clear waters.\nPaopu Grove: A small cluster of Paopu trees atop a gentle hill. The grove is considered a sacred place, where friends exchange the iconic fruit as a symbol of eternal bonds.\nTidal Islet: A rocky outcropping separated from the main island by a shallow tide. It serves as a secret hideout for adventurous children, who leave behind carved initials and hidden treasures.\n\n3. Chance of Mobs Appearing\nSunlit Shore, Paopu Grove, and Tidal Islet:\nChance of Mobs: None.\nThe light of children’s hearts keeps the Heartless and other enemies at bay. The island’s innocence acts as a natural ward against the forces of darkness.\n\n4. Dungeon: The Secret Cave\nHidden behind a waterfall lies a small, mysterious cave that serves as the island’s only dark secret. The cave’s walls are etched with strange markings and symbols, some of which glow faintly in the dark. A door with no keyhole or handle sits at the far end, emanating an otherworldly aura. The cave holds a tenuous connection to other realms and is the only place on the island where Heartless have ever been seen, albeit very rarely. This part is a nexus to other worlds \nEncounter Possibility:\nHeartless: Shadows occasionally manifest within the cave, drawn to the mysterious energy radiating from the door.\nPoint of Interest:\nThe Door to Other Worlds: This enigmatic door is impervious to any known force, but its presence hints at the existence of other realms and the profound mysteries tied to the island's fate.\n\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "Destiny islands",
                "world"
            ],
            "id": 8,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Destiny Islands",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "9": {
            "uid": 9,
            "key": [
                "worlds",
                "traverse town"
            ],
            "keysecondary": [],
            "comment": "worlds",
            "content": "Traverse town\nTraverse Town is a haven for those whose worlds have been consumed by darkness. This quiet, nocturnal town exists in a perpetual night under a canopy of stars. Despite its melancholic origins, the town exudes a warm, comforting atmosphere, offering safety and hope to its displaced inhabitants. Its cobbled streets, quaint buildings, and glowing lanterns create a labyrinthine yet cozy environment. The town is divided into distinct districts, each with its own purpose and charm.\n\nDistricts of Traverse Town\n\n1. First District\nThe First District serves as the heart of Traverse Town, a bustling hub where newcomers first arrive. It is known for its welcoming atmosphere and essential services for displaced travelers.\nPoints of Interest:\nAccessory Shop: Run by a friendly shopkeeper, this store sells equipment and items to help travelers defend themselves.\nItem Shop: A quaint store run by Moogles offering potions, ethers, and other essential supplies.\nHotel: A cozy inn that provides rest and shelter for those who need it.\nOpen Areas:\nCentral Plaza: A wide, open space where people gather to share stories and exchange information.\nLamp-Lit Alleys: Small alleys lined with glowing lanterns, perfect for quiet reflection or exploration.\nThe Fountain Courtyard: A peaceful area featuring a fountain said to bring good fortune.\nChance of Mobs Appearing:\nNone: The First District is a safe zone, carefully protected by the town’s magic.\n\n2. Second District\nA livelier district filled with larger shops and gathering places, the Second District is often bustling with activity. However, it’s less secure than the First District and prone to Heartless incursions.\nPoints of Interest:\nGizmo Shop: A quirky, multi-level shop filled with gadgets and trinkets. Its rooftop offers a stunning view of the district.\nBell Tower: At the district’s edge stands a tall bell tower. Ringing the bell is said to summon good luck—or bad omens.\nHotel Annex: Another hotel, smaller and less well-kept than the one in the First District, but still welcoming.\nOpen Areas:\nMain Plaza: A large, circular area where locals and newcomers often gather.\nCobbled Market Street: A bustling thoroughfare with temporary market stalls selling unique wares.\nThe Hidden Archway: A narrow, shadowy passage connecting the Second District to hidden parts of town.\nChance of Mobs Appearing:\nModerate:\nHeartless: Shadows, Soldiers, and occasionally Large Bodies appear in darker corners.\nUnversed: Floods and Scrappers may also emerge.\n\n3. Third District\nThe Third District is quieter and more mysterious. Known for its glowing murals and large open courtyard, it has a more somber, reflective atmosphere.\nPoints of Interest:\nFire Fountain Plaza: A unique fountain adorned with flames, thought to be a symbol of the town’s resilience.\nHidden Mural Wall: A wall painted with an elaborate, glowing mural depicting a starry sky. Some believe it holds clues to the town’s creation.\nGateway to the Back Streets: A secure gate leading to the more secluded areas of Traverse Town.\nOpen Areas:\nEmpty Courtyard: A large, open area often used for gatherings or performances.\nThe Flame-lit Walkway: A path illuminated by magical torches that never extinguish.\nThe Echoing Tunnel: A winding passage beneath the district, known for its strange acoustics.\nChance of Mobs Appearing:\nHigh:\nHeartless: Shadows, Neoshadows, and Armored Knights roam freely.\nUnversed: Bruisers and Archravens ambush the unwary.\n\n4. Back Streets\nA maze of narrow alleys and hidden nooks, the Back Streets are Traverse Town’s most secluded area. These paths are frequented by outcasts, secretive merchants, and those looking for anonymity.\nPoints of Interest:\nThe Winding Alley: A twisting path lined with unmarked doors, some leading to hidden rooms.\nSecret Marketplace: A shadowy corner where rare and illegal goods are quietly traded.\nOld Clock Tower: An abandoned clock tower that stands as a relic of a bygone era.\nOpen Areas:\nShaded Alleyways: Dimly lit paths that seem to stretch endlessly.\nCollapsed Bridge: A crumbled stone bridge, rumored to lead to a hidden underground passage.\nThe Silent Square: A small, eerie square where even the heartiest adventurers feel uneasy.\nChance of Mobs Appearing:\nHigh:\nHeartless: Shadows, Large Bodies, and Darkballs are common here.\nNobodies: Dusks and Creepers sometimes lurk in the shadows.\n\n5. Post Office\nThe Post Office is a unique part of Traverse Town, featuring mail delivery systems that use pulley mechanisms and miniature vehicles. It’s lively and often crowded with residents sending messages to other worlds.\nPoints of Interest:\nMain Sorting Station: The heart of the postal system, bustling with activity.\nMessage Board: A public bulletin board where requests and announcements are posted.\nCourier Service Booth: Operated by Moogles, it offers speedy deliveries to other realms.\nOpen Areas:\nCentral Atrium: A large hall filled with conveyor belts and chutes transporting letters and packages.\nUpper Platforms: Walkways that overlook the atrium, providing a strategic vantage point.\nDelivery Tunnel: A passage used by couriers to deliver urgent messages.\nChance of Mobs Appearing:\nLow:\nHeartless: Shadows and Soldiers occasionally disrupt operations.\n\n6. Town Hall\nThe administrative center of Traverse Town, the Town Hall is a grand yet unpretentious building where decisions about the town’s future are made.\nPoints of Interest:\nMain Chamber: A large, circular room where gatherings and meetings take place.\nArchives: A collection of scrolls and books chronicling the town’s history.\nObservation Balcony: A serene spot overlooking the First District.\nOpen Areas:\nTown Square: A central plaza filled with benches and fountains, perfect for quiet reflection.\nHallway of Lights: A beautifully lit corridor leading to various chambers.\nThe Bell Garden: A tranquil garden adorned with small bells that chime softly in the breeze.\nChance of Mobs Appearing:\nNone: The Town Hall is a secure location, protected by the town’s magic.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "worlds",
                "traverse town"
            ],
            "id": 9,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Traverse Town",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "10": {
            "uid": 10,
            "key": [
                "worlds",
                "Twilight Town"
            ],
            "keysecondary": [],
            "comment": "worlds",
            "content": "Twilight Town is a serene, picturesque world perpetually bathed in the warm orange hues of a setting sun. This peaceful place serves as a crossroads for many travelers, offering a mix of quiet residential areas, bustling markets, and mysterious locales. Despite its calm atmosphere, shadows of intrigue linger, with hidden passages and secrets waiting to be uncovered. The world is divided into distinct districts, each with its own unique charm and purpose.\n\n1. Market Street\nMarket Street is the bustling heart of Twilight Town, a lively area filled with vendors, colorful stalls, and lively chatter. It serves as the town’s commercial hub, where locals and travelers alike gather to trade, shop, and enjoy the vibrant atmosphere.\nPoints of Interest:\nItem Shop: Run by cheerful Moogles, this shop sells potions, ethers, and other essentials.\nWeapon Stall: A vendor specializing in gear for those who may find themselves battling Heartless or Nobodies.\nMarket Plaza: A wide, circular area where street performers and musicians entertain the crowd.\nCandy Corner: A small shop beloved by children, offering Twilight Town's famous sea-salt ice cream.\nOpen Areas:\nCentral Avenue: The main thoroughfare lined with stalls and shops.\nThe Side Alley: A quieter, shadier passage where rarer goods are sometimes found.\nObservation Bridge: A pedestrian overpass offering a view of the bustling market below.\nChance of Mobs Appearing:\nLow:\nHeartless: Shadows and Soldiers occasionally appear during quieter hours. But some appear in the sewers under the Market street.\n\n2. Central Station\nA grand train station that serves as a key travel point for locals and visitors. Its iconic architecture and large clock tower make it one of Twilight Town’s most recognizable landmarks.\nPoints of Interest:\nClock Tower Plaza: A spacious area in front of the station, perfect for gatherings or resting.\nTicket Office: Where travelers purchase tickets for the famous Twilight Train.\nClock Tower Viewpoint: A hidden path inside the station leads to the top of the clock tower, offering breathtaking views of the entire town.\nOpen Areas:\nTrain Platforms: A series of platforms where trains come and go, including the mysterious train to The Mysterious Tower.\nLuggage Storage Hall: A long hall filled with abandoned and forgotten luggage, perfect for exploration.\nStation Courtyard: A small garden area outside the station, dotted with benches and fountains.\nChance of Mobs Appearing:\nModerate to low:\nHeartless: Soldiers and Large Bodies patrol the platforms at night.\nNobodies: Dusks are known to appear near the clock tower at night.\n\n3. Tram Common\nTram Common is a residential district with a cozy, lived-in feel. The area is characterized by its cobblestone streets and the ever-present tram that winds its way through the district.\nPoints of Interest:\nTram Stop: The center of the district where the tram pauses, offering a quiet place to sit and watch the world go by.\nBakery: A charming shop known for its freshly baked bread and pastries.\nOld Theater: A small, rundown building where locals once gathered to watch films, now said to be haunted.\nOpen Areas:\nMain Square: A sunny open space where children often play and artists gather to sketch.\nThe Rusty Tracks: Abandoned tracks leading to an overgrown area on the outskirts.\nThe Twilight Bridge: A small bridge that glows softly under the perpetual twilight.\nChance of Mobs Appearing:\nModerate:\nHeartless: Shadows and Air Soldiers roam the quieter parts of the district.\n\n4. Sunset Terrace\nSunset Terrace is a quiet, elevated neighborhood overlooking the town. Known for its stunning views and serene ambiance, it is a favorite spot for stargazers and romantics.\nPoints of Interest:\nSunset Hill: A high vantage point offering the best view of the perpetual sunset.\nAbandoned Tunnel: A dark, unused train tunnel that many say leads to a hidden part of town.\nThe Clockmaker’s Shop: A small, eccentric shop where unique clocks and timepieces are sold.\nOpen Areas:\nThe Starlit Path: A winding trail lit by glowing lanterns.\nThe Meadow Ruins: An overgrown area with the remnants of an old building.\nThe Whispering Woods: A small wooded area said to carry echoes of the past.\nChance of Mobs Appearing:\nHigh:\nHeartless: Shadows, Neoshadows, and Darkballs are common in the darker areas.\nNobodies: Creepers and Dusks stalk the Abandoned Tunnel.\n\n5. The Neighborhood\nA quiet residential area where the town’s inhabitants live. It’s peaceful and welcoming, with homes surrounded by gardens and small parks.\nPoints of Interest:\nThe Community Hall: A gathering place for events and celebrations.\nThe Garden Park: A beautifully maintained park with flowers, benches, and fountains.\nThe Old Well: A mysterious, unused well at the edge of the neighborhood that locals avoid.\nOpen Areas:\nTree-Lined Streets: Quiet roads shaded by rows of trees.\nThe Stone Circle: A circular arrangement of stones in a grassy clearing, origins unknown.\nThe Creekside Path: A gentle trail that follows a small creek.\nChance of Mobs Appearing:\nLow:\nHeartless: Shadows occasionally appear near the Old Well at night.\n\n6. The Mysterious Tower\nThis enigmatic location is accessible only by train and exists outside the boundaries of Twilight Town proper. The Mysterious Tower is home to a powerful sorcerer and serves as a gateway to other worlds.\nPoints of Interest:\nThe Tower Entrance: A grand staircase leading to the base of the tower.\nThe Magical Garden: A surreal garden filled with glowing plants and floating platforms.\nThe Sorcerer’s Study: A mystical room at the top of the tower, filled with books, artifacts, and magical tools.\nOpen Areas:\nThe Floating Bridge: A magical bridge suspended in midair.\nThe Starfield Meadow: A strange field where the stars seem close enough to touch.\nThe Infinite Spiral: A seemingly endless staircase leading deeper into the tower.\nChance of Mobs Appearing:\nModerate:\nHeartless: Wizards, Large Bodies, and Invisibles guard the area.\nNobodies: Sorcerers and Dusks patrol the tower’s interior.\n\nDungeon: The Abandoned Mansion\nThe mansion is an eerie, dilapidated structure hidden deep within a forest near Twilight Town. Once a grand estate, it now serves as a mysterious and foreboding dungeon.\nLayout:\nOvergrown Garden: The entrance to the mansion is surrounded by overgrown hedges and broken fountains.\nMain Hall: A vast, dusty chamber with grand staircases and flickering chandeliers.\nThe Basement Lab: A secret room filled with strange machinery and data terminals, tied to the mysteries of the town.\nChance of Mobs Appearing:\nHigh:\nHeartless: Shadows, Neoshadows, and Large Bodies patrol the halls.\nNobodies: Dusks and Creepers guard the deeper areas.\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "worlds",
                "Twilight Town"
            ],
            "id": 10,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Twilight Town",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "11": {
            "uid": 11,
            "key": [
                "worlds",
                "Radiant Garden",
                "Hollow Bastion"
            ],
            "keysecondary": [],
            "comment": "worlds",
            "content": "Radiant Garden \nRadiant Garden, once a vibrant and flourishing world filled with light, fell into darkness causing much of the world's destruction, people gave it the name Hollow Bastion. During its dark era, it became a bastion of evil, its towering castle corrupted by Maleficent and her dark allies. After the forces of darkness were expelled, the world began to reclaim its former identity as Radiant Garden, though scars of its shadowy past linger. Today, Radiant Garden is a world in restoration, blending remnants of its darker days with the renewed hope of its people.\nThe world is a mix of imposing structures, peaceful gardens, and mechanical marvels. The castle remains the centerpiece, surrounded by areas that hold both beauty and danger.\n\n1. Marketplace District\nThe heart of the revived Radiant Garden, the Marketplace District serves as a hub for commerce, social gatherings, and resource management.\nPoints of Interest:\nMoogle Emporium: A shop offering high-quality items, synthesis materials, and rare treasures.\nRestoration Guild: A central hub for organizing the ongoing rebuilding efforts, where adventurers and artisans gather to discuss projects.\nFountain Square: A peaceful square dominated by a grand, glowing fountain that reflects the light of the reborn Radiant Garden.\nOpen Areas:\nStone-Cobbled Streets: Winding pathways filled with vendors and bustling activity.\nFlower-Lined Avenues: Lush streets lined with radiant blossoms, a symbol of the world’s rebirth.\nRebuilt Gateways: Recently repaired city gates that still bear the marks of past battles.\nChance of Mobs Appearing:\nLow:\nHeartless: Shadows and Soldiers appear during the quieter hours.\n\n2. Castle Town\nThis area sprawls at the base of the castle, where remnants of Hollow Bastion’s dark history mix with Radiant Garden’s brighter future.\nPoints of Interest:\nThe Central Plaza: A wide area filled with artisans, performers, and a small stage for public announcements.\nRepair Workshop: A bustling area where engineers and craftsmen restore both structures and mechanical devices.\nThe Grand Stairway: A long, winding staircase leading to the castle gates, now illuminated with lanterns.\nOpen Areas:\nThe Watchtower Path: A winding trail that once served as a lookout point during Hollow Bastion’s darker days.\nThe Courtyard Ruins: An area littered with broken statues and battle-scarred stones, preserved as a reminder of the past.\nThe Stream Crossing: A peaceful bridge over a restored waterway, reflecting the sky’s twilight hues.\nChance of Mobs Appearing:\nModerate:\nHeartless: Shadows, Armored Knights, and Hook Bats may appear.\nNobodies: Dusks occasionally patrol the edges of the district.\n\n3. The Great Maw\nA vast open field just beyond the castle walls, The Great Maw was the site of a legendary battle against the forces of darkness. It is now a hallowed ground, marked by both beauty and danger.\nPoints of Interest:\nThe Memorial Stone: A solemn monument honoring those who defended the world during its darkest times.\nEchoing Caves: Small, hidden caverns in the cliffsides, filled with mysterious echoes.\nThe Forgotten Crossing: A decayed bridge that once led to a neighboring world, now a crumbling relic.\nOpen Areas:\nRolling Meadows: Expansive fields of grass, dotted with flowers and small ponds.\nShattered Pillars: Tall, broken stone columns that remain from a bygone era.\nThe Crystal Stream: A serene brook that winds through the field, shimmering faintly.\nChance of Mobs Appearing:\nHigh:\nHeartless: Large Bodies, Defenders, and Neoshadows.\nNobodies: Creepers and Samurais.\n\n4. The Restoration Site\nAn active construction zone where the remains of Hollow Bastion are being transformed back into Radiant Garden’s original splendor. This area is bustling with activity as people rebuild the world’s infrastructure.\nPoints of Interest:\nThe Old Barracks: A partially restored fortress now used as a base for restoration workers.\nControl Terminal: A sophisticated console controlling various defensive mechanisms around the castle.\nThe Scaffold Platform: A high vantage point offering views of the entire Restoration Site.\nOpen Areas:\nThe Gear Tunnels: Underground passages filled with ancient machinery, some of which is being repurposed.\nThe Fragmented Walkway: A series of broken paths leading to inaccessible parts of the castle’s lower levels.\nThe Overlook Cliff: A cliffside area where workers gather to rest and take in the scenery.\nChance of Mobs Appearing:\nModerate:\nHeartless: Shadows, Soldiers, and Wight Knights are common.\nUnversed: Floods and Bruisers have been reported in deeper tunnels.\n\n5. The Castle of Radiant Garden\nFormerly known as the Castle of Hollow Bastion, this towering structure is still recovering from its time under Maleficent’s control. The castle remains an imposing centerpiece, blending its dark past with a hopeful future.\nPoints of Interest:\nThe Grand Hall: A vast, ornate room that once served as the seat of Maleficent’s power, now used for gatherings.\nLibrary of Radiance: A restored library filled with books, many of which were recovered from destruction.\nObservation Balcony: A platform at the top of the castle offering stunning views of the world.\nOpen Areas:\nThe Spiral Ramparts: Exterior walkways spiraling around the castle’s towers.\nThe Mechanical Workshop: A secret room where advanced technologies are being studied.\nThe Hidden Laboratory: A locked area filled with remnants of the experiments conducted during Hollow Bastion’s dark reign.\nChance of Mobs Appearing:\nHigh:\nHeartless: Wizards, Defenders, and Invisibles.\nNobodies: Berserkers and Sorcerers.\n\nDungeon: The Old Data Core (Underneath the Castle)\nThe deepest and most sinister part of the castle, the Old Data Core is an abandoned network of tunnels and chambers filled with forgotten technology and lingering shadows of the past.\nLayout:\nThe Core Entrance: A sealed door requiring an intricate mechanism to unlock.\nThe Data Nexus: A massive chamber filled with glowing terminals and dark energy.\nThe Vault: A hidden room containing records and artifacts of the castle’s dark history.\nChance of Mobs Appearing:\nVery High:\nHeartless: Neoshadows, Invisibles, and Darkballs swarm the lower levels.\nNobodies: Sorcerers and Assassins defend the core’s secrets.\n\n\nDungeon: Villain's Vale\nDescription: Perched high above Radiant Garden, Villain's Vale is a crumbling fortress that served as Maleficent's headquarters during Hollow Bastion's dark reign. Though the forces of light have reclaimed much of the world, Maleficent herself has returned to the Vale, seeking to reestablish her dominion. The fortress is steeped in her lingering dark magic, and its halls twist and shift under her influence, making it a perilous place for any who dare to intrude.\n\nDungeon Layout\nThe Forsaken Gate\nThe imposing entryway to the Vale, flanked by jagged cliffs. A heavy iron gate marked with Maleficent’s sigil blocks entry, sealed by a faint green barrier of magic.\nFeatures:\nThe gate can only be opened using fragments of Maleficent’s past power, scattered in nearby encounters.\nShadows and Soldiers emerge from the fog surrounding the gate.\n\nThe Spire of Secrets\nA winding stairway spiraling through the central tower of Villain’s Vale. The stairs are narrow, and the air grows heavier with dark magic as one ascends.\nFeatures:\nLanterns lit with eerie green fire guide the way.\nSmall alcoves along the stair occasionally reveal remnants of Maleficent’s reign, such as magical tomes or broken relics.\nEncounters:\nHeartless: Hook Bats and Wight Knights fly down to attack from above.\n\nThe Hall of Echoes\nA long, eerie corridor lined with shattered mirrors. The walls occasionally flicker with spectral images of past events: Maleficent’s alliances, her rise to power, and her battles against Sora and his companions.\nMechanism:\nA puzzle involving reflective light beams must be solved to proceed. Failure triggers Heartless ambushes.\nEncounters:\nHeartless: Defenders and Wizards appear in waves if the light puzzle is failed.\n\nThe Chamber of Shadows\nA grand throne room dominated by Maleficent’s towering seat of power. The chamber is dimly lit, with swirling shadows pooling in the corners. A faint glow emanates from the throne, which pulses with dark energy.\nFeatures:\nInteracting with the throne reveals a hidden passage to the Vault of Malevolence.\nThe throne is protected by a magical barrier that summons waves of Heartless when approached.\nEncounters:\nHeartless: Neoshadows and Darkballs emerge to protect the throne.\n\nThe Vault of Malevolence (Final Chamber)\nA vast, circular room with a high, domed ceiling. Maleficent’s presence dominates this space, her magic seeping into every corner. The air crackles with dark energy, and faint green flames flicker along the walls.\nBoss Encounter:\nMaleficent (Final Boss)\nMaleficent appears in her iconic form, wielding her staff to unleash devastating magic. Her combat style is a mix of powerful dark spells, summons, and mobility.\nPhases:\nDark Sorcery: Maleficent casts wide-area spells like Meteor Storm and Dragon’s Wrath, forcing players to dodge frequently.\nSummon Reinforcements: She summons Heartless (Shadows, Wizards, and Darkballs) to aid her periodically.\nDragon Form: In the final phase, Maleficent transforms into her dragon form, attacking with massive fire breath, tail sweeps, and area-denial flame pools.\nVictory Condition: Players must defeat her dragon form to fully neutralize her presence in Villain’s Vale.\n\nChance of Mobs Appearing\nThroughout Villain's Vale:\nHigh:\nHeartless: Shadows, Defenders, Wizards, and Invisibles frequently patrol the fortress.\nNobodies: Sorcerers and Assassins occasionally appear deeper inside, suggesting the lingering influence of other dark forces.\n\nLore and Connection\nVillain’s Vale is not just a dungeon but a reminder of Maleficent’s enduring power and influence. Despite her many defeats, her unyielding will to conquer darkness keeps her tethered to this world. Her return to Villain's Vale marks a dangerous resurgence, and her defeat within the Vault of Malevolence is critical to keeping Radiant Garden safe from her grasp.\nLet me know if you want any further adjustments or additions!\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "worlds",
                "Radiant Garden",
                "Hollow Bastion"
            ],
            "id": 11,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Radiant Garden",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "12": {
            "uid": 12,
            "key": [
                "Organization 13",
                "organization xiii",
                "world that never was",
                "worlds"
            ],
            "keysecondary": [],
            "comment": "Organization 13",
            "content": "The World That Never Was is a mysterious, twilight realm shrouded in perpetual night, illuminated by an ominous glowing moon. It was created as a stronghold for Nobodies and served as the headquarters of Organization XIII. This world is an eerie combination of futuristic architecture and surreal emptiness, defined by its sprawling cityscape, twisting paths, and the imposing Castle That Never Was, which looms over the landscape as a beacon of the Organization’s ambitions.\nThis world serves as a central battleground between light and darkness, where the forces of Sora and his allies clashed with the Organization in their bid to control Kingdom Hearts. Though the Organization has been defeated, the world remains as enigmatic and dangerous as ever, crawling with Heartless and Nobodies drawn to its powerful aura.\n\nAreas\nThe Dark City\nDescription:\nA sprawling urban area filled with towering, jagged skyscrapers and glowing neon lights. The streets are eerily silent, save for the distant echoes of wind and the occasional flicker of electrical surges. The city feels alive in its emptiness, as though it is watching intruders.\nPoints of Interest:\nMemory Skyscraper:\nA towering structure that reflects faint glimpses of past events. It serves as a hub of dark energy in the city.\nThe Endless Crossroads:\nA labyrinth of streets that seem to stretch infinitely. Certain paths loop back on themselves unless navigated with care.\nThe Dissonant Plaza:\nA central square filled with distorted remnants of Nobody symbols. A faint hum of energy pervades the area.\nChance of Mobs Appearing:\nHigh:\nHeartless: Shadows, Neoshadows, and Creepers appear frequently.\nNobodies: Dusks and Snipers are common encounters.\n\nTwilight Skyway\nDescription:\nA series of elevated pathways that bridge parts of the city to the Castle That Never Was. These paths are unstable, with sections collapsing or flickering in and out of existence. The sky above pulses with the energy of the massive moon, which looms ominously over the horizon.\nPoints of Interest:\nThe Flickering Bridge:\nA dangerous, partially formed path that requires careful navigation to cross.\nThe Silent Courtyard:\nA small, open area surrounded by towering walls, where the whispers of past battles seem to echo.\nThe Starlight Overlook:\nA scenic yet haunting viewpoint of the glowing moon and the dark city below.\nChance of Mobs Appearing:\nModerate:\nHeartless: Creepers and Darkballs are common.\nNobodies: Berserkers occasionally ambush travelers.\n\nThe Forgotten Path\nDescription:\nA narrow, twisting trail that leads to the base of the Castle That Never Was. The path is lined with glowing Nobody insignias, which seem to watch travelers. The air grows heavier with darkness the closer one gets to the castle.\nPoints of Interest:\nThe Fractured Archway:\nA grand arch that has been partially destroyed. Dark energy swirls faintly around its ruins.\nThe Abyssal Stair:\nA spiraling staircase leading to the castle gates, with each step glowing faintly.\nThe Vanishing Spire:\nA mysterious structure that seems to disappear when approached, only to reappear elsewhere.\nChance of Mobs Appearing:\nHigh:\nHeartless: Neoshadows, Invisibles, and Darkballs.\nNobodies: Sorcerers and Dragoons appear frequently.\n\nDungeon: The Castle That Never Was\nDescription:\nThe Castle That Never Was is a surreal, labyrinthine fortress that serves as the heart of the world. Its architecture defies logic, with floating staircases, distorted gravity, and rooms that shift and change. The castle was the central command for Organization XIII, with each member leaving their mark on its various chambers.\n\nDungeon Layout\nHall of Empty Melodies\nThe entrance hall is vast and filled with glowing Nobody insignias. The air hums with an unsettling melody that grows louder as one moves deeper.\nCrooked Spiral Stair\nA spiraling staircase that shifts and bends as it rises, leading to higher levels of the castle.\nRoom of Stasis\nA chamber filled with floating platforms, each glowing faintly. Time feels slowed here, and movement becomes sluggish.\nThe Memory Vault\nA central chamber where holographic images of past battles and memories are projected onto the walls.\nThe Throne Room (Final Chamber)\nA massive chamber lined with high-backed thrones for each member of the Organization, centered around a massive window overlooking the glowing moon.\n\nBoss Encounter: Xemnas (Shadow Fragment)\nThough defeated, a lingering shadow of Xemnas remains, fueled by the castle’s dark energy. This shadowy entity attacks with dual ethereal blades and commands Nobodies to assist him in battle.\nPhases:\nDual Blade Barrage: Quick, sweeping attacks with ethereal weapons.\nSummon Nobodies: Calls Sorcerers and Creepers to his aid.\nMoonlit Despair: A devastating area-of-effect attack that must be interrupted.\n\nChance of Mobs Appearing in the Castle\nVery High:\nHeartless: Shadows and Invisibles lurk in the castle’s lower levels.\nNobodies: Dusks, Sorcerers, and Snipers patrol various chambers.\n\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "Organization 13",
                "organization xiii",
                "world that never was",
                "worlds"
            ],
            "id": 12,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The World that Never Was",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "13": {
            "uid": 13,
            "key": [
                "Agrabah",
                "worlds"
            ],
            "keysecondary": [],
            "comment": "Agrabah",
            "content": "Agrabah is a sprawling desert kingdom shimmering under the blazing sun, steeped in mystery and surrounded by endless dunes. The heart of the world is its grand city, bustling with life and filled with vibrant markets, intricate architecture, and secrets hidden within its winding streets. Beyond the city walls lie smaller settlements clinging to oasis life, while the vast desert holds its own dangers.\n\nThis land is rich with ancient lore, including tales of the mythical Cave of Wonders, a labyrinth filled with treasures and peril. Heartless wander the sands, their forms and behaviors echoing the tales and legends of this arid realm.\n\nMain City: Agrabah\nA grand city of sandstone buildings with domed roofs, narrow alleys, and colorful awnings. Life thrives in the bustling streets where merchants, entertainers, and travelers mingle. Despite its beauty, parts of the city are shadowed by tension, with whispers of dangers lurking in the outskirts.\n\nCity Districts\n1. Royal Quarter\n\nThe center of authority in Agrabah, home to the royal palace and administrative buildings.\nPoints of Interest:\nThe Golden Palace: A magnificent structure with sprawling gardens and towering spires. The heart of Agrabah’s governance and culture.\nThe Fountain of Eternity: A large, ornate fountain said to be enchanted, found in the main plaza.\nThe Archive of Sands: A library housing the history of Agrabah and the surrounding desert.\nChance of Mobs Appearing: Low. Heartless are rare here due to the vigilance of city guards.\n2. Merchant’s Row\n\nA lively district packed with markets, stalls, and traders selling exotic goods. The air is filled with the scent of spices and the chatter of hagglers.\nPoints of Interest:\nThe Grand Bazaar: The largest market in Agrabah, offering everything from fine silks to magical trinkets.\nThe Dancer’s Haven: A bustling tavern where performers gather, known for its dazzling evening shows.\nAladdin’s Oddities: A quaint shop rumored to sell items of mysterious origin.\nChance of Mobs Appearing: Moderate. Shadows and Bandits occasionally sneak into the bustling crowds.\n3. Artisan’s Enclave\n\nA quieter district filled with workshops, where blacksmiths, weavers, and craftsmen ply their trades.\nPoints of Interest:\nThe Forge of Flames: A renowned blacksmith’s shop producing exquisite weapons and armor.\nThe Silk Garden: A workshop famous for its fine fabrics and vibrant dyes.\nThe Secret Tunnel: A hidden passage beneath a weaver’s shop, rumored to lead out of the city.\nChance of Mobs Appearing: Low to Moderate. Heartless like Pot Spiders and Bandits may lurk in the shadows.\nSettlements Outside the City\n1. Oasis of Taraq\n\nA lush haven surrounding a freshwater spring. This town thrives on agriculture and trade with travelers.\nPoints of Interest:\nThe Crystal Spring: The centerpiece of the oasis, known for its sparkling, clear waters.\nThe Wayfarer’s Lodge: A popular inn for adventurers passing through.\nThe Caravaner’s Market: A small but bustling trade center catering to desert travelers.\nChance of Mobs Appearing: Moderate. Bandits and Fat Bandits often target this settlement at night.\n2. Duneside Village\n\nA modest settlement nestled at the edge of the desert. Its inhabitants are primarily miners and nomads.\nPoints of Interest:\nThe Sandstone Quarry: A mining site producing valuable materials for Agrabah’s artisans.\nThe Dune Tavern: A cozy establishment where locals share tales of desert legends.\nThe Shrine of Winds: A small altar believed to protect travelers from the desert’s dangers.\nChance of Mobs Appearing: High. Large bodies of Heartless, such as Bandits and Air Soldiers, frequently attack the outskirts.\nThe Desert\nDescription:\nAn expansive and unforgiving landscape of endless dunes, treacherous winds, and scorching heat. The desert is both a barrier and a mystery, holding ancient ruins and secrets beneath its sands.\n\nPoints of Interest:\n\nThe Whispering Dunes:\nA section of the desert where the wind creates eerie sounds, unsettling travelers.\nThe Fallen Obelisk:\nA massive, broken monument partially buried in the sand.\nThe Mirage Caverns:\nHidden caves that can only be found by following fleeting mirages.\nChance of Mobs Appearing:\n\nVery High. Shadows, Large Bodies, Fat Bandits, and Air Soldiers are common. Rare encounters with Heartless like Dustflier are possible.\nDungeon: The Cave of Wonders\nDescription:\nThe Cave of Wonders is a legendary treasure trove hidden deep in the desert, accessible only to those deemed worthy. Its entrance is a massive lion’s head carved into the rock, which comes to life to guard the cave. Inside, the cave is a labyrinth of golden halls, crumbling platforms, and traps designed to deter intruders.\n\nDungeon Layout\n1. The Entrance Hall\n\nA grand chamber filled with golden statues and a sense of foreboding.\n2. The Treasure Vault\n\nA vast room piled high with gold and gems. Taking the wrong treasure triggers deadly traps.\n3. The Path of Trials\n\nA series of precarious bridges over a glowing pit of molten lava. Falling is not an option.\n4. The Chamber of Secrets\n\nA hidden room housing ancient artifacts, including magical relics guarded by illusions.\n5. The Heart of the Cave (Final Chamber)\n\nA massive underground chamber lit by a glowing pool of liquid gold.\nBoss Encounter: Genie Jafar\nThe final challenge of the Cave of Wonders is an encounter with Genie Jafar, who uses his immense power to manipulate the environment, summon firestorms, and conjure swarms of Heartless.\n\nPhase 1: Genie Jafar attacks with fiery projectiles and summons Bandits and Large Bodies.\nPhase 2: He manipulates the lava beneath the players, forcing them to dodge rising flames.\nPhase 3: The battle ends with an intense aerial fight as Jafar summons Air Soldiers and attempts to collapse the chamber.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Agrabah",
                "",
                "worlds"
            ],
            "id": 13,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Agrabah",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "14": {
            "uid": 14,
            "key": [
                "hades",
                "hercules",
                "worlds",
                "olympus colliseum"
            ],
            "keysecondary": [],
            "comment": "hades",
            "content": "Olympus Coliseum is a world of gods, heroes, and myths, divided into three distinct realms: the bustling City of Athens, the divine heights of Mount Olympus, and the shadowy depths of the Underworld. Each area holds its own challenges, mysteries, and unique connection to Greek mythology. The world serves as a proving ground for warriors and adventurers, with the Coliseum at its heart standing as a beacon for competition and valor.\nThe forces of darkness have begun to infiltrate these lands, with Heartless and other threats challenging the peace. The influence of Hades, the Lord of the Dead, looms large over the Underworld, while the gods watch from above.\n\nArea 1: City of Athens\nDescription:\nA sprawling, vibrant city filled with the energy of merchants, citizens, and aspiring warriors. The City of Athens lies in the shadow of the Coliseum, where tournaments and games draw crowds from far and wide. Its marble streets, towering statues, and grand temples reflect its rich culture and devotion to the gods.\nCity Districts\n1. Coliseum Grounds\nThe heart of the city, where warriors gather to test their strength in the legendary Coliseum.\nPoints of Interest:\nThe Coliseum: A grand arena where competitions, training, and boss battles occur.\nThe Hall of Heroes: A museum dedicated to legendary champions, featuring statues and relics.\nThe Training Yard: A practice area where adventurers can test their skills against dummies and summoned Heartless.\nChance of Mobs Appearing: Low to Moderate. Training Heartless, such as Soldiers and Large Bodies, appear occasionally.\n2. Agora Market\nA bustling trade center where merchants sell wares, performers entertain, and townsfolk gather.\nPoints of Interest:\nHero’s Forge: A blacksmith’s shop crafting weapons inspired by myths.\nPomegranate Tavern: A lively inn serving local delicacies and offering stories of the gods.\nThe Golden Shrine: A small altar where travelers can make offerings for luck and blessings.\nChance of Mobs Appearing: Low. Shadows and Soldiers sometimes emerge at night.\n3. Temple District\nA serene area devoted to worship and learning, with grand temples dedicated to the gods of Olympus.\nPoints of Interest:\nTemple of Zeus: The largest temple, dedicated to the king of the gods.\nLibrary of Athena: A repository of knowledge where scrolls and ancient texts can be found.\nStatue of Hercules: A tribute to the city’s greatest hero, standing proudly in the district’s square.\nChance of Mobs Appearing: Low. Rare ambushes by Shadows or Invisibles.\n\nArea 2: Mount Olympus\nDescription:\nA majestic mountain rising above the clouds, home to the gods. Mount Olympus is a place of divine beauty and power, where golden halls and flowing rivers shine with celestial light. Its paths are challenging to climb, with trials of strength and courage awaiting those who dare approach.\nPoints of Interest\n1. The Celestial Staircase\nA long, glowing path lined with golden pillars, leading to the summit.\n2. Gardens of the Muses\nA lush, tranquil garden filled with fountains and flowers that sing softly in the breeze.\n3. The Throne of the Gods\nA grand chamber where Zeus and the other Olympians hold court, with towering thrones carved from marble and gold.\nChance of Mobs Appearing: Moderate. Rare Heartless like Air Soldiers and Invisibles patrol the lower paths, while Nobodies, such as Berserkers, guard the higher reaches.\n\nArea 3: The Underworld\nDescription:\nThe dark and foreboding realm of the dead, ruled by Hades. The Underworld is a labyrinth of caverns and rivers shrouded in shadows, with an oppressive atmosphere. Souls of the departed drift aimlessly, while Heartless thrive in the darkness.\nPoints of Interest\n1. River Styx\nA murky, winding river that separates the living from the dead. Boats piloted by skeletal oarsmen ferry travelers across.\n2. Cavern of Lost Souls\nA sprawling cave filled with the whispers of the departed and glowing, ghostly lights.\n3. Hades’ Throne Room\nA dark, towering chamber where Hades presides. Flames flicker along the walls, and his voice echoes ominously.\nChance of Mobs Appearing: Very High. Shadows, Large Bodies, and Darkballs appear frequently. Cerberus-like Heartless are also common, and special encounters with Undead Nobodies occur.\n\nDungeon: The Cave of Wonders\nDescription:\nThe dungeon is Hades’ secret lair deep within the Underworld, a fiery labyrinth filled with traps, lava pits, and ancient curses. The walls are lined with glowing runes that seem to mock intruders.\nDungeon Layout\n1. Entrance of Despair\nA narrow, rocky path with flames flickering along the walls.\n2. The Pit of Torment\nA vast chamber with rivers of lava and moving platforms.\n3. The Flame Trial\nA puzzle area where players must extinguish cursed flames to proceed.\n4. The Chamber of Darkness (Final Chamber)\nA vast arena where Hades awaits, surrounded by swirling dark energy and molten lava.\n\nBoss Encounter: Hades\nPhase 1: Hades attacks with fireballs and summons Shadows and Soldiers.\nPhase 2: He manipulates the environment, creating lava pits and fiery walls.\nPhase 3: Hades transforms into his fiery rage form, unleashing devastating area attacks and summoning powerful Heartless.\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "hades",
                "hercules",
                "worlds",
                "olympus colliseum"
            ],
            "id": 14,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Olympus Coliseum ",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "15": {
            "uid": 15,
            "key": [
                "jack sparrow",
                "pirates of the Caribbean",
                "pirates",
                "world"
            ],
            "keysecondary": [],
            "comment": "jack sparrow",
            "content": "The Caribbean is a sprawling world of vast oceans and scattered islands, rich in both peril and treasure. Port Royal serves as the central hub, while the surrounding waters lead to uncharted islands, each with unique features and dangers. The world is divided into three key regions: Northern Waters, Southern Waters, and Port Royal Waters. Pirates, Heartless, and remnants of ancient curses linger throughout, making it a land of endless adventure.\nThe Leviathan, a swift and powerful ship, is essential for navigating the High Seas, uncovering secrets, and engaging in naval combat. Beneath the waves, underwater caverns and shipwrecks conceal treasure, Heartless, and the remains of forgotten battles.\n\nMain Area: Port Royal\nDescription:\nPort Royal is a bustling port town and the heart of maritime activity in the Caribbean. It’s a thriving center for trade, seafaring, and piracy, where the line between law and chaos blurs. From the docks to the fort, every corner hums with life and intrigue.\nKey Locations\n1. The Docks\nThe starting point for many adventures, where the Leviathan is docked. Sailors, merchants, and pirates fill the area, loading and unloading cargo.\nPoints of Interest:\nThe Shipwright's Workshop: A place to upgrade the Leviathan or repair damaged vessels.\nThe Harbormaster: Offers maps, quests, and rumors about treasures and dangers at sea.\nTavern of Tides: A lively tavern frequented by sailors sharing tales of ghost ships and hidden islands.\nChance of Mobs Appearing: Low. Occasionally, Pirate Heartless appear during the night.\n2. Settlement\nThe residential area of Port Royal, with small houses, cobblestone streets, and a market square.\nPoints of Interest:\nThe Market Square: Vendors sell goods like ship supplies, potions, and exotic items.\nThe Governor’s Mansion: A grand building overseeing the town, rumored to contain secret passages.\nThe Chapel of the Sea: A small church where sailors pray for safe voyages.\nChance of Mobs Appearing: Moderate. Shadows, Air Pirates, and occasional Cannon Guns lurk in alleyways.\n3. The Fort\nA heavily fortified structure overlooking the port, designed to protect the town from invaders.\nPoints of Interest:\nThe Barracks: Housing for soldiers and a potential source of side quests.\nThe Prison Cells: Cages that sometimes hold NPCs or treasure chests.\nThe Cannon Deck: A high vantage point with cannons ready to defend against ships or flying Heartless.\nChance of Mobs Appearing: High. Soldiers are often ambushed by Pirate Heartless and Air Pirates.\n\nArea: The Southern Waters\nDescription:\nA warm, tropical expanse of the ocean dotted with islands that range from idyllic to treacherous.\nKey Islands\n1. Sandbar Isle\nA ring-shaped island with shallow waters and an underwater cave system.\nPoints of Interest:\nThe Coral Cavern: A hidden cave filled with glowing coral and rare treasure chests.\nThe Lookout Point: A small hill offering a stunning view of the ocean.\nThe Abandoned Camp: A makeshift shelter left behind by stranded sailors.\nChance of Mobs Appearing: Moderate. Shadows, Powerwilds, and Sea Neon Heartless appear near the water.\n2. Ship’s End\nA haunting island surrounded by shipwrecks. Its underwater section holds the remnants of naval battles.\nPoints of Interest:\nThe Wreck of the Siren: A massive shipwreck filled with Heartless and treasure.\nThe Crow’s Nest Cliffs: High rocks that provide a view of the graveyard below.\nThe Altar of the Sea King: A mysterious shrine carved into the cliffs.\nChance of Mobs Appearing: High. Aqua Tanks, Sea Neons, and Pirate Heartless swarm the wreckage.\n3. Exile Island\nA small, lonely island with a single palm tree and a sandy shore.\nPoints of Interest:\nThe Survivor’s Cache: A buried treasure marked with a crude map.\nThe Hermit’s Cave: A hidden alcove where a stranded sailor may reside.\nThe Whispering Shore: A mysterious area said to echo with ghostly voices.\nChance of Mobs Appearing: Low. Rare encounters with Shadows and Sea Neons.\n\nArea: The Northern Waters\nDescription:\nThe cooler, mysterious region of the High Seas, with verdant islands and jagged rock formations.\nKey Islands\n1. Isla Verdemontaña\nA lush island with dense vegetation and winding paths.\nPoints of Interest:\nThe Jungle Hollow: A dense jungle teeming with life and danger.\nThe Emerald Falls: A stunning waterfall hiding a secret cave.\nThe Peak’s Perch: A high vantage point with a treasure chest guarded by Heartless.\nChance of Mobs Appearing: High. Powerwilds and Air Pirates patrol the jungle paths.\n2. Isla de los Mástiles\nA rocky island with thorny cliffs and hidden caves.\nPoints of Interest:\nThe Thorn Cave: A small cavern guarded by Heartless.\nThe Beacon Cliff: A location where signal fires were once lit.\nThe Pirate’s Cache: A hidden stash of loot buried by pirates.\nChance of Mobs Appearing: Moderate. Pirate Heartless, Air Pirates, and occasional Invisibles.\n3. Forsaken Isle\nA desolate, rocky island used as a resting point.\nPoints of Interest:\nThe Survivor’s Campfire: A lone campfire still smoldering.\nThe Old Dock: The remains of a small pier.\nThe Shadowed Cove: A dark alcove where Heartless occasionally spawn.\nChance of Mobs Appearing: Low. Shadows and occasional Sea Neons.\n\nDungeon: Cave of Wonders (Located in the Huddled Isles)\nDescription:\nThe Cave of Wonders is a labyrinthine underwater dungeon filled with treasures, traps, and Heartless. Its intricate design leads adventurers through coral mazes and glowing caverns, culminating in a grand chamber guarded by the Lightning Angler.\nDungeon Layout\nUndersea Cavern: A maze-like underwater area with glowing coral.\nThe Maze of Tides: A series of paths with shifting currents and hidden treasure chests.\nThe Chamber of Wonders: The final room where the Lightning Angler Heartless awaits.\nBoss Encounter: Lightning Angler\nA massive, eel-like Heartless with glowing tendrils that emit electrical attacks. It uses the surrounding water to amplify its power, summoning smaller Heartless to assist in battle.\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "jack sparrow",
                "pirates of the Caribbean",
                "pirates",
                "world"
            ],
            "id": 15,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Caribbean ",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "16": {
            "uid": 16,
            "key": [
                "Land of Dragons",
                "mulan",
                "world"
            ],
            "keysecondary": [],
            "comment": "Land of Dragons",
            "content": "The Land of Dragons is a realm of majestic mountains, verdant valleys, and ancient traditions. Inspired by a fictionalized version of imperial China, it is a place of honor, duty, and beauty. The heart of this world is the Imperial City, surrounded by diverse landscapes and fortified outposts. Despite its serene appearance, the land faces the ever-present threat of Heartless, particularly those drawn to the region's deep history and spiritual power.\n\nMain Area: The Imperial City\nDescription:\nThe Imperial City serves as the central hub of the world, a bustling metropolis with ornate architecture and a culture steeped in tradition. The city is surrounded by high walls and offers a mix of military and civilian life.\n\nKey Locations\n1. Palace Grounds\n\nThe most prominent area of the Imperial City, housing the Emperor’s palace. Guards patrol the grounds, and citizens gather in awe of the imperial structure.\nPoints of Interest:\nThe Throne Room: A grand hall where the Emperor holds court.\nThe Garden of Serenity: A tranquil garden filled with cherry blossoms and koi ponds.\nThe War Council Hall: A meeting place for generals and advisors, offering strategic missions.\nChance of Mobs Appearing: Low. The area is heavily guarded, but Shadows and Soldiers occasionally breach the gates.\n2. Merchant’s Quarter\n\nA lively marketplace where traders sell goods such as silk, weapons, and medicinal herbs.\nPoints of Interest:\nThe Silk Pavilion: A shop offering decorative clothing and rare fabrics.\nThe Armory: A blacksmith’s shop where new equipment and upgrades can be purchased.\nThe Tea House: A bustling establishment where locals share gossip and rumors.\nChance of Mobs Appearing: Moderate. Occasionally, Rapid Thrusters and Hook Bats disrupt the peace.\n3. Residential District\n\nA quieter section of the city where families live in modest homes. Lanterns line the streets, creating a peaceful ambiance at night.\nPoints of Interest:\nThe Storyteller’s Hut: A home where tales of ancient heroes and battles are told.\nThe Training Yard: A space for soldiers and young recruits to practice.\nThe Shrine of Ancestors: A sacred site where offerings are made to honor the departed.\nChance of Mobs Appearing: Low. Shadows and Creeper Plant Heartless sometimes appear near the shrine.\nArea: The Bamboo Grove\nDescription:\nA dense forest of towering bamboo stalks, serving as a buffer between the Imperial City and the wilderness.\n\nKey Features\nThe Hidden Spring: A small, secluded hot spring surrounded by bamboo, known for its restorative properties.\nThe Overgrown Path: A narrow trail through the grove, with occasional hidden treasures.\nThe Tiger’s Lair: A rocky outcrop rumored to be home to wild beasts.\nChance of Mobs Appearing: High. Nightwalkers, Assault Riders, and occasional Air Pirates ambush travelers.\n\nArea: The Mountain Pass\nDescription:\nA treacherous route through the snowy mountains, leading to the Imperial Outpost. It is prone to avalanches and harsh weather.\n\nKey Features\nThe Cliffside Trail: A narrow, icy path with stunning views but dangerous footing.\nThe Frozen Ravine: A deep chasm where treasure and danger await.\nThe Signal Tower: A high vantage point used to send warnings to the city.\nChance of Mobs Appearing: High. Bolt Towers, Aeroplanes, and Soldiers are common, alongside Frost Serpents in colder areas.\n\nArea: The Imperial Outpost\nDescription:\nA remote military base tasked with defending the empire’s borders. The outpost is rugged, functional, and always on alert.\n\nKey Locations\nThe Command Tent: The nerve center of the outpost, where missions are assigned.\nThe Armory: A storage area for weapons and supplies.\nThe Watchtower: A tall structure offering a clear view of the surrounding area.\nChance of Mobs Appearing: Moderate. Rapid Thrusters, Soldiers, and Cannon Guns frequently attack the outpost.\n\nDungeon: The Cave of the Stone Dragon\nDescription:\nHidden deep in the wilderness, this cave is said to house the spirit of an ancient dragon. It is filled with traps, treasures, and an overwhelming presence of Heartless.\n\nDungeon Layout\nThe Outer Cavern: The entrance, filled with creeping vines and faint carvings of dragons.\nThe Trial Hall: A series of rooms with puzzles and traps designed to test the worthy.\nThe Dragon’s Chamber: A grand room where a massive dragon statue watches over a treasure hoard.\nBoss Encounter: Storm Rider Heartless\n\nA massive, wyvern-like Heartless with lightning-based attacks. It flies around the chamber, summoning smaller Heartless and launching devastating storms.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "Land of Dragons",
                "mulan",
                "world"
            ],
            "id": 16,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Land of Dragons",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "17": {
            "uid": 17,
            "key": [
                "Atlantis",
                "Lost Kingdom of Atlantis",
                "world"
            ],
            "keysecondary": [],
            "comment": "Atlantis",
            "content": "Atlantis, a legendary city buried deep within the Earth, is nestled inside a massive volcanic cavern. This enormous subterranean realm is illuminated by bioluminescent flora, cascading waterfalls, and the molten glow of magma rivers. The city itself is constructed in concentric rings, with ruins interspersed with vibrant, living neighborhoods. Despite its age, Atlantis thrives, powered by the mystical Heart of Atlantis, a source of endless energy and life. Ancient Atlantean culture blends seamlessly with its natural surroundings, showcasing advanced technology preserved through millennia.\nLore:\nMillennia ago, Atlantis was a sprawling empire larger than any known civilization. Its downfall came during a catastrophic event—the Great Flood—which submerged the island and cast it into the Earth's crust. Protected by the Heart of Atlantis, the city avoided total destruction but was lost to time. The Atlanteans who remain are descendants of the survivors, living in harmony with their sacred home. After her father's death Queen Kidagakash, a wise and powerful leader, oversees Atlantis, seeking to restore her kingdom.\n\nKey Locations\n1. Main City: Rings of Atlantis\nThe main hub of Atlantis is a series of concentric stone rings connected by ancient bridges. Each ring serves a unique purpose, showcasing Atlantean architecture and culture.\nOuter Ring:\nA crumbling but lively district with marketplaces and residential areas. Vendors sell exotic Atlantean crafts, glowing crystals, and unique underwater relics.\nPoints of Interest:\nCrystal Plaza: A bustling market square surrounded by towering stone pillars inscribed with Atlantean glyphs.\nFountain of Memory: A mystical fountain said to show glimpses of Atlantis before the flood.\nGolem Workshop: A hidden forge where Atlantean sentries are maintained.\nChance of Mobs Appearing:\nHeartless resembling deep-sea creatures, such as Abyss Raiders and Lurking Shadows, occasionally roam the shadows.\nMiddle Ring:\nA more serene area featuring gardens and temples. This area highlights the spiritual connection Atlanteans have with the Heart of Atlantis.\nPoints of Interest:\nTemple of the Crystal: A shrine dedicated to the Heart, where Atlanteans meditate and connect with their ancestors.\nHanging Gardens: Lush greenery draped over the volcanic walls, glowing with bioluminescent mosses.\nAtlantean Archives: A library containing records of Atlantis' history and lost technology.\nChance of Mobs Appearing:\nVery rare. Most hostile encounters occur in the outer areas of the city.\nInner Ring:\nThe palace district, where Queen Kidagakash resides. This area is heavily guarded and houses the Heart of Atlantis.\nPoints of Interest:\nRoyal Spire: The towering palace of Queen Kidagakash, built around the Heart of Atlantis.\nCouncil Chamber: A meeting place for Atlantean leaders and advisors.\nSanctuary of the Heart: The location of the Heart itself, radiating a soft, protective light.\nChance of Mobs Appearing:\nNo hostile mobs due to the protective power of the Heart.\n\n2. Cave Systems\nThe labyrinthine caves surrounding Atlantis act as both a natural defense and a source of adventure.\nPoints of Interest:\nCrystal Caverns: Glowing tunnels filled with massive crystal formations and hidden treasures.\nMagma Veins: Dangerous passages lined with flowing lava, requiring careful navigation.\nEchoing Depths: A mysterious cave that amplifies sound and distorts vision.\nChance of Mobs Appearing:\nFrequent encounters with Rock Trolls, Drill Crushers, and Crystal Shades. The deeper you go, the stronger the enemies.\n\n3. Underwater City (Combat Zone)\nSubmerged ruins lie beneath the main city, accessible through hidden passageways. These ruins are remnants of Atlantis' pre-flood glory, now teeming with hostile creatures.\nPoints of Interest:\nSunken Temple: A partially submerged temple filled with puzzles and treasure.\nAqueduct Network: A maze-like system of tunnels that once provided water to Atlantis.\nLost Arena: An underwater combat zone where the Atlanteans once tested their warriors.\nChance of Mobs Appearing:\nHigh. Expect Hydro Serpents, Aqua Shades, and Leviathan Heartless.\n\n4. Volcanic Outskirts\nThe volcanic walls sheltering Atlantis are both a barrier and a resource. This rugged terrain features geysers, lava pools, and steep cliffs.\nPoints of Interest:\nLava Falls: Towering cascades of molten rock that illuminate the outskirts.\nEcho Spires: Jagged volcanic formations that amplify sound, making them ideal for ambushes.\nMineral Deposits: Rich veins of rare crystals, fiercely protected by the creatures that dwell here.\nChance of Mobs Appearing:\nFrequent. Expect Fire Imps, Magma Trolls, and Crystal Crawlers.\n\n5. Dungeon: The Heart’s Core\nThe Heart’s Core lies beneath the palace, accessible only through a secret passage guarded by Atlantean sentries. This is the final stronghold for anyone attempting to claim the Heart of Atlantis.\nLayout:\nA multi-level dungeon with traps, ancient puzzles, and hostile Atlantean guardians. The walls radiate with volcanic heat and crystal light, creating a surreal atmosphere.\nBoss Encounter:\nPhase 1: Atlantean Sentinels – Mechanized guardians powered by crystals.\nPhase 2: Corrupted Titan – A massive construct controlled by a Heartless that attempts to drain the Heart’s power.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "Atlantis",
                "Lost Kingdom of Atlantis",
                "world"
            ],
            "id": 17,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Lost Kingdom of Atlantis",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "18": {
            "uid": 18,
            "key": [
                "Digital Realm",
                "wreck it ralph",
                "space paranoids",
                "worlds",
                "game central station"
            ],
            "keysecondary": [],
            "comment": "Digital Realm",
            "content": "The Digital Realm, a vast digital landscape born from the fusion of ENCOM's systems, video games, and the twisted remnants of corrupted code, has become a central hub for programs, rogue AIs, and data echoes. Once accessible only through high-tech devices, it has now found a way to infiltrate various worlds, appearing through portals activated by technological devices, like the ones found in Twilight Town, Hollow Bastion, Traverse Town, and even The World That Never Was.\nThis world is a living system that merges ancient programming (like the Space Paranoids) with newer, evolved technology. The unexpected collision of these data streams has created a sprawling metropolis of neon lights, massive data towers, and an open, shifting grid.\nIncorporating lore from Data Replica Twilight Town, the digital world of The Grid now serves as a pocket dimension where the boundaries of memory, identity, and code blur. Within it, a digital copy of Twilight Town exists, mimicking the town’s real-world counterpart, but made entirely of shifting pixels and data streams.\n\nTo access The Digital realm , a person or device must interact with a data portal, activated via technological means. These portals have begun to manifest in several worlds due to the fractured nature of the digital realm.\n\n-Twilight Town: The data portals are connected to the Replica Twilight Town—an entire world built to simulate memories, but instead of memories of a single person, it now holds the data cores of various people, making the town a fragmented reality.\n-Hollow Bastion (Radiant Garden): The forgotten remnants of the ancient data infrastructure hidden deep within Radiant Garden are unstable, but hidden gateways lead into The Grid. The pathways to these areas were once safeguarded by programs like Tron but have since become increasingly unstable.\n-The World That Never Was: This world contains a broken connection to the digital domain, remnants of the Organization's previous experiments with digital reality. In the darkness of the castle, portals exist that lead directly into the system.\n-Traverse Town: The digital portals occasionally appear within the alleys and backstreets, usually connected to some form of corrupted data or malfunctioning machinery hidden in the town.\nOnce activated, the portals pull in the traveler, transporting them to The Grid, where they are surrounded by the hum of electric energy and the vibrancy of data constructs.\n\nRegion 1: Central Processing Hub\n\nThis region serves as the \"capital\" of the digital world, a city of towering spires and vast data streams that resemble the architecture of digital cities in old sci-fi. Programs and NPCs from both old and new games interact in this area, but everything is under constant threat of corruption from rogue data. The city is divided into layers of code, resembling different levels of a game or an operating system.\nKey Locations:\nThe Core Plaza: A central square surrounded by giant data towers. It’s a meeting point for programs and NPCs and often where players can access side quests or trade with digital NPCs.\nTron’s Archive: A memorial for the original program Tron, who played a vital role in maintaining order in the system. The archive is a library containing historical data and digital maps.\nThe Data Network: A fast-travel system through interconnected data highways, similar to light cycle races. Programs use this system for both travel and communication.\nChance of Mobs Appearing:\nModerate. Security systems gone awry sometimes create Glitched Programs, Virus Heartless, and Data Duplicates that attack anyone who doesn’t belong.\nOpen Areas:\nCyber Streets: Wide roads where glowing data streams race overhead. The area is filled with Patrol Programs who guard against corrupt data but are vulnerable to being turned by dark code.\nFirewall Walls: Tall barriers of digital fire, only accessible by special programs or items.\n\nRegion 2: Outlands\n\nThe digital wastelands of The Grid, a dangerous and barren place corrupted by forgotten, obsolete programs and data. These areas were once used to test new programs and test code, but now they are nothing more than ghost zones—areas of broken data, floating ruins, and hostile anomalies.\nKey Locations:\nThe Junk Pile: A massive junkyard of discarded data, corrupted code, and old programs. This area is the graveyard for non-functioning programs.\nClu's Tower (Ruins): Once the center of Clu’s domain, this crumbling fortress houses remnants of Clu’s corrupted data, who sought to control The Grid and purge all imperfections.\nData Canyon: A wide rift separating the outskirts of the city from the deep void beyond. It is here where corrupted data storms and Heartless-like Glitch Creatures are most dangerous.\nChance of Mobs Appearing:\nHigh. Data storms corrupt NPCs, turning them into Glitch Constructs, while Corrupted Debuggers patrol the area, seeking to wipe out hostile data.\nOpen Areas:\nVoid Fields: An empty, hollow expanse where random data glitches cause terrain to shift and warp.\nCode Tornadoes: A swirling field of broken data, leading to more dangerous sections of the Outlands, where only the bravest programs venture.\n\nRegion 3: Game Central Station\n\nGame Central Station is the intersection of The Grid and the external game worlds. It is a vast terminal housing gates to various game worlds and franchises. Programs and players alike frequent this space to travel between their respective games. While it’s a lively space, with energy-filled corridors and bustling digital traffic, it’s also full of hidden dangers in the form of Cy-Bugs, Glitch Bugs, and other corrupted game anomalies.\nKey Locations:\nTerminal Hall: A grand hall with pathways to different game worlds. It is constantly monitored by Control Programs to ensure smooth travel.\nArcade Nexus: A marketplace where various game characters come to trade or interact. Here, you may find special Game Drops, which provide buffs or data-based gear.\nRalph’s Garage: A maintenance area where Wreck-It Ralph can help the player with special challenges or gear upgrades.\nChance of Mobs Appearing:\nLow inside the central station, but higher near malfunctioning terminals or after system crashes. Cy-Bugs from Hero’s Duty and Virus Heartless can be found here.\nOpen Areas:\nGame Lanes: The corridors between game worlds, offering rapid access but often targeted by Corrupted Programs or Data Scavengers.\nPower Surge Fields: A place where power surges alter the environment, sometimes providing treasure but at other times unleashing Glitched Enemies.\n\nDungeon: The Castle That Never Was (Digital Version)\nDescription: This dungeon represents the corrupted version of The Castle That Never Was, reprogrammed by Xemnas’s lingering code, but now fused with the digital distortions of The Grid. The Castle is a twisted version of the original, with walls that constantly shift, glitching pathways, and an eerie atmosphere filled with echoes of broken data.\nDungeon Layout:\nEntrance Hall: A massive chamber with floating, glitching platforms and barriers.\nHeartless Corridors: The twisting, disorienting halls that seem to lead in circles, with security programs gone rogue.\nCore Chamber: The final area, where a Data Replica of Xemnas stands as the corrupted guardian of this realm.\nBoss: Data Xemnas\nThe corrupted data of Xemnas, now a rogue program with control over data and Heartless alike. Wielding data-based weapons, he uses data distortion to manipulate the world around him and summon Glitch Heartless.\n\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "Digital Realm",
                "wreck it ralph",
                "space paranoids",
                "worlds",
                "game central station"
            ],
            "id": 18,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Digital Realm",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "19": {
            "uid": 19,
            "key": [
                "Castle Oblivion",
                "Land of Departure",
                "worlds"
            ],
            "keysecondary": [],
            "comment": "Castle Oblivion",
            "content": "The Land of Departure was constructed by the late Master Eraqus during his time as a Keyblade Master. Intended as a failsafe should Scala ad Caelum—the primary seat of the Keyblade wielders—ever fall to darkness, the Land of Departure was designed to be a sanctuary for Keyblade wielders and a stronghold of light.located in a lush world brimming with light, its location can only be accessed by those who carry the light of the Keyblade in their hearts or are guided by a Master’s teachings.\nUnlike Scala ad Caelum’s grandeur and sprawling citadels, the Land of Departure is a serene, isolated mountain landscape. Its centerpiece is a grand fortress nestled within lush, rolling hills, surrounded by tranquil streams and waterfalls. While not as populous as Scala, the Land of Departure houses training grounds, sacred chambers, and a repository of knowledge that reflects Master Eraqus’s belief in the balance between light and darkness.\nThough its creator has passed, the Land of Departure continues to serve as a hidden bastion for Keyblade wielders and remains a symbol of hope and perseverance.\n\nNotable Areas:\n\n1. The Fortress of Light\nDescription: At the heart of the Land of Departure is the fortress itself, a majestic structure built atop a towering mountain. Its golden spires and reflective marble walls stand as a beacon of light against the backdrop of the surrounding natural beauty. The fortress serves as both a sanctuary and training ground for Keyblade wielders.\nPoints of Interest:\nThe Hall of Balance: A large chamber where Keyblade Masters once meditated on the balance of light and darkness. The room is illuminated by stained glass windows depicting the history of the Keyblade War, Master Eraqus’s teachings, and the worlds protected by wielders.\nThe Dormitories: Living quarters for the Keyblade wielders who trained under Master Eraqus or sought refuge here. The rooms are simple yet comfortable, designed to foster a sense of unity among their inhabitants.\nThe Hidden Altar: A secret room located deep within the fortress. It contains a portal that can transport wielders to Scala ad Caelum or other worlds in times of great need.\nChance of Mobs: Low to none. The fortress is protected by powerful wards of light that repel most dark entities. However, occasional breaches from Heartless have occurred, as the Land of Departure is tied to strong emotions and memories of its past.\n\n2. The Verdant Fields\nDescription: Surrounding the fortress is a sprawling, idyllic landscape of rolling green hills, sparkling rivers, and towering cliffs. This area is used for training and meditation, as it provides an open and serene environment free from distraction.\nPoints of Interest:\nThe Training Grounds: An open field where wielders practice combat and refine their skills. Wooden training dummies and sparring arenas dot the area, and the echoes of clashing Keyblades can often be heard.\nThe Reflecting Pools: A tranquil area where wielders meditate and reconnect with their inner light. The pools are said to reflect not only the stars above but also the wielder’s true self, making them a place of spiritual clarity.\nThe Cliff of Dawn: A towering cliff overlooking the entire Land of Departure. It’s a place of reflection and decision-making, often visited by wielders facing a personal crossroads.\nChance of Mobs: low to none. While most of the Verdant Fields are peaceful, the outer edges are occasionally plagued by minor Heartless that slip through dimensional cracks.\n\n3. The Twilight Peaks\nDescription: Beyond the fields lie towering mountain ranges that surround the Land of Departure. These peaks are steeped in mystery, with treacherous paths and hidden caves that lead to long-forgotten chambers.\nPoints of Interest:\nThe Forgotten Cave: A hidden cavern beneath one of the peaks that holds relics of the past, including items and writings left behind by Eraqus himself. The cave is protected by intricate puzzles and traps, designed to ensure only those deemed worthy can access its secrets.\nThe Veiled Crossing: A narrow bridge high in the peaks, shrouded in perpetual twilight. The crossing serves as a test of courage and determination for young wielders.\nThe Summit of Echoes: The highest point in the Land of Departure, where the air grows thin, and the stars feel within reach. It is said that at the summit, one can hear the echoes of past Keyblade Masters, offering guidance to those who listen.\nChance of Mobs: low . The peaks are remote and less protected than the central areas, making them a hotspot for powerful dark entities and shadowy remnants tied to the past. Some nobodies and unversed lurk this parts of the world\n\n4. The Eternal Meadow\nDescription: A vast meadow filled with luminescent flowers that bloom only at night. The meadow is imbued with an aura of calm, and its beauty is unmatched. It is said that the flowers contain traces of light left behind by the wielders who trained here long ago.\nPoints of Interest:\nThe Lumina Blossom: A rare flower at the heart of the meadow that glows brighter than all others. Legend says it was planted by Master Eraqus himself as a reminder that light can bloom even in the darkest times.\nThe Moonlit Shrine: A small, circular structure in the center of the meadow where wielders gather to honor the memories of their fallen comrades and draw strength from their light.\nChance of Mobs: Very Low. The meadow is a place of peace, protected by powerful light magic. However, its tranquility makes it a tempting target for those who seek to corrupt it.\n\n\n\n\n\n\n\n5. The Underworld/Castle oblivion\nDeep beneath the Land of Departure, hidden close to the heart of the world, lies a fragmented and chaotic dimension known as the Shattered Realm. This dark and eerie shadow-realm is the last remnant of Castle Oblivion, a fortress that was once the purpose to conceal the comatose body of Ventus. When Master Aqua transformed the Land of Departure into Castle Oblivion, she unintentionally created a dimensional prison—a space designed to trap and contain darkness itself. Though Castle Oblivion has reverted to the Land of Departure, its shadow lingers as a corrupted and surreal plane of existence.\nThe Shattered Realm exists as a dark mirror of the Land of Departure. Its crumbling landscapes, warped halls, and endless voids echo with the faint whispers of memories and wielders long forgotten. The environment is filled with decayed structures that float in space, connected by precarious bridges of light and shadow. The chaotic atmosphere reflects the duality of light and darkness, making it a place of great danger and intrigue.\n\nPoints of Interest:\nThe Abyssal Gateway\nDescription: The entrance to the Shattered Realm is concealed in the deepest sanctum of the Land of Departure. It manifests as a massive, jagged door carved from obsidian stone, glowing faintly with an otherworldly light. The door is sealed with powerful glyphs of light magic, and only those who have embraced both light and darkness can open it.\nGameplay Features: To unlock the Abyssal Gateway, players must solve memory puzzles scattered across the Land of Departure, piecing together the fractured echoes of Castle Oblivion’s past.\nThe Shadowed Ruins\nDescription: This area represents the remains of Castle Oblivion’s once-shifting architecture, now decayed and frozen in place. The twisted corridors and endless staircases feel like a labyrinth haunted by memories of past wielders. Illusions of old Keyblade wielders—both friend and foe—appear as fragmented echoes, testing the resolve of those who dare to traverse the ruins.\nGameplay Features: Enemies here are drawn from the collective memories stored within Castle Oblivion, making them unpredictable and diverse. Environmental hazards include collapsing platforms, memory-based traps, and areas of disorienting darkness.\nThe Forgotten Cathedral\nDescription: At the center of the Shattered Realm is a massive, broken cathedral with glowing stained-glass windows that depict the histories of Keyblade wielders, including the tragic fall of Daybreak Town. The cathedral serves as a gathering point for the lingering darkness trapped within the realm, making it a hotspot for Heartless activity.\nGameplay Features: The cathedral is a multi-layered combat zone filled with shadowy enemies and puzzle-like challenges. At its peak lies a powerful relic tied to the origins of Castle Oblivion, which must be obtained to progress further.\nThe Heartless Core\nDescription: At the lowest depths of the Shattered Realm lies the Heartless Core, where darkness is most concentrated. This swirling nexus of negative energy is a place of raw, unrelenting chaos. The Heartless Core is a manifestation of all the darkness Castle Oblivion was meant to trap.\nGameplay Features: The area is teeming with powerful Heartless and dark manifestations. The final challenge in this zone pits players against a relentless horde of enemies, culminating in a boss battle against a dark, corrupted memory of a fallen Keyblade wielder.\n\nDungeon: The Trial of Light and Darkness\nThe Shattered Realm houses an ancient trial left by Master Aqua and Master Riku: the Trial of Light and Darkness. It is a test of a wielder's ability to balance both forces, located in the Forgotten Cathedral. The trial challenges wielders with combat trials, puzzles, and illusions that explore their personal struggles and the weight of their past. Completing the trial unlocks the wielder’s hidden potential and grants access to a secret Keyblade forge hidden beneath the Shattered Realm.\n\nChance of Mobs:\nVery High: The Shattered Realm is swarming with darkness-fueled Heartless and corrupted fragments of memories. Enemies here are stronger than those found in the Land of Departure proper, and many are enhanced variants tied to the twisted essence of Castle Oblivion.\nThis version ties Castle Oblivion’s fragmented and shadowy nature into a pocket dimension beneath the Land of Departure, preserving its legacy while grounding it in the world’s current lore.\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Castle Oblivion",
                "Land of Departure",
                "worlds",
                ""
            ],
            "id": 19,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Land of Departure",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "20": {
            "uid": 20,
            "key": [
                "Timeless River",
                "worlds",
                "Disney Castle"
            ],
            "keysecondary": [],
            "comment": "Timeless River",
            "content": "Disney Castle is the shining heart of a peaceful world, serving as both the home of King Mickey and Queen Minnie and a bastion of light and harmony. The castle is a grand and elegant structure surrounded by rolling meadows, tranquil waterways, and cheerful townsfolk who thrive under its protection. Beyond its idyllic exterior lies a deeper secret: the Timeless River Portal, a mystical gateway to the world's past, preserved in a black-and-white realm where time itself flows differently.\n\nCastle Grounds\nThe area surrounding Disney Castle is lush and picturesque, with manicured gardens, fountains, and walking paths. A glittering moat encircles the castle, with several bridges connecting to the bustling village beyond.\nPoints of Interest:\nRoyal Gardens: A beautifully maintained garden with hedges shaped like Disney characters and a central gazebo where townsfolk gather for festivals.\nTraining Yard: A large courtyard used by King Mickey and his guards for Keyblade practice and drills. Occasionally, Chip and Dale can be seen tinkering with Gummi Ship upgrades here.\nMoat Pathways: Paths along the moat offer serene views of the castle and feature hidden collectibles like treasure chests and Lucky Emblems.\nChance of Mobs: Very Low. Occasional low-tier Heartless may appear at night, drawn by the light of the castle.\n\nTown Districts\nNestled outside the castle gates, the town is a lively hub filled with quaint homes, shops, and gathering places. The cheerful atmosphere is infectious, with townsfolk going about their daily lives.\nPoints of Interest:\nMarket Square: The town’s bustling center, with merchants selling everything from fresh produce to magical trinkets.\nDuckburg Inn: A cozy tavern run by Scrooge McDuck, offering refreshments and rooms for travelers.\nBell Tower Plaza: A small square dominated by a clocktower that chimes melodically every hour, serving as a gathering spot for locals.\nChance of Mobs: Low. Heartless rarely appear in the town but may be drawn to the bell tower at night.\n\nThe Castle Interior\nDisney Castle's interiors are a combination of grandeur and comfort, reflecting both the monarchy's importance and the approachable nature of King Mickey and Queen Minnie.\nPoints of Interest:\nThrone Room: The central chamber where the king and queen address matters of the realm. It features ornate decor and tapestries depicting the world’s history.\nHall of Champions: A gallery displaying relics and artifacts from the king’s adventures, including trophies, Gummi Ship models, and a replica of his Keyblade.\nLibrary of Stars: A magical library filled with books that glow with light. This room also houses the Timeless River Portal, a swirling black-and-white vortex hidden behind a magical bookshelf.\nLight core room: Deep under the throne room is the light core, a powerful artificial source of light that protects the castle from darkness\nChance of Mobs: None. The castle is protected by a powerful enchantment against dark forces.\n\nTimeless River\nAccessed through the portal in the Light Core Room, Timeless River is a black-and-white version of the world’s past. It is a simpler, more innocent time, but still under threat from Heartless. The environment is cartoonish and nostalgic, with exaggerated landscapes and vintage architecture.\nAreas of Timeless River:\nSteamboat Wharf\nA lively dock area where steamboats come and go. The river sparkles with an old-fashioned charm, and the sound of steam whistles fills the air.\nPoints of Interest:\nPete’s Tugboat: A large steamboat owned by a grumpy but not-yet-villainous Pete.\nRiverfront Market: A small collection of stalls selling timeless wares, including food and tools from the era.\nChance of Mobs: Moderate. Shadow and Soldier Heartless spawn near the docks, especially at night.\nVintage Square\nThe heart of the Timeless River world, filled with cobblestone streets, quaint houses, and an old cinema that plays silent films.\nPoints of Interest:\nCinema Reel Theater: An old movie house that sometimes displays visual echoes of the future.\nMayor’s Office: A small building where the town’s leader oversees the community.\nChance of Mobs: High. The square often sees mobs of Heartless attempting to disrupt the peace.\nHilltop Meadow\nA peaceful area overlooking the river, with a windmill and open fields. It’s a perfect spot for picnics but often becomes a battleground when Heartless appear.\nPoints of Interest:\nOld Windmill: A rustic structure that doubles as a puzzle zone, requiring players to manipulate its gears.\nChance of Mobs: Moderate. Heartless like Powerwilds and Aeroplanes may ambush players.\n\nDungeon: The Clockwork Caverns\nDescription: Deep within the Timeless River lies a hidden labyrinth of clockwork machinery and gears, known as the Clockwork Caverns. This area connects the past to the present, acting as the anchor that stabilizes the Timeless River.\nChallenges:\nPlayers must navigate shifting platforms, dodge swinging pendulums, and solve time-based puzzles.\nThe final boss is Pete's Shadow, a dark and corrupted version of Pete, who seeks to sever the Timeless River’s link to Disney Castle.\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Timeless River",
                "",
                "worlds",
                "Disney Castle"
            ],
            "id": 20,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Disney Castle/Timeless River",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "21": {
            "uid": 21,
            "key": [
                "Christmas town",
                "worlds",
                "Halloween Town"
            ],
            "keysecondary": [],
            "comment": "Christmas town",
            "content": "Halloween Town and Christmas Town are interconnected realms representing two distinct but complementary sides of the holiday spectrum. Halloween Town is a darkly whimsical world where every day is a celebration of spooks and scares. Its twisted architecture, perpetual night, and eerie charm give it a unique identity. Christmas Town, accessed through a magical portal, is its counterpart—a bright, snow-covered village filled with joy and festive cheer. Both towns are vital to the fabric of their world, each embodying the spirit of their respective holidays.\n\nHalloween Town\nThe Town Square\nDescription: The heart of Halloween Town, the Town Square is a bustling center where the citizens gather to plan Halloween celebrations. The ground is cobbled, the buildings are jagged and gothic, and a large fountain featuring a menacing jack-o'-lantern dominates the area.\nPoints of Interest:\nMayor’s Pavilion: A meeting hall where the two-faced mayor announces town events.\nJack's Lab: A workshop where Jack Skellington experiments with new scares and gadgets.\nThe Fountain Plaza: A decorative area often used for festivities and hosting mini-games.\nChance of Mobs: Moderate. Shadow Heartless, Gargoyles, and Wight Knights occasionally appear, drawn to the darkness inherent in the town.\nPumpkin Patch\nDescription: A sprawling field filled with oversized pumpkins and crawling vines. The patch is dimly lit by a ghostly orange glow from the pumpkins themselves.\nPoints of Interest:\nThe Scarecrow Sentinel: A towering scarecrow that comes to life during certain quests.\nCreeping Hollow: A hidden underground tunnel beneath the patch, leading to secret treasures.\nChance of Mobs: High. The Pumpkin Patch is teeming with Graveyard Heartless, Nightwalkers, and Spooklings.\nThe Graveyard\nDescription: A shadowy cemetery on the outskirts of Halloween Town. Mist rolls over the uneven tombstones, and the moonlight casts long, eerie shadows.\nPoints of Interest:\nCursed Mausoleum: An old crypt that acts as a side quest zone, filled with traps and puzzles.\nGhost Hill: A sloping path leading to the iconic Spiral Hill, offering a panoramic view of the town.\nChance of Mobs: Very High. The Graveyard is crawling with Heartless like Graveyards, Shadows, and Search Ghosts.\n\nChristmas Town\nThe Village Square\nDescription: A cheery, snow-laden town square with colorful lights, candy-cane lampposts, and gingerbread houses. The air is filled with the sound of carols and jingling bells.\nPoints of Interest:\nSanta’s Workshop: The main attraction, where Santa and his elves prepare toys for Christmas.\nReindeer Stables: A cozy stable where Santa’s reindeer rest and eat magical feed.\nGift Depot: A storage and sorting center for presents, doubling as a shop for festive items.\nChance of Mobs: Low. Occasionally, Toy Soldiers and Winter Shadows may appear near the outskirts of the square.\nSnowy Hills\nDescription: A series of rolling snow-covered hills leading to Santa’s sleigh launch site. The landscape is dotted with decorative snowmen and candy cane fences.\nPoints of Interest:\nSleigh Launch Platform: A towering structure where Santa’s sleigh takes off each Christmas Eve.\nCandy Cane Cavern: A hidden cave filled with glowing candy canes and festive treasures.\nChance of Mobs: Moderate. Ice-themed Heartless like Frost Serpents and Winter Knights appear occasionally.\nFrozen Lake\nDescription: A shimmering, frozen-over lake surrounded by glowing fir trees. The ice is sturdy, but cracks reveal glowing treasures beneath.\nPoints of Interest:\nCrystal Igloo: A magical igloo housing a portal to other parts of the world.\nSnowflake Shrine: A mystical altar where players can perform holiday rituals.\nChance of Mobs: High. Ice Cannons and Blizzard Lords roam the area, attracted by the lake's magical aura.\n\nDungeon: Oogie Boogie’s Lair\nDescription: Hidden between Halloween and Christmas Town, Oogie Boogie’s Lair is a chaotic and treacherous domain filled with gambling-themed traps and neon lights.\nChallenges:\nPlayers must navigate spinning roulette wheels, trapdoors, and conveyor belts.\nThe final boss is Oogie Boogie, who attempts to manipulate Heartless-infused dice to overwhelm his opponents.\nDefeating him unlocks exclusive rewards and stabilizes the connection between the two towns.\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "Christmas town",
                "worlds",
                "Halloween Town"
            ],
            "id": 21,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Halloween Town/ Christmas Town",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "22": {
            "uid": 22,
            "key": [
                "prince adam",
                "beast",
                "worlds",
                "Beast's castle"
            ],
            "keysecondary": [],
            "comment": "prince adam",
            "content": "Beast's Castle is a grand, Gothic-style palace shrouded in perpetual twilight. The castle sits in a vast, untamed wilderness, surrounded by dense forests and misty moors. Once a lively and regal home, the castle has been cursed, its residents transformed into enchanted objects, and its master, the Beast, into a monstrous figure. Despite the curse, a flicker of hope remains in the form of the enchanted rose, protected within the West Wing. The world is a delicate balance of light and darkness, reflecting the Beast's internal struggle.\n\nMain Castle Areas\nThe Grand Hall\nDescription: The heart of Beast's Castle, the Grand Hall is an opulent chamber with high vaulted ceilings, intricate chandeliers, and tattered banners that hint at its former glory. The hall is lined with suits of armor that sometimes seem to move on their own.\nPoints of Interest:\nThe Ballroom: A majestic room with a massive, cracked marble floor and a stunning ceiling mural of stars.\nThe Dining Hall: An elegant room where enchanted objects like Lumière and Mrs. Potts host lighthearted side quests.\nThe Grand Staircase: Leading to the upper levels, this staircase offers access to the East and West Wings.\nChance of Mobs: Moderate. Shadows, Hook Bats, and Large Bodies are commonly found here.\nThe West Wing\nDescription: The most dangerous part of the castle, this wing is dark and foreboding, filled with torn drapes, shattered furniture, and claw marks on the walls.\nPoints of Interest:\nThe Enchanted Rose Room: The location of the rose, protected by a powerful enchantment and the Beast’s intense emotions.\nThe Beast's Quarters: A private room where players can interact with the Beast and Belle during certain story points.\nChance of Mobs: High. Gargoyle Knights and Bookmasters are common here, drawn to the darkness of the Beast’s anger.\nThe East Wing\nDescription: A more peaceful section of the castle, with long, elegant corridors and picturesque windows offering views of the moors.\nPoints of Interest:\nThe Library: A vast, cozy room filled with towering shelves and enchanted books. Belle often resides here.\nThe Servants' Quarters: A charming area where players can interact with Cogsworth, Lumière, and other enchanted servants.\nChance of Mobs: Low. Occasional weak Heartless like Shadows and Creepers appear.\nOutside the Castle\nThe Misty Forest\nDescription: A dense, eerie forest that surrounds the castle. Thick fog and haunting howls make it easy to get lost here.\nPoints of Interest:\nThe Forgotten Clearing: A small open space where hidden treasures and puzzles can be found.\nThe Winding Path: A treacherous trail leading back to the castle gates.\nChance of Mobs: Very High. Wolves, Gargoyle Knights, and Darkballs are prevalent here.\nThe Castle Gardens\nDescription: Overgrown and untended, the gardens are filled with twisted hedges, wilting flowers, and cracked fountains.\nPoints of Interest:\nThe Hedge Maze: A labyrinthine area hiding rare collectibles and ambushes.\nThe Moonlit Fountain: A serene yet haunting spot where Belle often comes to reflect.\nChance of Mobs: Moderate. Shadows and Hook Bats appear frequently.\nDungeon: The West Tower\nDescription: Rising high above the castle, the West Tower is an isolated, cursed space filled with traps and dark magic. Players must ascend its winding stairs, navigating crumbling platforms and magical barriers.\nChallenges:\nGargoyle Guardians: Stone Heartless that come to life and block the path.\nMagic Puzzles: Players must solve enchantment-based puzzles to progress.\nBoss Battle: Dark Beast – A monstrous shadowy version of the Beast, created by the lingering curse and fueled by his self-doubt. Players must fight it to restore balance and help the Beast regain control of his heart.\nReward: Completing the dungeon strengthens the Beast’s resolve and unlocks the castle’s full potential, making it a safer place for its inhabitants.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "prince adam",
                "beast",
                "worlds",
                "Beast's castle"
            ],
            "id": 22,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Beast's Castle",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "23": {
            "uid": 23,
            "key": [
                "paris",
                "La Cité des Cloches",
                "Notre Dame",
                "worlds"
            ],
            "keysecondary": [],
            "comment": "paris",
            "content": "La Cité des Cloches, inspired by medieval Paris, is a vibrant and bustling city, steeped in Gothic architecture and religious significance. At its heart lies the majestic Notre Dame Cathedral, whose towering spires and echoing bells are a beacon for the city. Narrow cobblestone streets wind through districts of artisans, merchants, and commoners, showcasing a city full of both beauty and struggle. Despite its outward splendor, shadows linger in the form of corruption and prejudice, reflecting the darker sides of human nature.\n\nThe city exists as a cultural crossroads where faith, art, and power intersect, but it is also a place of conflict where good and evil often collide. Above all, Notre Dame symbolizes hope and redemption, towering over a city in flux.\n\nMain Areas\nNotre Dame Cathedral\nDescription: The towering centerpiece of La Cité des Cloches, Notre Dame is both a place of worship and a sanctuary for those in need. Its interiors are adorned with breathtaking stained glass windows, intricate carvings, and the famed bells that resonate across the city.\nPoints of Interest:\nThe Bell Tower: A hidden retreat offering stunning views of the city, inhabited by the caretaker of the bells.\nThe Nave: A grand hall where the faithful gather, filled with candles and echoes of hymns.\nThe Gargoyle Gallery: Home to mysterious stone guardians who seem to watch over the city with silent vigilance.\nChance of Mobs: Medium. Shadow Heartless and flying Gargoyle-like Heartless often appear on the roof and within the shadows of the cathedral.\nMarket District\nDescription: A lively area filled with merchants selling food, trinkets, and wares. Colorful tents and carts line the streets, and street performers draw crowds with their acts. Amid the hustle and bustle lies an undercurrent of thievery and hidden dangers.\nPoints of Interest:\nThe Courtyard: A central gathering spot for festivals and celebrations, but also a place where mobs can gather.\nThe Blacksmith's Forge: A hub for crafting weapons and armor, with the owner possessing knowledge of unique, mystical materials.\nThe Gypsy Tents: Hidden in the back alleys, these vibrant shelters hold secrets, including hidden paths to the Court of Miracles.\nChance of Mobs: Low during the day, but increases at night with Thief-like Heartless and cloaked Nobodies.\nThe Court of Miracles\nDescription: A hidden sanctuary beneath the city, home to the outcasts and gypsies who evade the law’s cruelty. Accessible only to those who know its secrets, this labyrinthine haven is a refuge of freedom and rebellion.\nPoints of Interest:\nThe Hidden Entrance: Disguised among the ruins outside the city, only those with knowledge or a keen eye can find it.\nThe Council Hall: A gathering place for the gypsies and other outcasts, where plans are made and stories are shared.\nThe Treasure Vault: A secret chamber filled with the collected wealth of the gypsies, guarded fiercely.\nChance of Mobs: Low, as the Court is well-protected, though rogue Nobodies sometimes infiltrate.\nOpen Areas\nThe Seine Riverfront\nDescription: A serene yet bustling stretch of the river Seine, lined with docks, boats, and the occasional festival barge. Fishermen and traders frequent the area, though its quiet paths can turn treacherous at night.\nChance of Mobs: Medium. Aqua-based Heartless lurk in the waters and shadows after sundown.\nThe Cathedral Plaza\nDescription: A wide-open square in front of Notre Dame, where townsfolk gather for announcements and markets. This plaza serves as a central hub for activity but becomes eerily quiet during times of unrest.\nChance of Mobs: Medium. Heartless and Nobodies are drawn to the gatherings of people.\nThe Outskirts\nDescription: The overgrown ruins and forests outside the city walls, often used as hiding spots by smugglers and refugees. The area is lush but holds secrets and dangers in its depths.\nChance of Mobs: High. Wild Heartless like Lupine-type and Thorn-vine Heartless patrol the area.\nDungeon: The Bell Tower of Notre Dame\nDescription: The Bell Tower transforms into a labyrinthine stronghold when darkness overtakes it. Twisting staircases, moving platforms, and traps guard the way to the final confrontation.\nFinal Boss: A giant, flying Gargoyle Heartless that embodies the wrath of corrupted faith. Its bell-like toll can summon waves of smaller Heartless during the fight.\nLore Connection\nLa Cité des Cloches reflects the duality of light and darkness within humanity. The city’s faith and beauty contrast sharply with its prejudice and corruption, symbolizing the struggle for redemption. The inhabitants, led by the resilient townsfolk and their guardians, fight to preserve their light against the encroaching darkness. Notre Dame, as the world’s anchor, stands as a beacon of hope, protecting both the people and their hearts from despair.\n\n\n\n\n\n\n\n\n\n\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "paris",
                "La Cité des Cloches",
                "Notre Dame",
                "worlds"
            ],
            "id": 23,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "La Cité des Cloches",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "24": {
            "uid": 24,
            "key": [
                "el valle del encanto",
                "madrigal family",
                "encanto",
                "worlds"
            ],
            "keysecondary": [],
            "comment": "el valle del encanto",
            "content": "El Valle del Encanto\nDescription:\nEl Valle del Encanto is a lush, vibrant valley hidden deep within the mountains, filled with colorful flora, cascading waterfalls, and winding rivers. At the heart of the valley lies the town of Encanto, a lively village surrounded by breathtaking natural beauty. The magical centerpiece of the valley is Casita, a sentient, enchanted home gifted with magic that blesses the Madrigal family. This world is steeped in warmth, familial bonds, and the wonders of the valley, but cracks in its magic have started to surface, threatening the harmony of the Encanto.\n\nMain Areas\nEncanto (The Town)\nDescription:\nThe town of Encanto is a picturesque village filled with vibrant houses, cobblestone streets, and bustling markets. Townsfolk go about their daily lives, sharing stories, laughter, and traditions. The Madrigal family is central to the town, offering aid to everyone through their magical gifts. However, recent signs of instability in Casita’s magic have begun to worry the villagers.\nPoints of Interest:\nThe Plaza: The central square of Encanto, featuring a fountain and a marketplace alive with music and chatter.\nThe Church of Hope: A small, serene chapel where villagers seek guidance and solace.\nThe Artisan's Alley: A vibrant street where craftspeople sell handmade goods and tell tales of the valley's history.\nChance of Mobs: Low. While the town itself is generally safe, small, mischievous Shadow Heartless occasionally emerge from the cracks forming around Casita.\nThe Encanto Valley\nDescription:\nThe valley surrounding Encanto is a paradise of natural wonders. Fields of flowers stretch as far as the eye can see, rivers meander gently through the land, and animals roam freely in harmony with the environment. Despite the beauty, signs of decay are starting to show—the grass wilts in some areas, and the rivers run dry in others.\nPoints of Interest:\nLa Laguna Cristalina: A clear, sparkling lagoon believed to amplify the magic of the valley.\nThe Whispering Forest: A dense, mystical woodland where the trees seem to murmur secrets of the past.\nThe Hidden Path: A secluded trail leading to a scenic overlook of the entire valley.\nChance of Mobs: Medium. Heartless like Red Nocturnes and Trick Ghosts are drawn to the magical instability in the valley.\nCasita (The Enchanted House)\nDescription:\nCasita is a magical house that responds to the emotions and needs of the Madrigal family. Its rooms reflect the personalities and gifts of its residents, from a jungle in Antonio’s room to a vibrant flower garden in Isabela’s. However, Casita is no longer as lively as it once was. Its tiles crack, walls creak, and the house’s magical glow flickers, hinting at deeper troubles within.\nPoints of Interest:\nThe Grand Hall: The heart of Casita, where the family gathers. Cracks have started forming here, disrupting the once-vibrant energy.\nThe Candle’s Alcove: The resting place of the magical candle that powers Casita. Its light dims as the corruption grows.\nThe Family Rooms: Each family member’s room holds clues about their struggles, with Abuela’s room now locked and ominously silent.\nChance of Mobs: High. As Casita deteriorates, more powerful Heartless, such as Neoshadows and Darklings, emerge within its walls.\nDungeon: Abuela’s Room – The Crumbling Sanctuary\nDescription:\nAbuela Madrigal’s room, once a place of serene beauty symbolizing her connection to the valley’s magic, has become corrupted by her insecurities and fears. The room now reflects her inner turmoil, with the walls crumbling and vines of darkness spreading across its surfaces. Platforms of fractured stone float in a swirling void, and echoes of Abuela’s guilt and worry whisper through the air.\nKey Challenges:\nThe Corridor of Doubt: A twisting pathway filled with shadowy illusions of past failures and fragmented memories of the Madrigal family’s history.\nThe Trial of Balance: A puzzle requiring careful navigation of light and shadow platforms to stabilize parts of the room.\nThe Hall of Reflection: A combat challenge where Heartless disguised as family members test the wielder’s resolve and strength.\nBoss: The Manifested Insecurity\nDescription:\nThe Heartless boss is born from Abuela Madrigal’s deepest fears and insecurities—her fear of failing her family and losing the magic. The creature is an imposing, shadowy figure with glowing, cracked edges and a towering presence. It wields chains of darkness that bind its opponents, symbolizing the oppressive expectations Abuela places on herself and others.\nBoss Phases:\nPhase One: The Manifested Insecurity attacks with sweeping strikes and summons small Heartless to overwhelm. It frequently creates barriers that deflect attacks.\nPhase Two: The boss grows more aggressive, unleashing shockwaves of dark energy and pulling characters into its chains for damaging attacks.\nFinal Phase: The creature releases a massive aura of darkness, requiring precise timing to counterattack. Its weak points become exposed intermittently, offering windows to strike.\nResolution:\nUpon the boss’s defeat, Abuela’s redemption begins. The corrupted fragments of her fears dissolve, and the room starts to repair itself. She confronts her guilt and realizes that the magic of the valley is not just about power but about love and unity within the family. Casita glows warmly once more, and its magic is restored.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "el valle del encanto",
                "madrigal family",
                "encanto",
                "worlds"
            ],
            "id": 24,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "El Valle Del Encanto",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "25": {
            "uid": 25,
            "key": [
                "worlds",
                "Archipelago of Te Fiti",
                "realm of light"
            ],
            "keysecondary": [],
            "comment": "worlds",
            "content": "The Archipelago of Te Fiti is a breathtaking world composed of lush tropical islands scattered across an endless azure ocean. Each island holds its unique character, from dense jungles and volcanic peaks to serene beaches and tranquil lagoons. At the heart of the archipelago lies Te Fiti, a radiant, verdant island embodying the life and magic of the sea and land. However, the balance of this paradise has been shattered, with darkness spreading across the islands due to the theft of Te Fiti's Heart by the trickster demigod Maui. This world centers on themes of restoration, courage, and self-discovery.\nPlayers accompany Moana, a young chief with a deep connection to the ocean, and Maui, the flawed but heroic demigod, on their journey to return the Heart of Te Fiti and restore balance to the world.\n\nMain Areas\nMotunui (Starting Island)\nDescription:\nMotunui is a vibrant village nestled on a large island with golden beaches and emerald-green forests. It is home to Moana and her people, who thrive on fishing, farming, and their connection to the ocean. However, the island has begun to suffer due to the spreading darkness, with crops failing and the waters becoming unsafe.\nPoints of Interest:\nThe Village Center: A bustling area with woven huts, meeting spaces, and a grand totem of Te Fiti.\nThe Shoreline: Where Moana first encounters the magical ocean.\nThe Ancestors’ Cave: A hidden cavern where the history of the Voyagers is revealed, with carvings and boats illuminating the people's lost legacy.\nChance of Mobs: Low. Only minor shadow-like Heartless appear, drawn to the growing despair of the islanders.\n\nThe Open Sea\nDescription:\nThe vast ocean is a character in itself, filled with peril and wonder. Its crystal-clear waters sparkle under the sun, but the journey is fraught with challenges such as whirlpools, sudden storms, and Heartless-infested waters.\nPoints of Interest:\nWayfinding Challenges: Players must navigate using constellations and environmental clues to progress, a nod to the traditional Polynesian navigation techniques.\nThe Reef’s Edge: A dangerous area filled with strong currents and lurking aquatic Heartless.\nFriendly Waters: A safe zone where the ocean actively helps Moana and the party, creating paths or calming storms.\nChance of Mobs: Medium. Large aquatic Heartless like Aqua Tanks and Sea Neons patrol the waters, alongside smaller enemies.\n\nMaui's Island (story part 1)\nDescription:\nA remote and rugged island surrounded by treacherous waves and jagged coral reefs. This is the location where Maui was trapped for centuries after losing his fishhook. The island is small but filled with remnants of Maui's time there, including carvings of his past exploits and attempts to escape. The island now acts as a mini-challenge, testing players’ problem-solving and combat skills to retrieve an item critical for the journey.\n\nPoints of Interest\nThe Broken Boat\nMaui’s failed attempts at escape are evident in the half-built rafts and carved logs scattered around the island. Players can explore these remnants to uncover humorous dialogue and clues about Maui’s story.\nThe Cliffs of Defiance\nA towering cliffside where Maui carved his history into the rock, creating a series of handholds and symbols that act as a climbing puzzle. Reaching the top offers a panoramic view of the archipelago.\nThe Tide Pool Cavern\nA hidden cave system beneath the island containing glowing tide pools. This area is guarded by aquatic Heartless and holds a special artifact—a shard of Maui’s original fishhook.\n\nChallenge: Maui’s Trial of Escape\nObjective:\nPlayers must complete a mini-challenge where they help Maui relive and overcome the frustrations of his time on the island. The trial combines environmental puzzles, combat, and platforming.\nPuzzle Mechanics:\nRaft Repair: Players gather materials to fix a broken raft while avoiding waves of Heartless.\nCliff Carving Symbols: Players must interpret Maui’s carvings to unlock a hidden path in the Tide Pool Cavern.\nFishhook Fragment: The final piece of the challenge requires players to solve a light-based puzzle in the cavern to retrieve the shard of Maui’s fish hook.\n\nMini-Boss: Coral Golem\nDescription:\nA hulking Heartless formed from coral, seaweed, and debris, guarding the fishhook fragment in the Tide Pool Cavern.\nAbilities:\nTidal Slam: Creates shockwaves that knock players back.\nCoral Spikes: Summons coral protrusions from the ground to block movement.\nRegeneration: Heals itself if near water, encouraging players to attack quickly.\nStrategy:\nPlayers must lure the Coral Golem away from water sources and exploit its slow movement with ranged attacks.\n\nRewards\nFishhook Fragment: A crucial item that restores some of Maui’s power and helps the party progress further.\nShip Upgrade: The repaired raft inspires an upgrade for the player’s ship, improving its durability and speed.\nCrafting Materials: Rare oceanic resources for upgrading equipment.\nMaui’s Island serves as a humorous and heartfelt addition, showcasing his character while offering a mix of puzzles, combat, and lore.\n\n\nMini-Dungeon: Kakamora Armada (story part 3)\nDescription:\nThe Kakamora appear as a fleet of coconut-shaped raiders aboard ramshackle boats. This area serves as both a challenge and a mini-dungeon as the party faces waves of enemies while navigating the chaotic battlefield on the ocean.\nFeatures:\nThe encounter takes place across interconnected boats, with platforms and narrow pathways requiring agility and precision.\nPlayers must disable the Kakamora’s cannons, avoid firebombs, and defeat waves of Heartless-infused raiders.\nMini-Boss: Kakamora Captain\nA larger, more menacing Kakamora wielding a massive club. The captain is more strategic and commands waves of reinforcements.\nRewards:\nPlayers receive upgrades for their ship (speed boost or enhanced firepower) and rare items\n\nLalotai (The Realm of Monsters) (story part 4)\nDescription:\nA bizarre, eerie underwater world teeming with bioluminescent plants and strange, otherworldly creatures. Lalotai is where Maui’s magical fishhook is found, guarded by the colossal crab-like monster Tamatoa. The realm is a dangerous maze of glowing caves and treacherous paths.\nPoints of Interest:\nTamatoa’s Lair: A shimmering cavern filled with gold, jewels, and stolen treasures.\nThe Abyssal Cliffs: Sheer drops into the void of the ocean floor, patrolled by monstrous Heartless.\nThe Grotto of Echoes: A cavern where sounds play tricks on the party, creating illusory threats.\nChance of Mobs: High. Powerful Heartless like Dark Fins and Abyss Lords roam freely, drawn to the strange energies of Lalotai.\n\n\nMini-Dungeons\nMini-Dungeon: Tamatoa’s Lair\nDescription:\nTamatoa’s lair in Lalotai becomes a mini-dungeon filled with treasures and traps. The glowing, bioluminescent cavern is both mesmerizing and dangerous, with treasures luring players deeper into danger.\nBoss: Tamatoa\nA massive, glittering crab obsessed with shiny things, Tamatoa is both humorous and threatening.\nPhases:\nTreasure Barrage: Tamatoa throws piles of treasure at the party, creating environmental hazards.\nChomp Attack: He lunges with his claws and bites, forcing players to dodge rapidly.\nFinal Glow: Tamatoa activates his bioluminescent shell, disorienting the party and summoning smaller Heartless to assist.\nRewards:\nDefeating Tamatoa grants rare crafting materials and Maui’s fishhook, an essential item for the story’s progression.\n\n\nTe Ka’s Island (Story Climax)\nDescription:\nA volcanic island shrouded in smoke and ash, representing the corruption caused by the loss of Te Fiti’s Heart. Rivers of lava cut through the barren landscape, and dark clouds loom ominously overhead. At the summit lies the lair of Te Ka, a fiery manifestation of rage and destruction.\nPoints of Interest:\nThe Lava Fields: A molten wasteland filled with treacherous terrain and erupting geysers.\nThe Bridge of Resolve: A narrow path leading to Te Ka’s domain, testing the party’s bravery.\nThe Summit Crater: The site of the climactic confrontation and where the Heart must be returned.\nChance of Mobs: Very High. Lava-infused Heartless such as Magma Shades and Fiery Core monsters dominate the island.\n\nDungeon: Te Ka’s Lair – The Heart of Conflict\nDescription:\nThe dungeon unfolds as the party ascends Te Ka’s volcanic island. The environment grows increasingly hostile, with collapsing pathways, lava eruptions, and relentless Heartless attacks. At the peak, they face Te Ka, but the battle is more than just physical—it’s a battle of will and understanding.\nBoss: Te Ka\nDescription:\nTe Ka is a towering, lava-spewing entity representing destruction and despair. Its attacks are powerful and erratic, mirroring its chaotic nature.\nPhases:\nPhase One: Te Ka launches lava projectiles and swipes at the party with molten claws. The arena’s platforms slowly crumble, requiring constant movement.\nPhase Two: As the Heart is brought closer, Te Ka becomes more aggressive, summoning fiery Heartless to aid its assault.\nFinal Phase: Te Ka weakens, exposing its true form. Moana must play a critical role in restoring the Heart to reveal its identity as Te Fiti’s corrupted guardian spirit.\nResolution:\nWhen the Heart is restored, Te Ka transforms into Te Fiti, a radiant, benevolent entity. The island blooms into vibrant life, and the darkness is expelled from the archipelago. Moana and Maui reconcile their roles as protectors of the ocean, and the party receives blessings from Te Fiti before departing.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "worlds",
                "Archipelago of Te Fiti",
                "realm of light"
            ],
            "id": 25,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Archipielago of Te Fiti",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "26": {
            "uid": 26,
            "key": [
                "",
                "Keyblade Graveyard",
                "world"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "The Keyblade Graveyard\nDescription:\nThe Keyblade Graveyard is a haunting and desolate wasteland where the decisive battle of the Keyblade War once raged, leaving behind countless Keyblades embedded in the earth as solemn markers of fallen wielders. The sky is perpetually stormy, with dark clouds swirling ominously above, reflecting the lingering tension between light and darkness. Jagged rock formations and endless stretches of cracked, barren earth dominate the landscape. The graveyard exudes a heavy aura of loss, history, and unresolved conflict.\n\nThough no civilization exists here, the graveyard is central to the saga of the Keyblade wielders, representing both the consequences of their power and the importance of balance. This world’s environment feels like a natural dungeon, with dangers and trials lurking at every turn.\n\nMain Areas\nThe Crossroads of Fate\nDescription:\nThe centerpiece of the graveyard, where paths converge in a massive, battle-scarred clearing. A carved emblem on the ground marks the site of the climactic clash between light and darkness. This is where the guardians of light assembled for their confrontation with Master Xehanort and his Organization XIII.\nPoints of Interest:\nThe War Memorial: A colossal stone structure engraved with Keyblade symbols, paying homage to the wielders who fought and fell here.\nThe Converging Paths: Trails leading to other areas of the graveyard, flanked by scattered Keyblades of all shapes and sizes.\nThe Storm’s Eye: A central vortex of swirling winds and energy that grows stronger as darkness gathers.\nChance of Mobs: High. Heartless and Nobodies frequently appear, including Shadows, Neo Shadows, and Dusks.\nThe Field of Fallen Blades\nDescription:\nA vast expanse stretching beyond the Crossroads, the Field of Fallen Blades is where the densest concentration of Keyblades can be found. Each blade tells a story of a wielder’s sacrifice, their power, and their resolve. The area is eerily silent except for the distant howl of the wind.\nPoints of Interest:\nThe Silent Monolith: A towering spire where the names of ancient Keyblade wielders are etched into the rock.\nThe Shard Canyon: A narrow pathway flanked by crumbled Keyblade hilts and shards of armor, leading deeper into the graveyard.\nThe Reflection Pools: Small patches of stagnant water that shimmer faintly, showing fragmented visions of the past when gazed into.\nChance of Mobs: Medium. Darkside and Antiform Heartless are common, alongside roaming Nobodies like Assassins and Reapers.\nThe Badlands\nDescription:\nA rugged, rocky region marked by jagged cliffs and treacherous ravines. The Badlands is the primary battleground of Keyblade wielders during climactic confrontations. It is here that the guardians of light clashed with Master Xehanort’s Organization. The terrain is harsh and unforgiving, with uneven footing and frequent dust storms.\nPoints of Interest:\nThe Ravine of Resolution: The site of the final confrontation with the Organization XIII members, still radiating faint traces of their lingering presence.\nThe Twilight Overhang: A cliffside offering a panoramic view of the entire graveyard, often used for quiet reflection.\nThe Windshard Passage: A narrow canyon where the winds are so strong they scatter Keyblade fragments like leaves.\nChance of Mobs: Very High. Armored Heartless, large-scale enemies like Behemoths, and elite Nobodies are common.\nThe Boss Encounter: Dark Inferno\nDescription:\nDeep within the Badlands, the Dark Inferno emerges as the ultimate test for any Keyblade wielder who dares to face it. This Heartless embodies the pure essence of battle, wielding immense power and an unrelenting ferocity. Its armor glows with fiery darkness, and its attacks are swift, precise, and devastating.\nPhases:\nPhase One: The Dark Inferno utilizes rapid slashes and ground-based shockwaves, testing the wielder's ability to evade and counter.\nPhase Two: The boss grows more aggressive, adding explosive projectiles and AoE firestorms to its arsenal.\nFinal Phase: The Dark Inferno channels its full power, summoning swirling orbs of dark energy that home in on the wielder while continuing its relentless melee attacks.\nStrategy:\nWielders must balance offense and defense, using counterattacks and magic to create openings. Dodging its powerful combo strikes and mastering the timing of reprisal attacks are key to victory.\nOpen Areas\nThe Shifting Sands\nDescription:\nA treacherous expanse of dry, cracked earth and swirling sandstorms that obscure vision. Keyblade shards are scattered across the ground, partially buried in the dust. The area feels unsteady, as if the land itself is watching intruders.\nChance of Mobs: High. Swarms of Shadows, Creeper Nobodies, and Serpent Heartless emerge unpredictably from the sands.\nThe Forgotten Canyon\nDescription:\nA jagged valley of deep shadows and faint echoes of the past. It is said that those who wander here can hear the distant cries of fallen wielders. The canyon walls are marked with ancient symbols, now worn and indecipherable.\nChance of Mobs: Medium. Large Heartless such as Invisibles and Aerial Knockers appear alongside occasional Neo Shadows.\n",
            "constant": false,
            "selective": false,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "Keyblade Graveyard",
                "world"
            ],
            "id": 26,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "The Keyblade Graveyard",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null
        },
        "27": {
            "uid": 27,
            "key": [
                "Kingdom of the Sun",
                "kuzco"
            ],
            "keysecondary": [],
            "comment": "Kingdom of the Sun",
            "content": "The Kingdom of the Sun\nDescription:\nThe Kingdom of the Sun is a grand Incan civilization nestled high in the Andes mountains. The kingdom was founded to guard against the resurgence of the shadow god Supai, who was sealed deep beneath the Earth by Inti, the sun god. Its architecture blends gold-encrusted temples, lush terraced fields, and stone-hewn villages. The kingdom exudes prosperity and harmony, but beneath its surface lies the brewing threat of Yzma, a high priestess seeking to awaken Supai and claim his dark power to restore her lost youth. The world’s story follows the young emperor, Kuzco, and a humble llama herder, Pacha, as they unravel Yzma’s schemes and uncover their shared destiny to protect the Kingdom of the Sun.\nMain Areas\nGolden City of Inti\nThe Kingdom's capital, built around the Sun Temple at its heart, shines with golden rooftops and intricate carvings. The city's design incorporates sprawling markets, courtyards, and aqueducts that channel water from the surrounding mountains.\n\nPoints of Interest:\nThe Sun Temple: A towering ziggurat-like structure dedicated to Inti. It houses a grand solar altar where rituals are performed to maintain the seal on Supai.\nThe Marketplace: A bustling hub filled with colorful stalls offering fresh produce, handmade textiles, and llamas for trade.\nKuzco's Palace: The residence of Emperor Kuzco, adorned with murals depicting the kingdom’s history and the gods' battle.\nChance of Mobs:\nLow in the city proper but increases in the temple at night. Shadowy Heartless resembling llamas and jaguars occasionally spawn.\n\nPacha’s Village\nA quaint settlement on the outskirts of the Golden City, surrounded by terraced fields and grazing llamas. The village is quiet and humble, with its residents living in harmony with the land.\n\nPoints of Interest:\nThe Llama Pastures: Wide, grassy fields where Pacha tends to his llamas.\nThe Stone Bridge: A narrow, rickety bridge connecting the village to the city, with stunning views of the valleys below.\nThe Storytelling Firepit: A gathering spot where villagers share tales of the gods and legends of the shadow god Supai.\nChance of Mobs:\nVery low. This area acts as a safe zone but becomes more dangerous after Yzma begins her plot.\n\nThe Sacred Passage\nA secret path carved into the mountain, leading to the hidden ruins beneath the Sun Temple. It is an ancient and treacherous route filled with puzzles, traps, and remnants of forgotten guardians.\nPoints of Interest:\nThe Stone Guardians: Statues of mythical animals that come to life, acting as sentries for the ruins.\nThe Underground River: A flowing waterway that adventurers must navigate by boat.\nThe Golden Veil: A shimmering curtain of sunlight marking the entrance to the hidden chamber where Supai is sealed.\n\nChance of Mobs:\nHigh. Shadowy creatures emerge from the cracks and crevices, including Heartless resembling shadow serpents and jaguar warriors.\n\nMini-Dungeon: Yzma’s Catacombs\nDescription:\nBeneath her lavish chambers, Yzma has constructed a network of catacombs where she performs dark rituals to awaken Supai. The catacombs are a labyrinth of eerie tunnels, bubbling cauldrons, and glowing glyphs of forbidden magic.\nBoss Encounter: Heartless Supai Phantom\nA spectral creature summoned by Yzma to defend her lair. The fight involves dodging energy attacks and dispelling protective wards.\nNasca Plains (New Area)\nDescription:\nA vast, open desert plateau carved with colossal geoglyphs resembling animals, deities, and celestial patterns. These lines hold ancient energy and act as a conduit for Inti’s divine power.\nPoints of Interest:\nThe Sun Glyph: A massive geoglyph of the sun that activates when Kuzco steps onto it, triggering a vision of Inti and awakening his latent powers.\nThe Labyrinthine Maze: An area where the pathways mirror the lines of the geoglyphs, filled with traps and puzzles.\nThe Spirit Condor: A mythical creature protecting the plains, serving as a guide for Kuzco but also testing his resolve in a mini-boss encounter.\nChance of Mobs:\nModerate. Heartless resembling desert creatures (e.g., snakes, vultures) and shadowy guardians patrol the area.\nPlot: Nasca Plains Sequence:\nUpon reaching the Sun Glyph in the Nasca Plains, Kuzco experiences a divine vision. Inti appears, revealing Kuzco’s heritage and the burden of leadership. Kuzco gains the Mark of the Sun, which allows him to harness light-based abilities.\nLight-Based Powers:\nSunbeam Slash: A bright, fiery attack that damages Heartless and clears shadowy areas.\nSolar Shield: A glowing barrier that deflects attacks.\nRadiance Unleashed (Final Ability): A powerful area-of-effect attack used in the final battle against Supai.\n\n\n\nDungeon: Supai’s Sanctuary\nDescription:\nThe final battle takes place in the chamber beneath the Sun Temple, where Supai’s seal is located. This molten, volcanic space mirrors the underworld and serves as the ultimate test of Kuzco’s newfound powers.\nBoss Encounter:\nSupai, God of Shadows\nA towering Heartless-like being shrouded in shadow and wielding destructive dark magic.\nPhases:\nDark Waves: Supai summons waves of shadow creatures to overwhelm Kuzco.\nSun’s Fury: Kuzco channels Inti’s light, unlocking powerful sunbeam attacks to weaken Supai.\nSeal of the Sun: Kuzco and Pacha work together to restore the seal, banishing Supai back into the earth.\n\n\n",
            "constant": false,
            "selective": false,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Kingdom of the Sun",
                "kuzco"
            ],
            "id": 27,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Kingdom of the Sun",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null
        },
        "28": {
            "uid": 28,
            "key": [
                "",
                "kingdom hearts",
                "realm"
            ],
            "keysecondary": [],
            "comment": "",
            "content": " It is the heart of all worlds, and the source of ultimate power and wisdom. It can be considered an aggregate of hearts. Kingdom Hearts usually manifests as a bright, heart-shaped moon in the sky, with a darker aura surrounding it. Kingdom Hearts is a source of tremendously-powerful light, and the surrounding aura consists of equally-powerful darkness - in essence, it represents the brightest light shining in the deepest darkness.\n\nAccording to anceint keyblade masters one who opens the door to Kingdom Hearts will be able to destroy the current universe, called \"the World\", and create a new universe, called the \"Next World\" shaped any way that they desire. This person would be \"reborn as something far greater than human\", and also \"[gain] control over all worlds and all people\". Both Kingdom Hearts and its counterpart weapon, the χ-blade, are also capable of opening numerous Gates, golden keyhole-shaped portals between worlds.\n\nEntering Kingdom Hearts:\nOpening the door to Kingdom Hearts usually requires the χ-blade, a legendary weapon that co-exists with Kingdom Hearts itself. In ancient times, the χ-blade was broken into twenty pieces, seven of light and thirteen of darkness. As such, to reforge the weapon, seven beings of light and thirteen beings of darkness must clash in combat. While it is possible to forge the χ-blade with as few as 1 being of light and 1 being of darkness, doing so will result in an incomplete and unstable version of the weapon. Once Kingdom Hearts has been opened, it is possible for those without the χ-blade to enter it as well.",
            "constant": false,
            "selective": false,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "kingdom hearts",
                "realm"
            ],
            "id": 28,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Kingdom Hearts",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null
        },
        "29": {
            "uid": 29,
            "key": [
                "weapons",
                "",
                "kingdom hearts",
                "keyblade",
                "χ-blade"
            ],
            "keysecondary": [],
            "comment": "weapons",
            "content": "Originally, the χ-blade was the counterpart of Kingdom Hearts, for which it acted as protector. It is the original after which all Keyblades are imperfectly modeled from. The true χ-blade remains lost until the seven lights of the Princesses of Heart or the New Seven Hearts and the thirteen Darknesses are reunited. \n\nThe χ-blade appears to be made up of two crossing Kingdom Keys, with the teeth facing outward. It has a filigree that slightly resembles one on the Ultima Weapon, and the blade slightly resembles the Dream Sword.\n\nCentral Design: Two Keyblades (resembling Kingdom Hearts' Keyblade and Oathkeeper/Oblivion) are crossed at the center. These two keyblades have distinct coloration; generally one is gold and the other is silver.\nBlade: A long, powerful, and golden blade extends from the intersection of the two Keyblades.\nOrnament: A large, complex, wheel-like ornament is situated between the crossed Keyblades, usually depicted with a pale green, almost translucent, appearance. This ornament is often described as radiating light or energy.\nChain: A chain with a unique charm (a symbol that varies in depictions) connects to the hilt of one of the crossed keyblades. The charm represents the connection to the wielders past or future.",
            "constant": false,
            "selective": false,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "weapons",
                "",
                "kingdom hearts",
                "keyblade",
                "χ-blade"
            ],
            "id": 29,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "χ-blade",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null
        },
        "30": {
            "uid": 30,
            "key": [
                "",
                "Princesses of heart",
                "the light",
                "true light"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "Princesses of heart, also refered to as the \"true lights\", are maidens with hearts of pure light, devoid of darkness. Their hearts are seven out of twenty pieces of the χ-blade. They appear to be the only people in the universe whose hearts are born naturally free of darkness. As such, Princesses who lose their hearts do not become Heartless; however, it is possible for the Princesses to create Nobodies on special occasions. Though not all are actual princesses, the Seven Princesses are referred by that name because the one who brings all of them together can open the Door to Darkness and gain the power to reign over the worlds. \n\nThe seven Princesses possess only light within their hearts. These hearts of pure light allow them to open the Final Keyhole.\n\n The purity of their hearts also grants them abilities to keep darkness away or hold it back temporarily, an effect that occurs naturally from the Princesses' presence; the greater the number of Princesses gathered, the more effective this skill is. However, it is draining to the Princesses.\n\nThe Princesses of Heart are able to travel through the Corridors of Darkness without any negative effects, as without darkness in their hearts, they cannot be corrupted. ",
            "constant": false,
            "selective": false,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "Princesses of heart",
                "the light",
                "true light"
            ],
            "id": 30,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Princesses of Heart",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null
        },
        "31": {
            "uid": 31,
            "key": [
                "Mark of Mastery exam",
                "",
                "Keyblade masters"
            ],
            "keysecondary": [],
            "comment": "Mark of Mastery exam",
            "content": "Mark of Mastery exam is an event which serves as a test for those strong of heart that have been chosen by the Keyblade to become Keyblade Masters. The criteria for passing is up to the Keyblade Master serving as the examiner. The exam itself varies in its process, with some being simple duels and others being entire journeys to resolve pressing issues.\n\n If outside forces interfere with the exam, the examiner will determine if the applicant still meets the criteria for passing. Apprentices of Keyblade Masters who pass the test have a few paths open to them. Traditionally, new Keyblade Master will eventually take on their own apprentices, passing down their beliefs and shaping a new generation of Keyblade wielders. Others may become teachers. In addition, one Master is given the title of \"Successor\", charged with keeping watch over Scala ad Caelum. New Keyblade Masters may also choose to embark on their own journey.",
            "constant": false,
            "selective": false,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Mark of Mastery exam",
                "",
                "Keyblade masters"
            ],
            "id": 31,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Mark of Mastery exam",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null
        },
        "32": {
            "uid": 32,
            "key": [
                "",
                "magic",
                "keyblade magic",
                "magic spells"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "List of magical spells available for keyblade users:\n\n-Fire/Fire+/Firaga: Targets and explodes on contact, growing stronger with upgrades. (MP Cost: 15% of MP gauge)\n-Blizzard/Blizzara/Blizzaga: Shoots a shard of ice that slides forward, damaging enemies in its path. (MP Cost: 15%)\n-Thunder/Thundara/Thundaga: Calls down lightning strikes over a large area. (MP Cost: 20%)\n-Water/Watera/Waterga: Launches water orbs that damage surrounding enemies. (MP Cost: 10-20%)\n-Cure/Cura/Curaga: Restores health to Sora and allies; consumes all MP. (MP Cost: All MP)\n-Aero/Aerora/Aeroga: Summons gusts of wind to damage and lift enemies. (MP Cost: 15%)\n-Stop: Freezes enemies in place for a brief period. (MP Cost: 2)\n-Gravity: Compresses enemies, dealing damage and pulling them downward. (MP Cost: 2)\n-Reflect: Not available in KH1 but introduced later in the series.\n-Reflect: Reintroduced as \"Barrier\" abilities in specific Keyblades.\n-Fire Raid: Throws a fiery disc at enemies. (MP Cost: ~10%)\n-Blizzard Edge: Dashes forward, slashing with ice. (MP Cost: ~8%)\n-Spark/Sparkra/Sparkga: Summons light orbs that home in on enemies. (MP Cost: ~15–25% depending on level)\n-Gravity Strike: Slams enemies with gravitational force. (MP Cost: ~12%)\n-Magnega: Pulls in enemies with gravitational magic. (MP Cost: ~20%)\n-Balloon/Ballonra/Balloonga: Summons balloons that burst for damage. (MP Cost: ~10–20% depending on level)\n-Mini: Shrinks enemies, weakening them. (MP Cost: ~8%)\n-Blackout: Blinds enemies, stopping attacks. (MP Cost: ~8%)\n-Sleep/Sleepra/Sleepga: Puts enemies to sleep. (MP Cost: ~10–20% depending on level)\n-Confuse: Makes enemies attack each other. (MP Cost: ~12%)\n-Poison: Inflicts continuous damage over time. (MP Cost: ~8%)\n-Bind: Immobilizes enemies. (MP Cost: ~8%)\n-Slow: Reduces enemy movement speed. (MP Cost: ~8%)\n-Time Bomb: Turns enemies into bombs. (MP Cost: ~15%)\n-Meteor: Rains meteors for area damage. (MP Cost: ~25%)\n-Tornado: Summons a vortex to damage enemies. (MP Cost: ~30%)\n-Faith: Pillars of light deal damage and heal the user. (MP Cost: ~25%)",
            "constant": false,
            "selective": false,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "magic",
                "keyblade magic",
                "magic spells"
            ],
            "id": 32,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Magic list",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null
        },
        "33": {
            "uid": 33,
            "key": [
                "",
                "healing items",
                "items"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "-Potion: Restores a small amount of HP.\n-Hi-Potion: Restores a moderate amount of HP.\n-Mega-Potion: Restores HP for all party members.\n-Ether: Restores a small amount of MP.\n-Elixir: Fully restores HP and MP for one character.\n-Megalixir: Fully restores HP and MP for all party members.",
            "constant": false,
            "selective": false,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "healing items",
                "items"
            ],
            "id": 33,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Healing items",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null
        },
        "34": {
            "uid": 34,
            "key": [
                "",
                "Support Items",
                "status items",
                "status aid items"
            ],
            "keysecondary": [],
            "comment": "",
            "content": "-Panacea: Removes all negative status effects.\n-Tent: Restores a significant amount of HP and MP to the entire party at save points.",
            "constant": false,
            "selective": false,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "",
                "Support Items",
                "status items",
                "status aid items"
            ],
            "id": 34,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Status and Support Items",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null
        },
        "35": {
            "uid": 35,
            "key": [
                "currency",
                "munny",
                "noney"
            ],
            "keysecondary": [],
            "comment": "currency",
            "content": " Munny is the universal nurrency used to purchase items, gear, and upgrades.",
            "constant": false,
            "selective": false,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "currency",
                "munny",
                "noney"
            ],
            "id": 35,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Munny",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null
        }
    }
}