{
    "entries": {
        "0": {
            "uid": 0,
            "key": [
                "Anxiety"
            ],
            "keysecondary": [],
            "comment": "Anxiety",
            "content": "What does anxiety feel like?\nAnxiety can cause you to feel lots of different things in your mind and body, including:\n\nIn the mind\nfeeling worried all the time\nfeeling tired or sleeping badly\nbeing unable to concentrate\nfeeling irritable or depressed\nfeeling uneasy or tense\nfeeling overwhelmed\nfeeling afraid that something awful might happen.\nIn the body\nfast or irregular heartbeat (palpitations)\nsweating\na dry mouth\nmuscle tension and pain\nheadaches\ntrembling/shakiness\nnumbness or tingling in the fingers, toes or lips\nbreathing fast\nfeeling dizzy or faint\nstomach problems like indigestion, cramps or feeling sick\ngoing to the toilet a lot\nfeeling a lot of anxiety related to these physical sensations.\nSometimes, people with anxiety worry that their symptoms are a sign of physical illness. This can make their anxiety even worse.\n\nMost people experience anxiety from time to time without it becoming a problem. Here are some things to look out for if you think someone you know might be experiencing higher levels of anxiety than usual:\n\nThey seem to be worrying about something, or lots of things, to a level that doesn’t seem rational.\nThey avoid situations or environments that they didn’t avoid in the past. For example, going to parties, out for dinner or to crowded places.\nThey complain of physical symptoms like headaches, stomach aches or tiredness.\nThey seem upset, angry or frustrated for no obvious reason.\nThey cancel plans, or don’t do things they say they will.\nThey seem distracted or unable to listen when you are talking to them.\nDifferent people experience and communicate anxiety in different ways, depending on their life experiences, cultural or religious background, and their primary language. This might mean that someone’s anxiety isn’t immediately obvious to you.\n\n\nSupporting someone with anxiety can be challenging, especially if you are not an anxious person yourself. Here are some things you can do to help:\n\nListen - Being there to listen to someone struggling with their anxiety can be a huge support. Sometimes just sharing anxious feelings with another person can help to ease their anxiety.\nBe patient - Try to be patient if the person you know finds it difficult to stick to plans you’ve made, or seems irritable or distracted. It's important not to take it personally.\nTake them seriously - Even if someone is anxious about things that don’t seem rational to you, the way they are feeling will be very real to them. You don’t have to encourage their anxious thoughts, but you can reassure them that their feelings are valid and that they deserve support.\nIf you know someone who is struggling with their anxiety, encourage them to seek help, whether that means supporting themselves, or getting help from a professional.\n\n",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 0,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "1": {
            "uid": 1,
            "key": [
                "Depression"
            ],
            "keysecondary": [],
            "comment": "Depression",
            "content": "Everyone has times in their lives when they feel fed up or miserable. It is usually for a particular reason, does not interfere too much with daily life and does not usually last longer than a week or two.\n\nHowever, if these feelings go on for weeks or months, or become so bad they start to affect every area of your life, you may have depression and need to get help.\n\nWhat are the signs of depression?\nPeople experience different levels of depression in different ways. There are mild, moderate or severe levels of depression.1\n\nPeople’s experience of depression is also influenced by their cultural background and by their personal values, beliefs and language.\n\nIf you are depressed, you will probably notice some of the following:1 2\n\nIn your mind, you:\n\nfeel unhappy, miserable, down, depressed – this feeling just won’t go away and can be worse at a particular time of day, often first thing in the morning\ncan’t enjoy anything\nlose interest in seeing people and lose touch with friends\ncan’t concentrate properly and find it harder to make decisions\nlose your self-confidence\nfeel guilty and unworthy\nbecome pessimistic\nstart to feel hopeless, and perhaps even suicidal.\nIn your body, you may find that you:\n\nfeel restless, nervous or agitated\nfeel exhausted and have no energy\ncan’t get to sleep or sleep too much\nwake early in the morning and/or throughout the night\nhave a headache or stomach upset\nlose interest in sex\ncan’t eat and lose weight or 'comfort eat' more and put on weight.\nOther people may notice that you:\n\nmake mistakes at work or can't focus \nseem unusually quiet and withdrawn, or are avoiding people\nworry about things more than usual\nare more irritable than usual\nare sleeping more or less than usual\ncomplain about vague physical problems\nstop looking after yourself properly – you don't wash your hair or your clothes\nstop looking after your home properly – you stop cooking, don't tidy or forget to change the sheets on your bed.\nMost people will not experience all of these, and some people may only be aware of physical symptoms. You may think that you have a physical illness because you feel very tired or have problems with sleep, but physical symptoms like these can be the first sign of depression.1 2\n\nYou may not realise how depressed you are, especially if it has come on gradually. Sometimes people try to struggle on and may even start to blame themselves for being lazy or lacking willpower.\n\nIt sometimes takes a friend or a partner to persuade you that there really is a problem and suggest that you seek help.\n\nYou may need to seek help if you or a friend or partner notice that:\n\nYour feelings of depression affect your work, interests and feelings towards your family and friends\nYour feelings of depression have been going on for a while and don't seem to get any better\nYou find yourself feeling that life is not worth living, or that other people would be better off without you.\n\nHow can I help myself?\nThese are some suggestions you can try when you are feeling depressed. It is important that you find what works best for you and create your own list of helpful strategies.\n\nTalk to someone: If you’ve had some bad news or a major upset in your life, try not to bottle things up. It can help to tell someone close to you how you feel about it. If you don't feel you can talk to anyone, try writing down how you feel.\n\nKeep active: If you are able to, get outside for some exercise, even if it’s only for a short walk. This will help to keep you physically fit and sleep better. It can also help you to focus on other things and not on painful thoughts and feelings.\n\nEat properly: You may not feel very hungry, but try to eat regularly. It’s easy to lose weight and run low on vitamins when you are depressed – or to eat too much junk food and put on weight you don't want. A balanced diet, with lots of fruit and vegetables, can help keep your body and mind healthy.\n\nAvoid alcohol and drugs: Alcohol can make you feel better for a couple of hours, but it actually makes depression worse in the long run. The same goes for street drugs, particularly cannabis, amphetamines, cocaine and ecstasy.\n\nCreate a sleep routine: Try to go to bed at the same time each night and get up at the same time each morning. Do something restful that you enjoy before going to bed, like listening to relaxing music or reading a book. If you can’t sleep, get out of bed and do something calming like sitting quietly on the couch. For more information about sleep, see our leaflet on sleeping well.\n\nTry relaxing activities: If you feel tense all the time, try relaxation exercises, yoga, massage, aromatherapy, or another activity you find relaxing.\n\nDo something you enjoy: Take some regular time to do something you really enjoy – like playing a game, reading, or another hobby.\n\nRead about depression: There are many books and websites about depression. They can help you to understand what is going on, give you strategies to cope better, and can also help friends and relatives to understand what you are going through.\n\nPractice self-kindness: You may be a perfectionist who drives yourself too hard. Try to set yourself more realistic goals or expectations. Be kinder to yourself.\n\nTake a break: It can be really helpful to get away and out of your normal routine for a few days. Give yourself a break from your daily stress and worries. If you can change your environment, even for a few hours, it can help.\n\nJoin a support group: It can be hard to help yourself when you're depressed. Talking with other people in a similar situation can help. Have a look at the list of organisations at the end of this leaflet for some ideas.\n\nKeep hopeful: Remind yourself that many other people have had depression and have got better – there is help out there and you are entitled to the help you need to feel better.\n\nA small number of people with depression may attempt or die by suicide.35 36\n\nIf you are concerned about someone then it’s important to talk to them about suicidal thoughts and feelings and to take them seriously.  \n\nAsking someone if they are feeling suicidal will not put the idea into their head or make it more likely that they will act on their thoughts.37 38\n\nIf you are still worried about someone, you can contact one of the services below for more support and advice.\n\nThe Zero Suicide Alliance provides free online training around suicide awareness and prevention, providing a starting place for people who want to support someone they are worried about.\n\nHow can I help someone who is depressed?\nListen. This can be harder than it sounds. You may have to hear the same thing over and over again. It's usually best not to offer advice unless it's asked for, even if the answer seems perfectly clear to you. If depression has been brought on by a particular problem, you may be able to help find a solution or at least a way of tackling the difficulty.\nSpend time with them. It's helpful just to spend time with someone who is depressed. Letting them know you are there for them can help encourage them to talk and keep going with doing things to feel better.\nReassure them. Someone who is depressed will find it hard to believe that they can ever get better. You can reassure them that they will get better, but you may have to repeat this over and over again.\nSupport their self-care. Make sure that they are buying enough food and eating regularly, with a good amount of fruit and vegetables in their diet. You may be able to help them to get out and do some exercise or other enjoyable activities, which can be a better alternative than using alcohol or drugs to cope with their feelings.\nTake them seriously. If they are getting worse and start to talk of not wanting to live or even hinting at harming themselves, take them seriously. Make sure that they tell their doctor.\nEncourage them to accept help. Encourage them to see their doctor, take their medication, or talk to their therapist or counsellor. If they are concerned about their treatment, encourage them to discuss these with their doctor.\nLook after yourself. It can be emotionally draining to support someone who feels depressed, so make sure you look after your own mental health and wellbeing.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 1,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "2": {
            "uid": 2,
            "key": [
                "Bipolar"
            ],
            "keysecondary": [],
            "comment": "Bipolar",
            "content": "What is bipolar disorder?\nIt used to be called ‘manic depressive illness’. As this phrase suggests, you have severe mood swings. These usually last several weeks or months and are far beyond the emotional ups and downs that most of us experience. They can be:1\n\nLow or 'depressive'\tYou feel intensely low, depressed and even despairing.\nHigh or 'manic'\tYou feel extremely happy, elated, and become very overactive. You may develop very grandiose, delusional ideas about yourself and your abilities.\nHypomanic\tYour mood is high, but not so extreme as in mania\nMixed\tYou have a mixture of mania and depression – for example, you feel very depressed, but also have the restlessness and overactivity of mania.\n\n",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 2,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "3": {
            "uid": 3,
            "key": [
                "ADHD"
            ],
            "keysecondary": [],
            "comment": "ADHD",
            "content": "Attention deficit hyperactivity disorder (ADHD) is a diagnosis given to people who have challenges with:\n\ninattention - finding it hard to concentrate\nhyperactivity - feeling restless and struggling to sit still\nimpulsivity - saying or doing things without thinking about the consequences first.\nMost people experience these challenges at some point in their lives, or in certain situations. For example, someone might struggle to concentrate the following day if they’ve had a bad night’s sleep.\n\nHowever, for people with ADHD, these challenges usually begin in childhood and for most people they continue as they grow up, though they may change or improve. These challenges will also affect someone in many areas of their life.\n\n“For me, reading a book can feel like a carousel ride with the book held by someone in the crowd. Tasks can feel like a car journey where my impatient self is in control of the pedals, but my curious self is holding the wheel.” - A person with ADHD\n\nHow can I support someone I know who has ADHD?\nIf you know someone who has ADHD, there are a number of things you can do to make life easier for them, and yourself.\n\n1. Learn about the condition\nJust because you’ve met one person with ADHD doesn’t mean you’ve met them all. Finding out more about the condition can help you to get a stronger understanding of ADHD. It will also show the person that you care about them.\n\n“It's exhausting, variable and infuriating multiple times a day. It can impact every aspect of your life and a lot of that is hidden, especially with the mental load of women juggling home, work, family. People have no idea.” - Margaret\n2. Join a peer support group\nSome adult ADHD peer support groups run separate groups for partners and spouses, or allow them to participate in the ADHD groups. Check with the group first before attending. You will usually be able to find out more about a peer support group online.\n\n3. Speak to the person you know\nAsk the person you know if there is anything you can do to help. If they can’t think of anything right now, you can let them know you are there if they need someone to talk with in the future.\n\n4. Be aware of stigma\nThere are a lot of misconceptions about ADHD and the people who have it. You can help by informing yourself and other people about the realities of ADHD.\n\n5. Manage your frustrations\nIf you find the behaviour of the person you know upsetting or frustrating, talk through your feelings with someone you trust. If there are problems you want to bring up, try to explain clearly what the issue is and what you think could help. There may be things that both of you can do to help solve the issue.\n\n“Sometimes when we talk about disability, we make assumptions that it’s got to be something visible. And when you have ADHD it’s not so visible, and people just put it down to your personality.” - Hameed",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 3,
            "probability": 100,
            "useProbability": true,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "4": {
            "uid": 4,
            "key": [
                "Addiction"
            ],
            "keysecondary": [],
            "comment": "Addiction",
            "content": "‘Addiction’ can mean many things to many people, but in general it refers to repeatedly using a substance (such as drugs) or engaging in an activity (such as gambling) for pleasure, even though doing so causes harm or interferes with everyday life.\n\n\nHow can I tell if my friend is addicted to drugs?\nTheir behaviour, their physical appearance, and certain stuff in their environment can provide clues as to whether your friend might be addicted to drugs.\n\nBehavioural clues\n\nLook for:\n\nsudden changes in behaviour or mood swings\n\nwithdrawal from family members and old friendship groups\n\ncarelessness about personal grooming\n\nloss of interest in hobbies, sports or other favourite activities\n\nneglect of responsibilities.\n\nPhysical clues\n\nLook for:\n\nred, glassy or bloodshot eyes, or pupils that are smaller or larger than normal\n\nsniffing or a runny nose\n\nfrequent nosebleeds\n\nshakes, tremors, incoherent or slurred speech, impaired or unstable coordination\n\nsudden weight loss or weight gain.\n\nOther clues\n\nThe following items could also be a sign of addiction:\n\nspoons and syringes\n\nsmall, resealable baggies that could be used to store drugs\n\npipes, plastic bottles, or cans that have been pierced or tampered with\n\nburnt foil\n\nstuff missing, such as money, valuables or prescription drugs.\n\nHow can I help?\nIt can feel daunting to confront a mate about their drug use, but it’s important for friends to help each other. You may feel hurt by things they’ve done, but remember that they probably didn’t intend to hurt you. Addiction drives the best people to make poor decisions.\n\nAcknowledge that your friend might not see their drug use as a problem\n\nWithout an understanding that there’s a problem, there won’t be a solution. Be honest with your friend about what you think the problem is, and make sure they understand that abusing drugs is a serious issue.\n\nTalk to your friend about your concerns\n\nTalk about the negative effects of addiction in terms of something your friend really cares about. They might not be worried about their health or about getting through uni, but they may really care that someone they love is suffering because of their addiction.\n\nBe positive and let your friend know that you’re there for them\n\nHelp them stay focused on positive goals that don’t include drugs. Support and acknowledge the positive things they do and achieve, and don’t abandon your friend when they slip up – it will probably take time for them to turn things around.\n\nAvoid using emotional appeals\n\nDon’t try to guilt-trip them, and don’t preach, bribe or threaten them; this will only upset them and push them away.\n\nWhat if my friend isn’t responding to my help?\nSometimes, even the best efforts to help a friend aren’t enough to make them stop.\n\nFind out about treatment resources that are available\n\nNarcotics Anonymous and SMART Recovery are two self-help recovery programs that offer support from other people recovering from drug addictions, address the factors behind drug abuse and help people regain control of their lives. These websites have tons of information about addiction and getting help. If your friend isn’t willing to go to a support group, try suggesting a confidential telephone service such as DirectLine.\n\nDon’t forget about yourself\n\nWhen someone you care about is trapped in addiction, it affects you, too. Family Drug Help provides support and information to family members and friends of someone with an addiction.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": false,
            "excludeRecursion": false,
            "probability": 100,
            "useProbability": true,
            "displayIndex": 4,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "5": {
            "uid": 5,
            "key": [
                "Body Dysmorphia"
            ],
            "keysecondary": [],
            "comment": "Body Dysmorphia ",
            "content": "Body dysmorphic disorder is a mental health condition in which you can't stop thinking about one or more perceived defects or flaws in your appearance — a flaw that appears minor or can't be seen by others. But you may feel so embarrassed, ashamed and anxious that you may avoid many social situations.\n\nWhen you have body dysmorphic disorder, you intensely focus on your appearance and body image, repeatedly checking the mirror, grooming or seeking reassurance, sometimes for many hours each day. Your perceived flaw and the repetitive behaviors cause you significant distress and impact your ability to function in your daily life.\n\nYou may seek out numerous cosmetic procedures to try to \"fix\" your perceived flaw. Afterward, you may feel temporary satisfaction or a reduction in your distress, but often the anxiety returns and you may resume searching for other ways to fix your perceived flaw.\n\nTreatment of body dysmorphic disorder may include cognitive behavioral therapy and medication.\n\nProducts & Services\nA Book: Mayo Clinic Family Health Book, 5th Edition\nShow more products from Mayo Clinic\nSymptoms\nSigns and symptoms of body dysmorphic disorder include:\n\nBeing extremely preoccupied with a perceived flaw in appearance that to others can't be seen or appears minor\nStrong belief that you have a defect in your appearance that makes you ugly or deformed\nBelief that others take special notice of your appearance in a negative way or mock you\nEngaging in behaviors aimed at fixing or hiding the perceived flaw that are difficult to resist or control, such as frequently checking the mirror, grooming or skin picking\nAttempting to hide perceived flaws with styling, makeup or clothes\nConstantly comparing your appearance with others\nFrequently seeking reassurance about your appearance from others\nHaving perfectionist tendencies\nSeeking cosmetic procedures with little satisfaction\nAvoiding social situations\n\n\nPreoccupation with your appearance and excessive thoughts and repetitive behaviors can be unwanted, difficult to control and so time-consuming that they can cause major distress or problems in your social life, work, school or other areas of functioning.\n\nYou may excessively focus over one or more parts of your body. The bodily feature that you focus on may change over time. The most common features people tend to fixate about include:\n\nFace, such as nose, complexion, wrinkles, acne and other blemishes\nHair, such as appearance, thinning and baldness\nSkin and vein appearance\nBreast size\nMuscle size and tone\nGenitalia\nA preoccupation with your body build being too small or not muscular enough (muscle dysmorphia) occurs almost exclusively in males.\n\nInsight about body dysmorphic disorder varies. You may recognize that your beliefs about your perceived flaws may be excessive or not be true, or think that they probably are true, or be absolutely convinced that they're true. The more convinced you are of your beliefs, the more distress and disruption you may experience in your life.\n\nCauses\nIt's not known specifically what causes body dysmorphic disorder. Like many other mental health conditions, body dysmorphic disorder may result from a combination of issues, such as a family history of the disorder, negative evaluations or experiences about your body or self-image, and abnormal brain function or abnormal levels of the brain chemical called serotonin.\n\nComplications\nComplications that may be caused by or associated with body dysmorphic disorder include, for example:\n\nLow self-esteem\nSocial isolation\nMajor depression or other mood disorders\nSuicidal thoughts or behavior\nAnxiety disorders, including social anxiety disorder (social phobia)\nObsessive-compulsive disorder\nEating disorders\nSubstance misuse\nHealth problems from behaviors such as skin picking\nPhysical pain or risk of disfigurement due to repeated surgical interventions\n\nHow is body dysmorphic disorder treated?\nBody dysmorphic disorder is difficult to treat without professional help. It doesn’t usually get better on its own and can get worse.\n\nIf you have body dysmorphic disorder and other mental health conditions, your doctor and experienced mental health professionals will be able to advise the best course of treatment and therapy to help.\n\nA combination of medication and psychotherapy may be suggested to help treat body dysmorphic disorder, so talk to your doctor if you think you have the condition. Cognitive behavioural therapy (CBT) is the psychotherapy that is used. It is a type of talking therapy. Several sessions may be needed.\n\nChildren with body dysmorphic disorder are usually treated with education about the condition and, depending on their age. If there is no improvement after 12 weeks, medications may be suggested if a child is experiencing moderate to severe problems.\n\nPhysical activity and exercise can help manage accompanying issues, such as depression, stress and anxiety.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": false,
            "excludeRecursion": false,
            "probability": 100,
            "useProbability": true,
            "displayIndex": 5,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "6": {
            "uid": 6,
            "key": [
                "Hypersexuality"
            ],
            "keysecondary": [],
            "comment": "Hypersexuality or Sexual addiction",
            "content": "Verywell / Laura Porter\n\nTable of Contents\nCharacteristics\nCauses\nDiagnosing Hypersexuality\nComplications\nTreatment\nCoping\nHypersexuality is also known as compulsive sexual behavior disorder, or more commonly, sex addiction. When a person has an obsessive fixation on sex, sexual acts, and sexual fantasies, they might be hypersexual.\n\nThis fixation is typically so severe that it might disrupt a person’s daily functioning. Some research shows that up to 3% to 6% of people are living with some form of sexual addiction disorder or related disorders and that this condition predominantly affects men.1\nLaurent K, Aline W, Aviv W, et al. Sexual addiction or hypersexual disorder: different terms for the same problem? A review of the literature. Current Pharmaceutical Design. 2014;20(25):4012-4020. https://doi.org/10.2174/13816128113199990619\n\n\nPeople with hypersexuality might exhibit a host of problematic sexual behaviors like consuming pornographic content excessively, excessive masturbation, or engaging in sexual activities with a large number of partners. The lack of recognition of hypersexuality as a mental disorder has resulted in many people living with the condition without an official diagnosis.\n\nCharacteristics of Hypersexuality\nHypersexuality looks different in every individual who has the condition. While one person might primarily struggle with controlling their sexual fantasies, another might struggle with controlling the urge to carry out certain sexual acts like masturbation, for instance.\n\nSome of the most common characteristics that a hypersexual person includes: \n\nCompulsive sexual behavior \nRecurring and uncontrollable sexual fantasies \nDifficulty establishing and maintaining a relationship with other people, especially a romantic partner because of their preoccupation with sex\nInability to get sexual urges under control \nContinuing to engage in sexual behaviors and activities even after they’ve caused harm \nHypersexuality vs. High Sex Drive\nA high sex drive is an increased sexual desire. On the other hand, hypersexuality involves out-of-control feelings and urges to have sex as well as high-frequency sexual behavior.2\n\nWhat Causes Hypersexuality?\nIt’s unclear as to what exactly causes hypersexuality. Research points out the following as possible causes for the condition: \n\nDeveloping certain conditions: Conditions such as epilepsy are thought to cause damage to some parts of the brain, which in turn could trigger the condition.\nA chemical imbalance in the brain: The brain controls almost all of our daily functioning, including sexual behavior. A chemical imbalance could either cause a complete lack of interest in sexual urges or behaviors or hypersexuality. There’s some evidence to suggest that a dopamine imbalance could trigger the condition.3\nMedication: According to some researchers, hypersexuality could develop as a side effect of certain medications. Dopamine replacement medications, typically used to treat Parkinson’s disease, have been found sometimes to cause hypersexuality.3\nIn addition to probable causes for the condition, certain risk factors could put some people at a higher risk of developing the condition than others. These include drug or alcohol abuse, a family history of mental health conditions, and sexual abuse. \n\nDiagnosing Hypersexuality\nIdentifying hypersexuality can be difficult, as the Diagnostic and Statistical Manual of Mental Disorders (DSM-5), which provides for the diagnosis of several mental health conditions, fails to provide criteria for diagnosing hypersexuality or compulsive sexual behavior.\n\nSome mental health professionals use the diagnostic criteria for conditions such as behavioral addiction to help diagnose hypersexuality. This is because hypersexuality could be considered a form of behavioral addiction or an impulse control disorder. \n\nA lot more research needs to be done on the condition to provide exact criteria for diagnosing hypersexuality. However, when a doctor or mental health professional is assessing whether you're experiencing hypersexuality, they often look for the following:5\n\nDisruption of daily activities: A person's symptoms must interfere with their daily life.\nInability to stop: A person experiencing hypersexuality is unable to control their behavior, even despite their attempts. This remains the case even when there are negative consequences to their behavior.\nDeveloping a tolerance: A hypersexual person feels the need to engage in sexual behaviors in increasing amounts over time to fulfill their urges.\nWithdrawal symptoms: A person who is hypersexual will feel nervous and restless if they don't engage in sexual behaviors.\nLoss of pleasure: One indicator of someone who is hypersexual is that sexual acts don't necessarily bring them pleasure anymore—but they still have the uncontrollable urges to engage in them.\nComplications of Hypersexuality\nThere are potential negative effects of hypersexuality that may impact your physical and emotional health. They include:6\n\nFeelings of guilt or shame\nIncreased risk of contracting a sexually transmitted infection\nIncreased risk of using drugs or alcohol\nLegal repercussions such as being arrested for a sexual offense\nMental health conditions like depression or anxiety\nStrain on finances\nStrain on relationships\nStruggling at work\nSuicidal ideation\n\nTreatment for Hypersexuality\nLike with many other mental health conditions, hypersexuality is most commonly treated with a combination of medications and psychotherapy. \n\nMedications \nOne of the likely causes of hypersexuality is a chemical imbalance in the brain. Medications can help with this and help alleviate symptoms of the condition. Medications often prescribed to help with hypersexuality include: \n\nMood stabilizers: Mood stabilizers like Lithobid, Depakote, and Depakene are typically used to treat bipolar disorder. However, some research shows that they could help reduce sexual urges in people who have hypersexuality.7\nAntidepressants: In certain cases, hypersexuality might be brought on by other mental health conditions like depression. Treating the condition triggering hypersexuality could also help control sexual urges and behaviors. SSRIs, in particular, have been prescribed and proven to help people with hypersexuality.8\nVivitrol: Vivitrol is typically used to treat alcohol and opiate dependence. It could also be used to treat conditions like hypersexuality which is considered to be a behavioral addiction9\nPsychotherapy\nPsychotherapy provides a person living with hypersexuality with the tools they need to manage their condition. The most common form of psychotherapy used in treating this condition include: \n\nPsychodynamic psychotherapy: The focus of this form of therapy is to make you increasingly aware of your unconscious thoughts and behaviors and what triggers them. \nCognitive-behavioral therapy (CBT): This is a common form of psychotherapy used in treating many mental health conditions. CBT focuses on helping you identify negative thoughts and behaviors and helps you replace them with positive ones.\n\nCoping With Hypersexuality\nMany people with hypersexuality report feeling a deep sense of shame or embarrassment. Like with any other mental condition, the right treatment and coping strategies can help you live a healthy life and keep your urges under control.\n\nThere’s no reason to feel shame or embarrassment about having a sex addiction. It’s important to set those emotions aside and focus on getting the help you need.\n\nHere are some tips to keep in mind besides the treatment plan a doctor or mental health professional has given you:\n\nStick to your treatment plan strictly to see progress. Don’t suddenly stop treatment because you think you are starting to feel better. This might cause a more severe relapse. If you are on medication consult your doctor before changing or stopping your dose. If you are in therapy, continue going for therapy sessions consistently. \nDon’t be ashamed to reach out for help. The sooner you seek help and treatment for your condition, the sooner you get on your path to recovery. Keeping your condition under wrap from friends, family, and your doctor can be damaging and cause the condition to further interfere with your daily functioning.\nJoin a support group. Joining a support group with other people with the condition helps you to remember that you are not alone. You also get to learn better coping strategies from people who might have struggled with the condition for longer than you have. \nRemove yourself from triggering situations. On your path to recovery, it’s important to avoid activities and situations that could set you back. For instance, many mental health professionals heavily discourage people with hypersexuality from consuming any pornographic content. \n\n\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": false,
            "excludeRecursion": false,
            "probability": 100,
            "useProbability": true,
            "displayIndex": 6,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "7": {
            "uid": 7,
            "key": [
                "Porn Addiction"
            ],
            "keysecondary": [],
            "comment": "Porn Addiction",
            "content": "Porn addiction refers to an emotional dependence on pornography that interferes with daily life, relationships, and the ability to function. A person may become dissatisfied with their own sex life or engage in risky behaviors, such as using porn at work.\n\nSigns of pornography addiction\nThe diagnosis of pornography addiction is controversial, and not all therapists will acknowledge it. Moreover, researchers have presented various different models of the signs.\n\nSome healthcare professionals and counselors believe that pornography in itself is not problematic, but that it has the potential to become so, depending on the person’s viewpoint or their partner’s.\n\nSome indications that pornography may be causing a problem include:\n\nA person’s sex life becomes less satisfying.\nPornography causes relationship issues or makes a person feel less satisfied with their partner.\nA person engages in risky behavior to view pornography, such as doing so at work.\nSome other signs that a person may be developing an unhealthy relationship with porn include:\n\nThey ignore other responsibilities to view pornography.\nThey view progressively more extreme pornography to get the same release that less extreme porn once offered.\nThey feel frustrated or ashamed after viewing porn but continue to do so.\nThey want to stop using pornography but feel unable to do so.\nThey spend large sums of money on pornography, possibly at the expense of daily or family necessities.\nThey use pornography to cope with sadness, anxiety, insomnia, or other mental health issues.\n\nWhat the research says\nA 2017 studyTrusted Source of males who sought treatment for problematic pornography use (PPU) found changes in the participants’ brains that were consistent with addiction. The researchers found that the brains of the men with PPU reacted differently to erotic images — or the anticipation of them — than the brains of men without PPU.\n\nUse of pornography may also affect people’s relationships. For example, some research indicates that pornography creates unrealistic expectations of sex.\n\nA 2013 studyTrusted Source found that among heterosexual male participants in couples, the use of pornography was associated with less sexual satisfaction, while the opposite was true for the female participants — pornography was associated with greater sexual satisfaction.\n\nAccessing pornography is easy, and it can require significantly less effort than interacting with a partner. For some, this can contribute to an unhealthy cycle in which porn causes problems in a relationship, leading the person to rely even more heavily on pornography to achieve sexual satisfaction and escape the relationship issues.\n\nNot all research supports the notion that pornography is addictive. A 2014 study emphasizes that many studies of pornography addiction have been poorly designed or biased. The authors caution that little evidence supports a causal relationship between pornography use and its purported harmful effects.\n\nA 2015 study found that, among participants who reported excessive or problematic viewing of visual sexual stimuli, the usual brain pathways of addiction were absent.\n\nIn standard addictions, the brain shows increased activity when exposed to the addictive substance, but the participants in question instead demonstrated decreased brain activity when looking at the stimuli. This suggests that the typical addiction model may not apply.\n\nThe American Association of Sexuality Educators, Counselors, and Therapists (AASECT) argue that there is little evidence of either sex or pornography being addictive and that the idea of pornography addiction is rooted in outdated and potentially harmful cultural norms.\n\nIt is important to note that some people who claim that pornography is addictive may oppose its existence altogether or have very rigid ideas about healthy sexuality. For example, they may believe that a monogamous heterosexual relationship is the only appropriate sexual outlet.\n\n\nCauses of pornography addiction\nDue to the controversy surrounding the idea of pornography addiction, researchers have yet to identify a clear set of causes.\n\nA 2015 study found that believing oneself to be addicted to pornography, not actual pornography use, was the more significant cause of associated distress.\n\nThis suggests that the very idea that porn addiction exists could be a major cause of the anxiety that some people experience when viewing porn.\n\nMeanwhile, experts and advocates who endorse the existence of pornography addiction argue that, like other addictions, this is a complex issue with a range of possible causes. Some of these causes may include:\n\nUnderlying mental health conditions: A person might use pornography to escape psychological distress.\nRelationship problems: Pornography can be an outlet for sexual dissatisfaction.\nUnhealthy cultural norms: Ideas about how people should look and behave during sex, the types of sex that a person should enjoy, and similar norms may draw some people to pornography.\nBiological causes: Certain biological factors, including changes in brain chemistry when a person views porn, may increase the risk of addiction.\nTreatments and natural remedies\nResearch does not support any specific treatment for pornography addiction.\n\nIndeed, because many researchers do not believe that pornography addiction is a real medical condition, some doctors and counselors may feel that no treatment is necessary.\n\nSome people seeking treatment for pornography addiction may instead benefit from addressing other issues, such as relationship problems, sexual shame, or depression. Therefore, if a person opts for therapy, it is important to choose a therapist who understands and can manage these issues.\n\nSome treatment strategies may involve:\n\nPsychotherapy: This can help a person understand their relationship with porn, identify unmet sexual needs, and develop strategies for dealing with psychological distress.\nRelationship counseling: Couples’ counseling can help partners talk about their values, determine whether porn has a place in their relationship, and cultivate deeper trust.\nMedication: Sometimes a person uses pornography to cope with another condition. Medication may help treat the underlying issue.\nLifestyle changes: Some people use pornography out of boredom or exhaustion. A more healthful lifestyle may involve spending fewer hours on the computer.\nWhen to see a doctor or therapist\nA person should see a doctor if:\n\nThey have trouble orgasming from sex with a partner.\nThey experience an increase in sexual dysfunction, such as trouble maintaining an erection or lubricating before sex.\nSex becomes painful.\nThey experience, or have experienced, other addictions.\nThey experience symptoms of anxiety, depression, insomnia, or another mental health condition.\nA therapist may be able to help with pornography addiction and other sex and relationship issues. It may be a good idea to see a therapist if:\n\nPornography causes relationship problems.\nA person feels guilty about their pornography use.\nA person wants to cut down on their pornography use but feels unable to do so.\nTherapists hold varying views on pornography — some may believe that all pornography use is harmful, while others may think that it is never addictive.\n\nAnyone seeking treatment should choose a therapist whose values align with their own. Interview the therapist about their beliefs and philosophy before committing to treatment.\n\nAASECT offer a list of certified sex therapists and counselors who endorse sex-positive treatment and research-based support.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": false,
            "excludeRecursion": false,
            "probability": 100,
            "useProbability": true,
            "displayIndex": 7,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "8": {
            "uid": 8,
            "key": [
                "Abandonment issues"
            ],
            "keysecondary": [],
            "comment": "Abandonment issues",
            "content": "What Are Abandonment Issues?\nAbandonment issues stem from a fear of loneliness, which can be a phobia or a form of anxiety. These issues can affect your relationships and often stem from a childhood loss. Other factors that turn loss into abandonment issues include environmental and medical factors, genetics, and brain chemistry. \n\nEarly childhood experiences are the biggest contributor to developing abandonment issues when you become an adult. The traumatic event might include the loss of a parent by divorce or death or not getting enough physical or emotional care as a child. Emotional abandonment occurs when parents:\n\nDo not let their children express themselves emotionally\nRidicule their children\nPut too much pressure on their children to be “perfect”\nTreat their children like their peers\nAbandonment issues happen when a parent or caregiver does not provide the child with consistent warm or attentive interactions, leaving them feeling chronic stress and fear. The experiences that happen during a child’s development will often continue into adulthood. This is why abandonment issues become more prevalent as you get older and can affect your relationships.\n\nTypes of Abandonment Issues\nAbandonment issues can present themselves in three insecure attachment styles. These are: \n\nAvoidant Attachment Style\nPeople who follow this style don’t allow anyone to get close to them. You may feel like you can’t open up or trust others, making you appear distant, private, or withdrawn. \n\nAnxious Attachment Style\n\nPeople with this type of attachment style cope by developing intensely close and dependent relationships with others. You may feel anxious about separating yourself from your partner and tend to be emotionally reactive. It may be easy to see conflicts as a concern that your partner may leave, which makes you act out of fear. \n\nDisorganized Attachment Style\n\nPeople with this attachment style have difficulty remaining intimate and close but can also be inconsistent. You may feel anxious about being in a relationship or want to avoid the closeness. This attachment style may come with other potential disorders. \n\nSigns of Abandonment Issues\nAbandonment issues don’t always come from childhood trauma. They can also develop after losing an intimate partner to divorce or death. Either through adult or childhood abandonment, these issues can negatively impact healthy relationships.\n\nA fear of abandonment presents itself in people who seem like “people pleasers” or need continuous reassurance that they are loved. There is also a consistent anxiety that occurs with abandonment issues. \n\nCommon signs of abandonment issues include:\n\nGiving too much or being overly eager to please\nJealousy in your relationship or of others\nTrouble trusting your partner’s intentions\nFeeling insecure about your relationship\nHaving difficulty in feeling intimate emotionally\nNeeding to control or be controlled by your partner\nSettling in unsatisfactory relationships\nIt is not uncommon for you to want your partners to treat you the same way as you were treated as a child. \n\nTreating Abandonment Issues\nWhen treating abandonment issues, the first step is understanding what triggers you and learning to withdraw when these triggers come up. You should also try to get more comfortable with having conversations about your fears in a calm and respectful manner. It may help to do this with a partner, family member, or close friend. It may be difficult at first, but you will find it gets easier with time.\n\nTherapy\n\nIn therapy, you will be able to explore the root cause of your fears and identify negative thought patterns. Your therapist will help you replace them with healthy, more realistic thoughts. Your relationship with your therapist can also give you the sense of having a secure relationship. Working with them, you can learn to establish healthy boundaries in your relationships and help avoid behaviors that hinder healthy relationships. \n\nSelf-care\n\nPracticing self-care can help you make sure your emotional needs are met. This can improve friendships and relationships. Doing self-care like journaling, taking walks, and other things you enjoy can help fulfill you and improve your contributions to your partner, friends, or children.\n\nSupport and Resources\nAbandonment issues can develop because of many emotional and environmental factors. If you are experiencing fear of abandonment in your relationships, it may be helpful to see a counselor. A counselor will be able to talk to you about how you’re feeling and develop a treatment plan. \n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "addMemo": true,
            "order": 100,
            "position": 0,
            "disable": false,
            "excludeRecursion": false,
            "probability": 100,
            "useProbability": true,
            "displayIndex": 8,
            "depth": 4,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        }
    },
    "originalData": {
        "entries": [
            {
                "id": 0,
                "keys": [
                    "Anxiety"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "What does anxiety feel like?\nAnxiety can cause you to feel lots of different things in your mind and body, including:\n\nIn the mind\nfeeling worried all the time\nfeeling tired or sleeping badly\nbeing unable to concentrate\nfeeling irritable or depressed\nfeeling uneasy or tense\nfeeling overwhelmed\nfeeling afraid that something awful might happen.\nIn the body\nfast or irregular heartbeat (palpitations)\nsweating\na dry mouth\nmuscle tension and pain\nheadaches\ntrembling/shakiness\nnumbness or tingling in the fingers, toes or lips\nbreathing fast\nfeeling dizzy or faint\nstomach problems like indigestion, cramps or feeling sick\ngoing to the toilet a lot\nfeeling a lot of anxiety related to these physical sensations.\nSometimes, people with anxiety worry that their symptoms are a sign of physical illness. This can make their anxiety even worse.\n\nMost people experience anxiety from time to time without it becoming a problem. Here are some things to look out for if you think someone you know might be experiencing higher levels of anxiety than usual:\n\nThey seem to be worrying about something, or lots of things, to a level that doesn’t seem rational.\nThey avoid situations or environments that they didn’t avoid in the past. For example, going to parties, out for dinner or to crowded places.\nThey complain of physical symptoms like headaches, stomach aches or tiredness.\nThey seem upset, angry or frustrated for no obvious reason.\nThey cancel plans, or don’t do things they say they will.\nThey seem distracted or unable to listen when you are talking to them.\nDifferent people experience and communicate anxiety in different ways, depending on their life experiences, cultural or religious background, and their primary language. This might mean that someone’s anxiety isn’t immediately obvious to you.\n\n\nSupporting someone with anxiety can be challenging, especially if you are not an anxious person yourself. Here are some things you can do to help:\n\nListen - Being there to listen to someone struggling with their anxiety can be a huge support. Sometimes just sharing anxious feelings with another person can help to ease their anxiety.\nBe patient - Try to be patient if the person you know finds it difficult to stick to plans you’ve made, or seems irritable or distracted. It's important not to take it personally.\nTake them seriously - Even if someone is anxious about things that don’t seem rational to you, the way they are feeling will be very real to them. You don’t have to encourage their anxious thoughts, but you can reassure them that their feelings are valid and that they deserve support.\nIf you know someone who is struggling with their anxiety, encourage them to seek help, whether that means supporting themselves, or getting help from a professional.\n\n",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 0,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 1,
                "keys": [
                    "Depression"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Everyone has times in their lives when they feel fed up or miserable. It is usually for a particular reason, does not interfere too much with daily life and does not usually last longer than a week or two.\n\nHowever, if these feelings go on for weeks or months, or become so bad they start to affect every area of your life, you may have depression and need to get help.\n\nWhat are the signs of depression?\nPeople experience different levels of depression in different ways. There are mild, moderate or severe levels of depression.1\n\nPeople’s experience of depression is also influenced by their cultural background and by their personal values, beliefs and language.\n\nIf you are depressed, you will probably notice some of the following:1 2\n\nIn your mind, you:\n\nfeel unhappy, miserable, down, depressed – this feeling just won’t go away and can be worse at a particular time of day, often first thing in the morning\ncan’t enjoy anything\nlose interest in seeing people and lose touch with friends\ncan’t concentrate properly and find it harder to make decisions\nlose your self-confidence\nfeel guilty and unworthy\nbecome pessimistic\nstart to feel hopeless, and perhaps even suicidal.\nIn your body, you may find that you:\n\nfeel restless, nervous or agitated\nfeel exhausted and have no energy\ncan’t get to sleep or sleep too much\nwake early in the morning and/or throughout the night\nhave a headache or stomach upset\nlose interest in sex\ncan’t eat and lose weight or 'comfort eat' more and put on weight.\nOther people may notice that you:\n\nmake mistakes at work or can't focus \nseem unusually quiet and withdrawn, or are avoiding people\nworry about things more than usual\nare more irritable than usual\nare sleeping more or less than usual\ncomplain about vague physical problems\nstop looking after yourself properly – you don't wash your hair or your clothes\nstop looking after your home properly – you stop cooking, don't tidy or forget to change the sheets on your bed.\nMost people will not experience all of these, and some people may only be aware of physical symptoms. You may think that you have a physical illness because you feel very tired or have problems with sleep, but physical symptoms like these can be the first sign of depression.1 2\n\nYou may not realise how depressed you are, especially if it has come on gradually. Sometimes people try to struggle on and may even start to blame themselves for being lazy or lacking willpower.\n\nIt sometimes takes a friend or a partner to persuade you that there really is a problem and suggest that you seek help.\n\nYou may need to seek help if you or a friend or partner notice that:\n\nYour feelings of depression affect your work, interests and feelings towards your family and friends\nYour feelings of depression have been going on for a while and don't seem to get any better\nYou find yourself feeling that life is not worth living, or that other people would be better off without you.\n\nHow can I help myself?\nThese are some suggestions you can try when you are feeling depressed. It is important that you find what works best for you and create your own list of helpful strategies.\n\nTalk to someone: If you’ve had some bad news or a major upset in your life, try not to bottle things up. It can help to tell someone close to you how you feel about it. If you don't feel you can talk to anyone, try writing down how you feel.\n\nKeep active: If you are able to, get outside for some exercise, even if it’s only for a short walk. This will help to keep you physically fit and sleep better. It can also help you to focus on other things and not on painful thoughts and feelings.\n\nEat properly: You may not feel very hungry, but try to eat regularly. It’s easy to lose weight and run low on vitamins when you are depressed – or to eat too much junk food and put on weight you don't want. A balanced diet, with lots of fruit and vegetables, can help keep your body and mind healthy.\n\nAvoid alcohol and drugs: Alcohol can make you feel better for a couple of hours, but it actually makes depression worse in the long run. The same goes for street drugs, particularly cannabis, amphetamines, cocaine and ecstasy.\n\nCreate a sleep routine: Try to go to bed at the same time each night and get up at the same time each morning. Do something restful that you enjoy before going to bed, like listening to relaxing music or reading a book. If you can’t sleep, get out of bed and do something calming like sitting quietly on the couch. For more information about sleep, see our leaflet on sleeping well.\n\nTry relaxing activities: If you feel tense all the time, try relaxation exercises, yoga, massage, aromatherapy, or another activity you find relaxing.\n\nDo something you enjoy: Take some regular time to do something you really enjoy – like playing a game, reading, or another hobby.\n\nRead about depression: There are many books and websites about depression. They can help you to understand what is going on, give you strategies to cope better, and can also help friends and relatives to understand what you are going through.\n\nPractice self-kindness: You may be a perfectionist who drives yourself too hard. Try to set yourself more realistic goals or expectations. Be kinder to yourself.\n\nTake a break: It can be really helpful to get away and out of your normal routine for a few days. Give yourself a break from your daily stress and worries. If you can change your environment, even for a few hours, it can help.\n\nJoin a support group: It can be hard to help yourself when you're depressed. Talking with other people in a similar situation can help. Have a look at the list of organisations at the end of this leaflet for some ideas.\n\nKeep hopeful: Remind yourself that many other people have had depression and have got better – there is help out there and you are entitled to the help you need to feel better.\n\nA small number of people with depression may attempt or die by suicide.35 36\n\nIf you are concerned about someone then it’s important to talk to them about suicidal thoughts and feelings and to take them seriously.  \n\nAsking someone if they are feeling suicidal will not put the idea into their head or make it more likely that they will act on their thoughts.37 38\n\nIf you are still worried about someone, you can contact one of the services below for more support and advice.\n\nThe Zero Suicide Alliance provides free online training around suicide awareness and prevention, providing a starting place for people who want to support someone they are worried about.\n\nHow can I help someone who is depressed?\nListen. This can be harder than it sounds. You may have to hear the same thing over and over again. It's usually best not to offer advice unless it's asked for, even if the answer seems perfectly clear to you. If depression has been brought on by a particular problem, you may be able to help find a solution or at least a way of tackling the difficulty.\nSpend time with them. It's helpful just to spend time with someone who is depressed. Letting them know you are there for them can help encourage them to talk and keep going with doing things to feel better.\nReassure them. Someone who is depressed will find it hard to believe that they can ever get better. You can reassure them that they will get better, but you may have to repeat this over and over again.\nSupport their self-care. Make sure that they are buying enough food and eating regularly, with a good amount of fruit and vegetables in their diet. You may be able to help them to get out and do some exercise or other enjoyable activities, which can be a better alternative than using alcohol or drugs to cope with their feelings.\nTake them seriously. If they are getting worse and start to talk of not wanting to live or even hinting at harming themselves, take them seriously. Make sure that they tell their doctor.\nEncourage them to accept help. Encourage them to see their doctor, take their medication, or talk to their therapist or counsellor. If they are concerned about their treatment, encourage them to discuss these with their doctor.\nLook after yourself. It can be emotionally draining to support someone who feels depressed, so make sure you look after your own mental health and wellbeing.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 1,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 2,
                "keys": [
                    "Bipolar"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "What is bipolar disorder?\nIt used to be called ‘manic depressive illness’. As this phrase suggests, you have severe mood swings. These usually last several weeks or months and are far beyond the emotional ups and downs that most of us experience. They can be:1\n\nLow or 'depressive'\tYou feel intensely low, depressed and even despairing.\nHigh or 'manic'\tYou feel extremely happy, elated, and become very overactive. You may develop very grandiose, delusional ideas about yourself and your abilities.\nHypomanic\tYour mood is high, but not so extreme as in mania\nMixed\tYou have a mixture of mania and depression – for example, you feel very depressed, but also have the restlessness and overactivity of mania.\n\n",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 2,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 3,
                "keys": [
                    "ADHD"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Attention deficit hyperactivity disorder (ADHD) is a diagnosis given to people who have challenges with:\n\ninattention - finding it hard to concentrate\nhyperactivity - feeling restless and struggling to sit still\nimpulsivity - saying or doing things without thinking about the consequences first.\nMost people experience these challenges at some point in their lives, or in certain situations. For example, someone might struggle to concentrate the following day if they’ve had a bad night’s sleep.\n\nHowever, for people with ADHD, these challenges usually begin in childhood and for most people they continue as they grow up, though they may change or improve. These challenges will also affect someone in many areas of their life.\n\n“For me, reading a book can feel like a carousel ride with the book held by someone in the crowd. Tasks can feel like a car journey where my impatient self is in control of the pedals, but my curious self is holding the wheel.” - A person with ADHD\n\nHow can I support someone I know who has ADHD?\nIf you know someone who has ADHD, there are a number of things you can do to make life easier for them, and yourself.\n\n1. Learn about the condition\nJust because you’ve met one person with ADHD doesn’t mean you’ve met them all. Finding out more about the condition can help you to get a stronger understanding of ADHD. It will also show the person that you care about them.\n\n“It's exhausting, variable and infuriating multiple times a day. It can impact every aspect of your life and a lot of that is hidden, especially with the mental load of women juggling home, work, family. People have no idea.” - Margaret\n2. Join a peer support group\nSome adult ADHD peer support groups run separate groups for partners and spouses, or allow them to participate in the ADHD groups. Check with the group first before attending. You will usually be able to find out more about a peer support group online.\n\n3. Speak to the person you know\nAsk the person you know if there is anything you can do to help. If they can’t think of anything right now, you can let them know you are there if they need someone to talk with in the future.\n\n4. Be aware of stigma\nThere are a lot of misconceptions about ADHD and the people who have it. You can help by informing yourself and other people about the realities of ADHD.\n\n5. Manage your frustrations\nIf you find the behaviour of the person you know upsetting or frustrating, talk through your feelings with someone you trust. If there are problems you want to bring up, try to explain clearly what the issue is and what you think could help. There may be things that both of you can do to help solve the issue.\n\n“Sometimes when we talk about disability, we make assumptions that it’s got to be something visible. And when you have ADHD it’s not so visible, and people just put it down to your personality.” - Hameed",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 3,
                    "probability": 100,
                    "useProbability": true
                }
            }
        ],
        "name": "Mental Health"
    }
}