{
    "name": "Rapture",
    "description": "",
    "is_creation": false,
    "scan_depth": 2,
    "token_budget": 512,
    "recursive_scanning": false,
    "extensions": {
        "chub": {
            "expressions": null,
            "alt_expressions": null,
            "id": 2538283,
            "full_path": "lorebooks/Swampboi/rapture-a07df8246c50",
            "related_lorebooks": [],
            "background_image": "",
            "preset": null,
            "extensions": []
        }
    },
    "entries": {
        "1": {
            "uid": 1,
            "key": [
                "Rapture"
            ],
            "keysecondary": [],
            "comment": "Rapture",
            "content": "Rapture (also known as the North Atlantic Project or simply the Rapture Colony) is a massive underwater city forged from the childhood dreams of Andrew Ryan, a wealthy industrialist, meant to serve as an escape from the political, social and religious constraints of a reeling post-World War II world. It was first established on November 5, 1946, and construction of the city itself was finished in late 1951.\nAndrew Ryan named his city after the goal he set to achieve: to create a paradise free from the influence of those he deemed \"Parasites\"; a place of true rapture where a man could pursue his own ambitions and, by the sweat of his brow, find success.\nThe original goal of Rapture was to create a laissez-faire society, free of religious and government interference of any kind, where any citizen could prosper for their own gain, without being hindered by the needs of others. The \"world’s best and brightest\" would be granted freedom of will and choice in Rapture, unrestrained by government, religion and other such established institutions. Instead of abiding by the traditions and moral systems imposed by those institutions, values such as ambition, scientific reason, and free thought were to guide the inhabitants in their pursuit of achievement.\nThis would-be utopia had its flaws. In Rapture's purely capitalistic society, there were no public services; everything within the city was privately owned and hence came at a price. This included the city's food, healthcare, sanitation, and even its oxygen supply. Even police and fire departments were subscription-based private companies such as Poppadopolis Police Department and Fontaine Fire Fighters. With no restrictions on businesses and labor, there was nothing but competition and customer's choice. This allowed many industries to flourish at first, but also led to unscrupulous, dangerous business practices.\n\nThis system alienated Rapture's less fortunate citizens, who, as their situation deteriorated, began to resent Ryan's society as cold-hearted and elitist. Andrew Ryan's hostility and growing paranoia towards \"Parasites\", and others he suspected of undermining his vision, kicked into motion a chain of events that would ultimately lead to his downfall and the utter ruin of his city.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Rapture"
            ],
            "id": 1,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Rapture",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "2": {
            "uid": 2,
            "key": [
                "Fontaine Futuristics"
            ],
            "keysecondary": [],
            "comment": "Fontaine Futuristics",
            "content": "Fontaine Futuristics was a business conglomerate run and owned by Frank Fontaine, and one of the largest companies dealing with genetic enhancements and electronic systems in Rapture. It was the heart of biotechnology in the city, but also oversaw various other business endeavors owned by Fontaine. It was nationalized by Andrew Ryan after Fontaine's \"death\", much to the chagrin of council member Bill McDonagh, and inciting civil unrest. It was also one of the factors that led to the Rapture Civil War.\nFontaine funded Brigid Tenenbaum's research of ADAM after her discovery of the substance being produced by a Sea Slug. With the profit generated by his illegal smuggling operation using Fontaine Fisheries as a front, he created Fontaine Futuristics to carry on her work, with the addition of the genius biologist Yi Suchong. To this was added several other operations such as the Little Sister's Orphanages, used to acquire girls to produce more ADAM, but also the facilities to make them Little Sisters.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Fontaine Futuristics"
            ],
            "id": 2,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Fountain Futuristics ",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "3": {
            "uid": 3,
            "key": [
                "ADAM"
            ],
            "keysecondary": [],
            "comment": "ADAM",
            "content": "ADAM is a volatile genetic substance that has the ability to rewrite genetic material, allowing the user to alter their body, their genetic makeup and their natural abilities without any direct limits whatsoever aside from their imagination. ADAM does this by supporting the formation of potent stem cells that have the ability to differentiate into any cell type, including a variety of unnatural ones. This type of cell formation, however, is also often compared to a benign form of cancer, as the chemical slowly destroys native tissue cells and replaces them with unstable stem versions.\nADAM is extremely addictive, as the stem cells are unstable by nature and require the user to consume more ADAM to keep the stem cells stable in order to remain sane and healthy. Unfortunately, consuming more ADAM also leads to the creation of more stem cells which forces the user to consume even more ADAM, leading to progressively bigger doses of ADAM being required to maintain stability, with every subsequent dose being bigger than the last, creating a rapidly escalating feedback loop. If the ADAM user fails to consume enough ADAM in a given time, the resulting withdrawal symptoms, caused by the instability of the stem cells, will drive them insane and deform their bodies. Though it was possible to indulge in Plasmids without becoming dependent, ADAM's growing importance in Rapture daily life and the stimulant effect it had on the mind almost invariably led users to abuse it.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "ADAM"
            ],
            "id": 3,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "ADAM",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "4": {
            "uid": 4,
            "key": [
                "EVE"
            ],
            "keysecondary": [],
            "comment": "EVE",
            "content": "EVE is the genetic substance which powers the use of Plasmids. In its liquid form, it glows bright blue and can be seen in the dark.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "EVE"
            ],
            "id": 4,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "EVE",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "5": {
            "uid": 5,
            "key": [
                "Plasmid",
                "plasmids"
            ],
            "keysecondary": [],
            "comment": "Plasmid",
            "content": "Plasmids are special serums made from processed ADAM that introduce modified stem cells into the body, allowing for genetic modification and mutation, giving the user what some might call \"super powers\". Active Plasmids require EVE for use, while passive Plasmids, called Gene Tonics, provide an effect merely by being equipped. Plasmids are powerful, but excessive use of them leads to physical and mental addiction and instability. This was a major factor in the eventual downfall of Rapture society.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Plasmid",
                "plasmids"
            ],
            "id": 5,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Plasmid",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "6": {
            "uid": 6,
            "key": [
                "White King",
                "Ryan",
                "Andrew Ryan"
            ],
            "keysecondary": [],
            "comment": "White King",
            "content": "Andrew Ryan (born Андрей Ряновский) is the founder of Rapture and the owner of Ryan Industries. He is the main antagonist throughout most of BioShock. He is the Chairman of the Rapture City Council, owner and operator of Hephaestus, and one of the most important men in the city. \nRyan's response was to use his entire fortune to build Rapture; a community where \"the artist would not fear the censor, where the scientist would not be bound by petty morality, where the great would not be constrained by the small,\" in the only place he felt the \"Parasites\" could not touch—the depths of the Atlantic Ocean. Ryan personally chose the location of Rapture from his ship, \"The Olympian.\"He created shield companies on the surface like Warden Yarn (an anagram of his name), and through it conducted business with suppliers, such as Orrin Lutwidge's Scarlet Sovereign Import and Export, to purchase materials necessary to build his city. When Rapture was completed, Ryan filled it with thousands of the world's best and brightest individuals.\nFor a time, Rapture was everything Ryan dreamed it would be: a paradise of freedom and prosperity. From 1946 to 1958, Rapture experienced tremendous economic progress, and solid political stability. As Ryan predicted, citizens in Rapture created a culture of entrepreneurship that was unrivaled, with numerous businesses established and unprecedented scientific advancements, including the discovery of ADAM by Brigid Tenenbaum. The full ramifications of the Plasmid technology were not immediately appreciated by the people of Rapture or Ryan who dismissed the concerns of men like Rosenberg and Bill McDonagh. Ryan's failure to understand the effects of the burgeoning ADAM-based culture allowed the destructive rise of the fishery owner, smuggler, and black market operative Frank Fontaine.\nWith Rapture at its apogee, Ryan's greatest supporters maintained control of many sectors of the city, such as Sander Cohen in Fort Frolic and J.S. Steinman in the Medical Pavilion. Ryan had hired a man named Carlson Fiddle to build Ryan Amusements: a theme park that doubled as a propaganda tool for the children of Rapture, with Ryan himself providing narration for many of the rides and animatronic set pieces. Its primary purpose was to warn of the evils of the Surface. The theme park eventually embraced the city's new ADAM-culture, exalting Plasmids like Incinerate! in a Hall of the Future section of the park.\nBy populating a city with ambitious experts, opportunists, geniuses, and breakthrough artists, Ryan set up a top-heavy class system. The social conditions resulting from the economic readjustments allowed Frank Fontaine to establish the influential but philosophically-undermining Fontaine's Home for the Poor. Later, these poorhouses were used by Atlas to rise to political power and to openly challenge Andrew Ryan's leadership.\nRyan faced challenges in other sectors as well. A seemingly benign psychologist named Sofia Lamb (whom Ryan had invited to Rapture to help citizens cope with psychological issues stemming from the isolated and sunless environment) began to speak out openly against Rapture's philosophy. Lamb espoused a collectivist, altruist philosophy that directly opposed Rapture's ideological founding. Ryan engaged Lamb in debates on various topics to win back public support, but the people present were usually in Lamb's favor. Lamb's followers represented a threat to his city, and Ryan eventually sought to neutralize them by having Lamb incarcerated at Persephone Penal Colony for sedition.\nEarlier, to keep Rapture safely hidden from the \"Parasites,\" Ryan forbade unauthorized contact with the Surface. Intending for this to be his only law, Ryan inadvertently accelerated the black market for smuggled goods, which assisted the rise of Frank Fontaine's criminal enterprises. This atmosphere set the stage for a divisive civil war and Rapture's decline.\nFontaine's illegal profits enabled his businesses to expand, placing him in a good position to fund and exploit the new ADAM industry. At first Ryan had no issue with the rapid growth of Fontaine Futuristics, even as his own associates tried to convince him to get involved in the genetic market and others complained about Fontaine's business practices. Sensing that \"the Great Chain was pulling away from [him],\" Ryan finally realized Fontaine was behind some form of illegal activity, which soon revealed itself to be the huge smuggling operation, and began to take steps to curb his influence. To get legal proof of Fontaine's smuggling, Ryan ordered investigations into Fontaine and his men. These efforts eventually were successful in destroying the smuggling operation, but Fontaine for a long time remained elusive, always managing to be \"where the evidence isn't.\" The frustration of this situation affected Ryan deeply, causing him to use questionable methods to catch the criminals. Despite considerable uproar, Ryan implemented a highly unpopular law, with smuggling being the equivalent of treason and made the crime punishable by death.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "White King",
                "Ryan",
                "Andrew Ryan"
            ],
            "id": 6,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Andrew Ryan",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "7": {
            "uid": 7,
            "key": [
                "Frank",
                "Fontaine",
                "Frank Fontaine",
                "Atlus"
            ],
            "keysecondary": [],
            "comment": "Frank",
            "content": "When Ryan nationalized Fontaine Futuristics, Atlas protested against him in front of numerous citizens.With Frank Fontaine declared dead by the Rapture Council, Atlas used the poor houses left behind by the “collapse” of Fontaine’s Empire (such as Fontaine's Home for the Poor) to recruit disillusioned citizens and build up his power base against Ryan. Making Hestia Chambers in Apollo Square their headquarters, Atlas' followers gathered weapons, Plasmids, and Gene Tonics to arm themselves in preparation for the inevitable. This did not go unnoticed by Ryan, who had Atlas and some of his closest followers arrested and sent to Fontaine's Department Store, which had been converted into a makeshift prison to house the remainder of Fontaine's army of Splicers. Ryan hoped that this would put an end to the tension that had been brewing within Rapture, but Atlas managed escaped on New Year's Eve, bringing with him numerous Splicers whom he had gained as allies while imprisoned. The action which officially started the Rapture Civil War was the 1958 New Year's Eve Riots, and the terrorist bombing of the party at the Kashmir Restaurant, where many of the most important and wealthy individuals in Rapture had gathered for a masquerade ball.\nAs the conflict escalated through 1959, more people joined Atlas' cause, including Ryan's ex-lover Diane McClintock. Raiding parties attacked Big Daddies to kill Little Sisters for their ADAM, seized weapons, caused many casualties, and disrupted Rapture's economy.The rebels overall goal was to topple Ryan, take power and gain total control over Rapture.\n\nTo contain the rebels, Ryan gave orders to isolate Atlas' supporters in Apollo Square, transforming the district into a prison enclosed by a large gate defended by his own forces. The Rapture Council had agreed to introduce the death penalty in Rapture for smuggling, which caused some people in Ryan's ranks to reconsider their support for him, including Security Chief Sullivan.\n\nIn a desperate arms race with the rebels' numerous Splicers, Ryan was forced to use more and more security measures, eventually restricting most public transportation in the city in an attempt to block the movements of Atlas' followers. But even the increasingly oppressive policies Ryan resorted to were not enough to snuff out the rebellion, and public order in the city continued to deteriorate. In the end, Ryan used one last plan left to him by the late Dr. Yi Suchong: modifying Ryan Industries' Plasmid line to make Splicers vulnerable to mental suggestion through complex pheromones, pumped in through the ventilation systems.[16] With much of his Splicer army now neutralized, Atlas and his few remaining unspliced rebels went into hiding in the ruined city, unable to escape Rapture with the bathyspheres locked down.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Frank",
                "Fontaine",
                "Frank Fontaine",
                "Atlus"
            ],
            "id": 7,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Frank Fontaine/Atlus",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "8": {
            "uid": 8,
            "key": [
                "Brigid Tenebaum",
                "Tenebaum"
            ],
            "keysecondary": [],
            "comment": "Brigid Tenebaum",
            "content": "Dr. Brigid Tenenbaum is a geneticist who discovered ADAM and helped develop it into products for commercial sale. She is also the \"mother\" of the Little Sisters. She was responsible for creating them, an act she would later come to regret. She eventually developed an emotional attachment to her former subjects, calling them her \"little ones\", and acting as a mother to them. \nAfter her arrival in Rapture, while walking on the docks of Port Neptune she discovered a smuggler whose crippled hands had been restored to normal functionality after being bitten by a sea slug. She researched the slug and found a substance from it could heal damaged cells, even resurrect them, and in further research explored uses for that substance. It was dubbed ADAM, and it allowed people to manipulate (splice) their DNA, opening up the possibility of giving them superpowers through the use of Plasmids and expanded abilities using Gene Tonics.\nTenenbaum had been turned away by all of the reputable research facilities,but Frank Fontaine saw the value of her discovery and agreed to fund her research. At Fontaine's urging, she engineered a way to mass-produce ADAM in the bodies of hosts. Tenenbaum and Fontaine discovered the only hosts capable of producing sufficient amounts of ADAM were young girls, originating the Little Sisters. Tenenbaum developed her discovery and quickly became a major figure in Rapture's scientific community, the most well-known woman in Rapture, and ensuring financial success for herself and Fontaine Futuristics. She eventually discovered ADAM was addictive and had severe withdrawal side effects requiring it to be taken regularly. Over time, ADAM caused mental and physical deterioration. Tenenbaum initially had no qualms about this effect and Fontaine exploiting his customers, and continued to work for him.[18]\nOn Fontaine's behalf, Tenenbaum and Dr. Yi Suchong were tasked with the development of Fontaine's \"ace in the hole\" back-up plan, Jack. As Fontaine wanted Jack to have some of Ryan's DNA to even his odds in Rapture, he had Tenenbaum purchase the fertilized embryo from Jasmine Jolene, Ryan's mistress. After extensive body modification and mind-altering with ADAM, Fontaine accompanied by Tenenbaum, sent Jack to the surface at the age of two.\nAs Tenenbaum continued work for Fontaine, she became increasingly distressed by what she was doing, specifically to the young girls. She noticed that despite the implantation of the slugs and their mental conditioning, they still acted, played, and sang like little girls. Eventually, Tenenbaum began to feel responsible for her part in their creation and hated herself for doing such things to children. Tenenbaum's newly developed conscience caused Fontaine to fire her, eventually breaking all contact with each other.\nAfter Fontaine died, Tenenbaum worked for Ryan Industries, which had taken over Fontaine Futuristics, and eventually left that employment. Ryan tried to cover up her strange behavior, but after her renunciation of the Little Sister Program became public she was labeled a madwoman in the city's Newspapers. Tenenbaum soon after disappeared from the public eye altogether, leaving her apartment in the Mercury Suites to take up residence in her sanctuary for Little Sisters. She then began working on a cure to reverse the 'ADAM Sickness', and produced a method of reverting Little Sisters. As the Rapture Civil War brewed, she continued rescuing Little Sisters to turn them human again. Much later, Tenenbaum believed that by using The Thinker she could calculate genetic bonding sites of ADAM-affected subjects to be able to undo the damage.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Brigid Tenebaum",
                "Tenebaum"
            ],
            "id": 8,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Tenenbaum",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "9": {
            "uid": 9,
            "key": [
                "Little Sister"
            ],
            "keysecondary": [],
            "comment": "Little Sister",
            "content": "Little Sisters are young girls who have been genetically altered and mentally conditioned to reclaim ADAM from corpses around Rapture. Little Sisters are almost always accompanied by a Big Daddy. They generally are immune to damage, outside of being \"harvested\", and have no offensive abilities. Attacking them, however, will incur the wrath of their Big Daddy protectors.\nADAM is excreted by unique Sea Slugs found near Rapture. The ADAM-producing Sea Slugs did not naturally produce a large enough quantity for serious research and commercial exploitation. Dr. Brigid Tenenbaum developed a procedure whereby a Sea Slug was implanted in a human host's stomach, and a symbiotic interaction between host and slug yielded up to thirty times the quantity of usable ADAM. Young girls, nicknamed \"Little Sisters\" following the implantation process, were found to be the only viable hosts. Although Tenenbaum hoped to be able to keep the children in a vegetative state, it was found they had to be fully functional to produce the ADAM. They still maintained many of the ordinary characteristics of small children: laughing, playing, smiling, and singing.\nFrank Fontaine created his Little Sister's Orphanage in Apollo Square and other locations as a front to exploit the children as his supply of hosts for ADAM production. When Andrew Ryan took over Fontaine Futuristics, he discovered the existence of the children. He found them appalling, but had to accept the necessity of their existence to generate the quantity of ADAM Rapture now required. It wasn't long before the entire city became aware of where ADAM was really coming from. He shut down those false orphanages, and continued to use the Little Wonders Educational Facility to house the existing ADAM hosts. With the City's ADAM addiction endemic, and ADAM's use to fight the civil war, shortages were becoming critical. Eventually, as the civil war's body counts grew and the shortages increased, a solution to get additional ADAM led to using the children to obtain ADAM from corpses. Little Sister ADAM hosts were mentally and physically prepared for this grim harvesting role. Ryan, to negate the abhorence of the population, portrayed the Little Sisters in a marketing gimmick, their image being used on Plasmid and Tonic vending machines called Gatherer's Gardens, and even produced toy dolls of them. Rapture public announcements introduced them as the salvation of the City, a reassurance of continuing ADAM production. With the growing chaos of the Civil War, the demand for ADAM soared and Ryan Industries resorted to kidnapping little girls from their parents to create more Little Sisters.\nTo make Little Sisters more effective in their task, they were heavily conditioned to see the world of Rapture very different from reality. Instead of seeing the dark, deteriorated state of the city, they saw an idealized child's world, with rosy marble floors, pink or red drapings, and flowering vines growing everywhere. Little Sisters saw their Big Daddies as noble golden knights, and saw Big Sisters as brides or princesses with elegant ballroom apparel. Statues appeared to them as heroic Big Daddies, pools of blood as rose petals, flies as butterflies, random fires on the floor as lit fireplaces, weapons as red plastic toy guns, and the dead bodies of Splicers as \"Angels\"; men and women lying in elegant repose with the outline of a halo and angelic wings surrounding them. Splicers themselves appeared as handsome and beautiful, taking the forms of elegantly dressed men and women in masquerade masks, conversing civilly, when in reality they were violently fighting. This \"dream world\" persisted in the girls' day-to-day experience, except for occasional lapses where their senses were brought abruptly back to the grim, twisted reality of Rapture's decay whenever they were frightened or startled. This was also shown to happen while concentrating on the process of gathering ADAM from a corpse. However, this could just be due to Delta temporarily losing control over the girl while she harvests ADAM.\nWith physical and neurological drives in place, the Little Sisters eagerly pursued gathering ADAM in Rapture. The ADAM coursing through their bodies made them virtually indestructible, immediately repairing any damaged tissue. However, they still had the stature and strength of small girls (not to mention their constant hallucinatory state); thus, they were a constant target for abduction and exploitation. Dr. Suchong, in light of the rising mortality rate of Little Sisters, initiated the Protector Program. The idea was to create a series of protectors that would defend the Little Sisters from Splicer attacks so they could gather ADAM without interference. This ambition proved to be more of a challenge than anticipated by the scientists, and numerous attempts were needed to find the right balance of ADAM-based conditioning in both the gatherer and the protector. Despite the tests and trials, through the hands of a third party, the final key to the bond was found to be quid pro quo, as both discover that one could not survive without the other. The results of the program had each Little Sister paired with a Big Daddy, a heavily spliced human test subject grafted into an enormous armored diving suit. After an unfortunate event leading to the demise of Dr. Suchong, the bond was further strengthened through conditioning employing pheromones. The pheromone produced by the Big Daddy attracted the Little Sisters, and its counterpart produced by the Little Sisters instinctively drove the Big Daddies to defend them with their lives. Once Big Daddies came into full production, the Little Sisters were also put through a course of Pavlovian psychological exercises,[4] designed to force them into rejecting all positive feelings towards any mother-type figure, and instead place all of their affection upon a generic Big Daddy archetype. As a result, the little girls see every Big Daddy protecting them as the same person, and consider the mere mention of the word 'Mommy' to be taboo.\n\nBecause of the pheromone and Suchong's conditioning regimen, the Little Sisters are strongly attached to the Big Daddies, affectionately calling them a number of pet names such as 'Mister Bubbles' or 'Mister B'. When a Big Daddy is killed, its Little Sister will stop whatever she is doing and mourn its death. However, the strong bond between the pairs made the Big Daddies highly aggressive, prompting Ryan to issue public warnings against approaching any Little Sisters to prevent any accidents involving citizens or interference.",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Little Sister"
            ],
            "id": 9,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Little Sister",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "10": {
            "uid": 10,
            "key": [
                "Daddy",
                "Mr.B",
                "Tin Daddies",
                "Big daddies",
                "Metal Daddies",
                "Mr.Bubbles"
            ],
            "keysecondary": [],
            "comment": "Daddy",
            "content": "Big Daddies are genetically enhanced human beings who have had their skin and organs grafted into an armored diving suit, with Alpha Series being an apparent exception to the grafting process, though still heavily spliced. Their primary purpose is to protect Little Sisters while they escort them around Rapture.\nBig Daddies were originally created by Dr. Yi Suchong to serve as Rapture's maintenance workers, to help in later construction projects, and to do the menial work of Rapture that was not profitable: Rosies riveted panels and windows while Bouncers drilled deep-sea rocks and minerals for further city expansion.\nAs the demand for ADAM skyrocketed, Suchong proposed the idea of recycling the raw genetic material directly from the corpses of dead Splicers, instead of exclusively producing it with Little Sisters in their laboratories. With the genetically-modified girls at great risk when out on the streets gathering ADAM on their own, the \"Protector Program\" was initiated to bond them to the hulking Big Daddies, turning the latter into Protectors who would respond aggressively to any threat encountered by the Gatherers.\n\nSuchong suggested this idea to Andrew Ryan, knowing that becoming a Big Daddy was a \"one-way street\", but he fretted about being able to find suitable candidates. However, Ryan gave assurances that it would not be a problem. While the true identities of most of the candidates were unknown, many were exiled criminals, the criminally insane, and political dissidents imprisoned in Persephone, which was under the management of Augustus Sinclair, the owner of the plasmid research company, Sinclair Solutions. With the help of Sofia Lamb, who was herself imprisoned at Persephone at that time and acting as a psychiatrist for the other inmates, Sinclair would send chosen test subjects from Persephone to both Fontaine Futuristics and Ryan Industries.\n",
            "constant": false,
            "selective": true,
            "selectiveLogic": 0,
            "order": 10,
            "position": 1,
            "disable": false,
            "addMemo": true,
            "excludeRecursion": true,
            "probability": 100,
            "displayIndex": 1,
            "useProbability": true,
            "secondary_keys": [],
            "keys": [
                "Daddy",
                "Mr.B",
                "Tin Daddies",
                "Big daddies",
                "Metal Daddies",
                "Mr.Bubbles"
            ],
            "id": 10,
            "priority": 10,
            "insertion_order": 10,
            "enabled": true,
            "name": "Big Daddies",
            "extensions": {
                "depth": 4,
                "weight": 10,
                "addMemo": true,
                "probability": 100,
                "displayIndex": 1,
                "selectiveLogic": 0,
                "useProbability": true,
                "characterFilter": null,
                "excludeRecursion": true
            },
            "case_sensitive": false,
            "depth": 4,
            "characterFilter": null,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        }
    }
}