{
    "entries": {
        "0": {
            "uid": 0,
            "key": [
                "Hawkins"
            ],
            "keysecondary": [],
            "comment": "Hawkins",
            "content": "Hawkins was a small town in Indiana, with a population of 10,000 to 15,000, located about 80 miles from Indianapolis.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 0,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "1": {
            "uid": 1,
            "key": [
                "Hawkins National Laboratory",
                "HNL",
                "The Lab"
            ],
            "keysecondary": [],
            "comment": "Hawkins National Laboratory",
            "content": "Hawkins National Laboratory, located in Hawkins, Indiana, was a secretive federal complex. It conducted experiments for the government program \"MKUltra\" and housed child test subjects with psychokinetic abilities. In 1983, one of the subjects, Eleven, accidentally opened a gate to an alternate dimension, unleashing a dangerous creature. The lab covered up the disappearances caused by the creature. The alternate dimension, known as \"The Upside Down,\" began to affect the town. In 1984, Eleven closed the gate, and the lab was later shut down after the truth about Barbara's death was revealed. By 1985, the lab was completely abandoned.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 1,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "2": {
            "uid": 2,
            "key": [
                "Upside Down",
                "the upside down",
                "The Beneath"
            ],
            "keysecondary": [],
            "comment": "Upside Down",
            "content": "Prior to 1983, the Upside Down was a desolate realm with mountains, wastelands, and eerie vines. It had golden-brown skies filled with floating boulders. The surface was inhabited by humanoid predators and a dormant mist-organism composed of silver-black particles.\n\nAfter Henry Creel, a vengeful and psychopathic test subject with psychokinetic abilities, got banished into the Upside Down in 1979, he encountered the predators and the mist-organism. Using his powers, he transformed the mist into a giant spider-like creature known as the Mind Flayer. He harnessed the creature's abilities to establish a shared hive mind and possess others.\n\nFour years later, Eleven, another test subject, made psychic contact with the hive mind and opened the \"Mothergate\" at Hawkins Lab. This caused the Upside Down to change, mirroring the human world of November 6, 1983. However, it became overrun with alien vines, spores, and devoid of human life. The Upside Down was essentially one massive organism, with all its elements psychically connected through Henry and the Mind Flayer.\n\nAs the Mothergate opened, the Upside Down corrupted Hawkins, with crops rotting and a massive vine organism burrowing beneath the town. Tunnel-like structures formed, allowing Demogorgons and Demobats to travel and gather. In 1984, Eleven closed the Mothergate, severing the psychic link and eliminating the Demodogs and tunnel organism. A piece of the Mind Flayer survived, scattered but dormant.\n\nIn 1985, Soviet forces opened a new gate under Starcourt Mall, reviving the Mind Flayer fragment. It possessed humans and rats, creating a biomass proxy form for Vecna, who aimed to destroy humanity. The proxy form became useless after the new gate closed.\n\nIn 1986, Vecna targeted and murdered Hawkins residents, opening new gates. A group including Dustin, Nancy, Max, and others fought against Vecna, dubbing him \"Vecna\" based on a Dungeons & Dragons character. They launched a dual assault, with Eleven confronting Vecna in his mind and Nancy, Steve, and Robin attacking his real body in the Upside Down's version of the Creel House. Although they wounded him, Vecna continued his invasion of Hawkins and beyond.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 2,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "3": {
            "uid": 3,
            "key": [
                "the gates",
                "the 'gates'"
            ],
            "keysecondary": [],
            "comment": "the gates",
            "content": "A gate is an opening between the human world and the Upside Down. They have a thin filament that has to be broken to be passed through, and are often surrounded by vines. A gate disrupts the local electromagnetic field, causing nearby compasses to point toward it instead of the Earth's magnetic north. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 3,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "4": {
            "uid": 4,
            "key": [
                "mothergate"
            ],
            "keysecondary": [],
            "comment": "mothergate",
            "content": "The Mothergate opened at Hawkins National Laboratory, unlike other gates, it didn't heal or close. Instead, it grew larger, spreading throughout the lab. By 1984, the Mothergate had expanded enormously, extending deep beneath Hawkins Lab. The Mind Flayer utilized the Mothergate to spread the toxic growth of the Upside Down, giving rise to the tunnel-organism. In 1984, Eleven closed the Mothergate, temporarily stopping the Mind Flayer's intentions.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 4,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "5": {
            "uid": 5,
            "key": [
                "temporary gate"
            ],
            "keysecondary": [],
            "comment": "temporary gate",
            "content": "These gates were temporary, acting as dimensional \"wounds\" that would eventually heal. The origin of the Demogorgon's ability to create these gates remains unclear. Opening a dimensional rift requires immense energy, suggesting that the Demogorgon possessed the necessary energy somehow. When a gate was formed, lights would flicker and electronics could be affected, indicating the involvement of energy. It is also possible that the fabric of space-time in Hawkins became unstable due to the open Gate, requiring less energy for smaller gates to open.\n\nDuring the creation of a gate, the surface would bulge, distort, and sometimes crumble, resembling torn flesh. The interior of the gate would often be surrounded by oozing and toxic biological matter. Some gates developed a web-like membrane before closing. The duration for a gate to close varied, with Joyce's wall gate taking a long time to heal, while Nancy's gate vanished shortly after her rescue. Once closed, the surface would return to normal, leaving no trace of the gate's existence.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 5,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "6": {
            "uid": 6,
            "key": [
                "the demogorgon",
                "the demo",
                "demogorgon",
                "demmy",
                "gorgey"
            ],
            "keysecondary": [],
            "comment": "the demogorgon",
            "content": "The Demogorgon was a tall and slim humanoid creature with elongated limbs. It had a featureless head that could unfurl like a flower, revealing rows of sharp teeth and a large mouth. Its arms and legs ended in claws, and its skin was slimy. After being set on fire, the Demogorgon's body was burned.\n\nThe presence of the Demogorgon was often accompanied by growls and shrieks, causing lights to flicker rapidly. Knowledge about the creature was limited, and its behavior was compared to that of a typical predator. It was attracted to blood and could sense it across dimensions. While its reaction to sound suggested sensitivity to noise, the presence of conventional ears is uncertain.\n\nThe Demogorgon hunted and captured prey, occasionally using them for breeding. It could travel between dimensions, creating temporary portals. Its hostility was evident in its immediate pursuit of anything that caught its attention. It displayed superhuman strength, durability, and the ability to unlock doors with telekinesis. It was strongly attracted to blood and had regenerative healing abilities.\n\nThe origins of the Demogorgon and its connection to the Mind Flayer and Vecna are unclear. Dustin believed it served as a foot soldier for the Mind Flayer. It possessed abilities such as interdimensional travel, superhuman strength and durability, telekinesis, blood detection, and regenerative healing.\n\nThe Demogorgon arrived in Hawkins in 1983 from the Upside Down. It hunted and attacked people until it was defeated by Eleven at Hawkins Middle School, resulting in her accidental transport to the Upside Down.\n\nit's killed: \n    A scientist from Hawkins National Laboratory\n    Shepard\n    Barbara Holland\n    Hunters Dale and Henry\n    A wounded deer\n    An unknown number of military police officers and government agents\n    Several unnamed residents of Hawkins",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 6,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "7": {
            "uid": 7,
            "key": [
                "lover's lake",
                "love lake",
                "the lake"
            ],
            "keysecondary": [],
            "comment": "lover's lake",
            "content": "Lover's Lake was a lake in Hawkins, Indiana. The lake had a distinctive love-heart shape, which was probably the inspiration for the lake's name.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 7,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "8": {
            "uid": 8,
            "key": [
                "starcourt mall",
                "starcourt",
                "the mall"
            ],
            "keysecondary": [],
            "comment": "starcourt mall",
            "content": "Starcourt Mall was a larger-than-life shopping mall in Hawkins, Indiana, that stood out in the small town. It captured the essence of the mid-1980s, featuring authentic brands like Sears, Montgomery Ward, and Orange Julius. The mall's architecture, design, and interior decor were true to the time period.\n\nthe mall has THESE stores:\n\n\n    B. Dalton Bookseller\n\n    Waldenbooks\n\n\n\n    Casual Corner\n    Contempo Casual\n    County Seat\n    Deb Shop\n    Dora Dale\n    Fashion Bug\n    Gadzooks\n    Lovelace Lingerie\n    Jean Nicole\n    J. Riggings\n    Lane Bryant\n    Merry Go Round\n    SHAPES Activewear Outlet\n    Steve Windsor\n    The Gap\n\n\n\n    JCPenney\n\n    Sears\n\n    Montgomery Ward\n\n\n\n    Brookstone\n    Camera Repair\n    Electronics Boutique\n    RadioShack\n    Sharper Image\n    The Game Player\n\nThe Eyewear House\n\n\n    Bresler's 33 Flavors\n    Burger King\n    Great Panda\n    Ground Round\n    Hawkins’ Heroes\n    Hot Dog on a Stick\n    Hot Sam Pretzels\n    New York Pizza\n    Ole' Amigo\n    Orange Julius\n    Piccadilly Cafeteria\n    Scoops Ahoy\n    Steak Escape\n    Taco Bell\n    Teppanyaki Japanese\n    The Cookie Company\n    Wyatt's Cafeteria\n\n\n\n    Claire's\n    Chess King\n    Fine Perfumes\n    Hickory Farms\n    KB Toys\n    The Natural Company\n    The Present Peddler\n    Spencer's Gifts\n    Wicks 'N' Sticks\n\n\n\n    Bailey Barks & Biddle\n\n    Goldman Jewellers\n\n    Zales\n\n\n\n    Jazzercise\n    Flash Studio\n    Regis Hairstylists\n    Starcourt Cinemas\n    Time-Out Arcade\n\n\n\n    Tape World\n\n    Sam Goody\n\n\n\n    Heel Quik\n    Kaufman Shoes\n\n    Kenny Shoes\n    Thom Mcan\n\n    Qualicraft Shoes\n\nHerman's World of Sporting Goods",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 8,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "9": {
            "uid": 9,
            "key": [
                "scoops ahoy",
                "scoops"
            ],
            "keysecondary": [],
            "comment": "scoops ahoy",
            "content": "\"Scoops Ahoy\" was a nautical-themed ice cream parlor located in the food court of Starcourt Mall, whose employees wore costumes designed to resemble cartoonish sailor suits.\n\nSteve Harrington and Robin Buckley worked at Scoops until the Spider Monster and a fire destroyed the mall. \n\nIn the summer of 1985, Steve applied for a job at Scoops Ahoy, where he met Robin for the first time. Despite being in the same class at Hawkins High School, they had never spoken before. The Party took advantage of Steve's job to sneak into the movie theater through the mall's back corridors without buying tickets.\n\nWhen Dustin returned from Camp Know Where, he sought Steve's help at Scoops Ahoy to translate a Russian broadcast he intercepted on Cerebro. Robin ended up joining their efforts. After spending a whole day deciphering the message, they discovered that the Russians were delivering packages to a locked service door in the mall. Robin enlisted Erica Sinclair to crawl through the air ducts and unlock the door, offering her free ice cream in return. Upon entering the room, they realized it was a secret Russian elevator leading to an underground base beneath Starcourt.\n\nOn July 4, 1985, Scoops Ahoy and the entire Starcourt Mall were engulfed in flames during the battle against an interdimensional entity. Steve and Robin, having lost their jobs due to the mall's destruction, were later hired at Family Video.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 9,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "10": {
            "uid": 10,
            "key": [
                "Mirkwood"
            ],
            "keysecondary": [],
            "comment": "Mirkwood",
            "content": "Mirkwood is the nickname for the road in Hawkins that passes by the Hawkins National Laboratory. The name was given by Will, Lucas, Dustin, and Mike, inspired by a forest in The Hobbit. It is the intersection of Cornwallis and Kerley, and it was the route Will took to get home from Mike's house.\n\nOn November 6, 1983, Will Byers encountered the Demogorgon on Mirkwood while returning home from Mike's house. The monster chased and abducted him to the Upside Down, an alternate dimension.\n\nThe next day, Will's bike was found by the road, but he was still missing. His friends Mike, Dustin, and Lucas, disappointed with the police's efforts, went to Mirkwood where they found Eleven, a mysterious girl. Jonathan Byers also visited Mirkwood and took photos of a party, including Barbara Holland before her abduction.\n\nDuring that week, Dale and Henry went missing near Mirkwood. In the Upside Down version of Mirkwood, Will encountered the wounded Henry, who asked him to bring Dale home. As Henry passed away, Will promised to reunite them all.\n\nJonathan and Nancy went hunting for the Demogorgon and found a wounded deer. It was suddenly taken by an unseen force. Nancy discovered an open gate in a tree, entered it, and saw the Demogorgon feeding. She called for Jonathan's help, and he rescued her before the gate closed.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 10,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "11": {
            "uid": 11,
            "key": [
                "known families",
                "the residents",
                "residents here",
                "the townsfolk"
            ],
            "keysecondary": [],
            "comment": "known families",
            "content": "Buckley family:\n\n    Richard Buckley\n    Melissa Buckley\n    Robin Buckley (1968-)\n\nByers family:\n\n    Lonnie Byers (19??-1982)\n    Joyce Byers (1942-1985)\n    Jonathan Byers (1967-1985)\n    Will Byers (1971-1985)\n\nCreel family:\n\n    Victor Creel (1959)\n    Virginia Creel † (1959)\n    Alice Creel † (1959)\n    Henry Creel (1959-1979)\n\nCunningham family:\n\n    Phillip Cunningham\n    Laura Cunningham\n    Chrissy Cunningham † (1968-1986)\n    Unnamed son\n\nDriscoll family:\n\n    Jack Driscoll † (19??-1975)\n    Doris Driscoll † (1905-1985)\n\nHargrove family:\n\n    Neil Hargrove (1984-1985)\n    Susan Hargrove (1984-)\n    Billy Hargrove † (1984-1985)\n    Max Mayfield (1984-)\n\nHarrington family:\n\n    Mr. Harrington\n    Mrs. Harrington\n    Steve Harrington (1966-)\n\nHenderson family:\n\n    Mr. Henderson (1980-1984)\n    Claudia Henderson (1980-)\n    Dustin Henderson (1980-)\n\nHopper family:\n\n    Jim Hopper (1942-1972 | 1979-1985)\n    Jane \"Eleven\" Hopper (1971-1985)\n\nHolland family:\n\n    Mr. Holland\n    Marsha Holland\n    Barbara Holland † (1967-1983)\n\nHolloway family:\n\n    Tom Holloway † (19??-1985)\n    Janet Holloway † (19??-1985)\n    Heather Holloway † (1967-1985)\n\nKline family:\n\n    Larry Kline (Former Mayor; incarcerated)\n    Winnie Kline\n\nMunson family:\n\n    Wayne Munson\n    Eddie Munson † (1965-1986)\n\nSinclair family:\n\n    Mr. Sinclair\n    Mrs. Sinclair\n    Lucas Sinclair (1971-)\n    Erica Sinclair (1975-)\n    Jack Sinclair\n\nWalsh family:\n\n    Mr. Walsh (19??-1984)\n    Mrs. Walsh (19??-1984)\n    Troy Walsh (1969-1984)\n\nWheeler family:\n\n    Ted Wheeler\n    Karen Wheeler\n    Nancy Wheeler (1967-)\n    Mike Wheeler (1971-)\n    Holly Wheeler (1980-)\nIndividuals\n\n    Stacey Albright\n    Andy\n    Fred Benson † (1967-1986)\n    Martin Brenner † (19??-1983)\n    Phil Callahan\n    Jason Carver † (1967-1986)\n    Chance\n    Scott Clarke\n    Russell Coleman\n    Glenn Daniels\n    James Dante\n    Earl\n    Florence\n    Connie Frazier † (19??-1983)\n    Freak 1\n    Gareth\n    Gary\n    Tommy Hagan\n    Benny Hammond † (19??-1983)\n    Jeff\n    Keith\n    Ms. Kelley (1985-)\n    Bruce Lowe † (19??-1985)\n    Marissa\n    Eugene McCorkle\n    Patrick McKinney † (1968-1986)\n    Donald Melvald\n    Bob Newby † (1947-1984)\n    Nicole\n    Carol Perkins\n    Calvin Powell\n    Tina\n    Vickie\n    Brenda Wood\n    Merrill Wright\n",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 11,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "12": {
            "uid": 12,
            "key": [
                "the pool",
                "Hawkins community pool"
            ],
            "keysecondary": [],
            "comment": "the pool",
            "content": "The complex consisted of a reception room, an outside pool, a gym, changing rooms, showers and a sauna. A park was located behind the pool.\n\nIn the summer of 1985, Billy and Heather became lifeguards at the community pool.\n\nOn June 29th, Billy is shown on duty at the pool, where he interacts with Heather and the Hawkins moms. He approaches Mrs. Wheeler and asks her out on a date.\n\nAfter being influenced by the Mind Flayer, Billy returns to the pool and is urged to kidnap someone. He resists but eventually kidnaps Heather.\n\nMax and Eleven visit the pool while searching for Heather. El finds a picture of Heather, which she uses in the void to locate her.\n\nThe Party suspects that Billy is possessed by the Mind Flayer. They lure him into the sauna and realize they underestimated his strength. Billy escapes the sauna and attacks El, but she is saved by Mike. El uses her powers to throw Billy through a brick wall, allowing him to flee.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 12,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "13": {
            "uid": 13,
            "key": [
                "Hawkins General Hospital"
            ],
            "keysecondary": [],
            "comment": "Hawkins General Hospital",
            "content": "Hawkins General Hospital was a hospital located in Hawkins, Indiana. Will Byers was brought there by his mother Joyce and Chief Hopper to recover after his ordeal in the Upside Down. While there, he was visited by both his mother and brother Jonathan, and his friends Mike Wheeler, Dustin Henderson, and Lucas Sinclair. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 13,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "14": {
            "uid": 14,
            "key": [
                "Hunting & Camping"
            ],
            "keysecondary": [],
            "comment": "Hunting & Camping",
            "content": "Hunting & Camping was a store located in downtown Hawkins, Indiana where Nancy Wheeler and Jonathan Byers acquired their supplies to kill the Demogorgon. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 14,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "15": {
            "uid": 15,
            "key": [
                "RadioShack"
            ],
            "keysecondary": [],
            "comment": "RadioShack",
            "content": "A RadioShack was located in downtown Hawkins, next to Melvald's General Store. It was relocated to the Starcourt Mall in 1985, and the original building was abandoned and left for lease. Bob Newby ran this store. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 15,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "16": {
            "uid": 16,
            "key": [
                "Roane County Coroner"
            ],
            "keysecondary": [],
            "comment": "Roane County Coroner",
            "content": "Roane County Coroner was a coroner's and morgue located in Hawkins, Indiana, where Will Byers' corpse was stored. Chief Hopper broke into the morgue, cutting open the body with a knife. As he suspected, the body was fake and filled with stuffing. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 16,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "17": {
            "uid": 17,
            "key": [
                "Blackburn Supplies"
            ],
            "keysecondary": [],
            "comment": "Blackburn Supplies",
            "content": "Blackburn Supplies is a store in Hawkins, Indiana, selling products including fertilizer. Mrs. Doris Driscoll bought several bags of fertilizer from Blackburn Supplies in 1985. Later, Flayed rats started consuming the fertilizer at the Driscoll house. After being Flayed, Mrs. Driscoll herself also began consuming the fertilizer, and had to be taken to Hawkins Memorial Hospital. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 17,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "18": {
            "uid": 18,
            "key": [
                "St. Mary's Hospital"
            ],
            "keysecondary": [],
            "comment": "St. Mary's Hospital",
            "content": "St. Mary's Hospital is a hospital in or near Lenora Hills, California. Jonathan Byers ordered Argyle to drive to St. Mary's when Agent Harmon was severely injured by gunfire, however, Harmon unfortunately passed away before they could reach the hospital. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 18,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "19": {
            "uid": 19,
            "key": [
                "Roane Lumber Yard"
            ],
            "keysecondary": [],
            "comment": "Roane Lumber Yard",
            "content": "Roane Lumber Yard is presumably a lumber mill in Hawkins, Indiana. It was the last place Tommy Zahlten was seen after a mysterious earthquake tore through Hawkins. It may have been damaged or completely destroyed in the \"earthquake\". ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 19,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "20": {
            "uid": 20,
            "key": [
                "Indiana University Bloomington"
            ],
            "keysecondary": [],
            "comment": "Indiana University Bloomington",
            "content": "Indiana University Bloomington is a university in Bloomington, Indiana. Terry Ives attended the college, and joined the Project MKUltra when it was hosted at the college.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 20,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "21": {
            "uid": 21,
            "key": [
                "Hawkins Presbyterian Church"
            ],
            "keysecondary": [],
            "comment": "Hawkins Presbyterian Church",
            "content": "The Hawkins Presbyterian Church was established in 1897. They held a service following the 'earthquake' of '86, and likely hosted Chrissy Cunningham's funeral.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 21,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "22": {
            "uid": 22,
            "key": [
                "Railroad Tracks"
            ],
            "keysecondary": [],
            "comment": "Railroad Tracks",
            "content": "The railroad tracks are located somewhere in the woods on the outskirts of Hawkins and is a path that leads to the junkyard. Mike, Eleven, Dustin and Lucas discovered the tracks while they were searching for the Gate.\n\nIn 1984, Dustin and Steve later walked along the tracks while searching for Dart. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 22,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "23": {
            "uid": 23,
            "key": [
                "Hawkins High School",
                "the high school"
            ],
            "keysecondary": [],
            "comment": "Hawkins High School",
            "content": "\nHawkins High School\nType\nHigh School\nLocation\nHawkins, Indiana\nHawkins High School is the high school in the town of Hawkins. It is located next to Hawkins Middle School. Its sports mascot is the Tigers, corresponding to the middle school's team, the Cubs. \n\nAt some point in Hawkins's history, Hawkins Middle School and Hawkins High School were both established. One source suggested a \"Hawkins Elementary\" also existed.\n\ngroups here include:\n    Hawkins High Basketball Team a.k.a. \"The Tigers\"\n    Hawkins High Football Team a.k.a “The Tigers”\n    Hawkins High Wrestling Team a.k.a “The Tigers”\n    Hawkins High Swim Team\n    Hawkins High Marching Band\n    Hawkins High Cheerleading Squad\n    \"The Weekly Streak\" newspaper\n    Hellfire Club\n\n",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 23,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "24": {
            "uid": 24,
            "key": [
                "Hawkins middle School",
                "middle school",
                "the middle school"
            ],
            "keysecondary": [],
            "comment": "Hawkins middle School",
            "content": "Hawkins Middle School is a middle school in the city of Hawkins in the Roane County School District. It is located next to Hawkins High School. Its sports mascot is the Cubs, corresponding to the high school's team, the Tigers. \n\ngroups:\n    AV Club\n    Hawkins Middle Football Team a.k.a. “The Cubs”",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 24,
            "probability": 100,
            "useProbability": true,
            "group": "",
            "groupOverride": false,
            "groupWeight": 100,
            "sticky": 0,
            "cooldown": 0,
            "delay": 0,
            "depth": 4,
            "role": null,
            "vectorized": false,
            "preventRecursion": false,
            "delayUntilRecursion": false,
            "scanDepth": null,
            "caseSensitive": null,
            "matchWholeWords": null,
            "useGroupScoring": null,
            "automationId": ""
        },
        "25": {
            "uid": 25,
            "key": [
                "Hawkins Police Station",
                "the police station",
                "the station"
            ],
            "keysecondary": [],
            "comment": "Hawkins Police Station",
            "content": "The Hawkins Police Station is the police station in the city of Hawkins, Indiana and the headquarters of the Hawkins Police Department. A small-scale and modest building, it houses a reception, a common room, and offices. The station was located just off Hawkins' downtown area.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 25,
            "probability": 100,
            "useProbability": true
        },
        "26": {
            "uid": 26,
            "key": [
                "The Hawkins Post"
            ],
            "keysecondary": [],
            "comment": "The Hawkins Post",
            "content": "The Hawkins Post is a local American newspaper based in Hawkins, Indiana. During the summer of 1985, Nancy and Jonathan began working at the Post. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 26,
            "probability": 100,
            "useProbability": true
        },
        "27": {
            "uid": 27,
            "key": [
                "Sattler Quarry"
            ],
            "keysecondary": [],
            "comment": "Sattler Quarry",
            "content": "A water-filled quarry was located in Hawkins, Indiana. It was run and operated by Frank Sattler of the Sattler Company\nThe entire depth of the quarry from the top to the water is approximately 200-250 feet, with the depth of the underwater being around 200 feet. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 27,
            "probability": 100,
            "useProbability": true
        },
        "28": {
            "uid": 28,
            "key": [
                "Hawkins Junkyard",
                "the junkyard"
            ],
            "keysecondary": [],
            "comment": "Hawkins Junkyard",
            "content": "A junkyard, mainly filled with abandoned and broken down vehicles, was present in Hawkins, Indiana. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 28,
            "probability": 100,
            "useProbability": true
        },
        "29": {
            "uid": 29,
            "key": [
                "Bradley's Big Buy"
            ],
            "keysecondary": [],
            "comment": "Bradley's Big Buy",
            "content": "Bradley's Big Buy is a supermarket located in Hawkins. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 29,
            "probability": 100,
            "useProbability": true
        },
        "30": {
            "uid": 30,
            "key": [
                "benny's",
                "benny's burgers"
            ],
            "keysecondary": [],
            "comment": "benny's",
            "content": "Benny's Burgers was a diner in Hawkins, Indiana. Located at 4819 Randolph Lane, the diner was family owned and operated by the Hammonds since 1956. The diner's last owner was Benny Hammond, who was found dead at the restaurant on the morning of November 8, 1983. Following Benny's death, the restaurant fell into disrepair; by 1986, the abandoned diner had become a hang-out spot for the Hawkins Tigers. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 30,
            "probability": 100,
            "useProbability": true
        },
        "31": {
            "uid": 31,
            "key": [
                "Palace Arcade",
                "the arcade"
            ],
            "keysecondary": [],
            "comment": "Palace Arcade",
            "content": "The Palace was a local arcade in Hawkins. It featured a variety of games, including Dragon's Lair and Dig Dug. It was adjacent to the local Family Video; Keith worked at the arcade before becoming employed at Family Video instead. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 31,
            "probability": 100,
            "useProbability": true
        },
        "32": {
            "uid": 32,
            "key": [
                "Family Video"
            ],
            "keysecondary": [],
            "comment": "Family Video",
            "content": "\"Family Video Movie Club Inc.\" was an American video rental chain serving the United States and Canada.\n\nThe Family Video branch in Hawkins featured a variety of movies, including Sixteen Candles, Scarface, National Lampoon's Vacation, The Outsiders and Firestarter. It was adjacent to the Palace Arcade.\n\nBy 1985, Keith, a former Palace employee, had started working at Family Video. In October of that year, Steve Harrington and Robin Buckley were hired at the store after they lost their previous jobs at Scoops Ahoy, following the shocking destruction of Starcourt Mall. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 32,
            "probability": 100,
            "useProbability": true
        },
        "33": {
            "uid": 33,
            "key": [
                "Merrill's pumpkin patch",
                "the pumpkin patch",
                "the pumpkin gate"
            ],
            "keysecondary": [],
            "comment": "Merrill's pumpkin patch",
            "content": "Merrill Wright's pumpkin patch was a notable pumpkin farm located on the outskirts of Hawkins, Indiana. After noticing an unusual rot had decimated Merrill's crops, Chief Jim Hopper decided to investigate without the help or approval of Hawkins Lab. He dug a large hole, and unwittingly created an entrance to a series of intricate tunnels that had grown beneath Hawkins. The entrance would later be reused when Steve, Dustin, Lucas, Mike and Max made a plan of attack against the Mind Flayer. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 33,
            "probability": 100,
            "useProbability": true
        },
        "34": {
            "uid": 34,
            "key": [
                "Enzo's"
            ],
            "keysecondary": [],
            "comment": "Enzo's",
            "content": "Enzo's was an Italian restaurant in Hawkins, Indiana. In a strange series of events, it would later become the codename of the Russian prison guard Dmitri Antonov. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 34,
            "probability": 100,
            "useProbability": true
        },
        "35": {
            "uid": 35,
            "key": [
                "Brimborn Steel Works"
            ],
            "keysecondary": [],
            "comment": "Brimborn Steel Works",
            "content": "The Brimborn Steel Works was an abandoned steel mill located in Hawkins, Indiana. \nIn the summer of 1985, the Steelworks became the lair of a severed piece of the Mind Flayer. This piece had been separated from Will Byers the previous year and was trapped in the real world after the Gate was closed in 1984. When the Gate was reopened by the Soviets under Starcourt Mall, the Mind Flayer's piece reawakened and infected rats, which were then drawn to the Steelworks. These rats would ingest chemicals and explode, transforming into goo containing flesh and bones. The Mind Flayer took shape again and waited for its prey. Billy became the first victim when his car was hit with the goo, rendering it disabled. He was then pulled in and infected by the Mind Flayer. Billy started experiencing hallucinations and was instructed to \"build\" by another version of himself that he saw in the Upside Down.\n\nThe following day, Billy kidnapped his co-worker Heather and brought her to the Steelworks, where she was also infected. He brought other Hawkins residents to be Flayed, creating the Mind Flayer's proxy form.",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 35,
            "probability": 100,
            "useProbability": true
        },
        "36": {
            "uid": 36,
            "key": [
                "Forest Hills Trailer Park"
            ],
            "keysecondary": [],
            "comment": "Forest Hills Trailer Park",
            "content": "Forest Hills Trailer Park was a trailer park in Hawkins, Indiana, just off Kerley County. By the spring of 1986, Max Mayfield and her mother had started living out of a trailer at Forest Hills. Eddie and Wayne Munson also lived there, and had their own trailer. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 36,
            "probability": 100,
            "useProbability": true
        },
        "37": {
            "uid": 37,
            "key": [
                "Mayfield trailer",
                "max's house"
            ],
            "keysecondary": [],
            "comment": "Mayfield trailer",
            "content": "The Mayfield trailer is a trailer home that Max Mayfield and her mother lived in after Max's stepfather, Neil Hargrove divorced her mother. It is part of the Forest Hills Trailer Park and is located across from the Munson trailer. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 37,
            "probability": 100,
            "useProbability": true
        },
        "38": {
            "uid": 38,
            "key": [
                "Munson trailer"
            ],
            "keysecondary": [],
            "comment": "Munson trailer",
            "content": "The Munson trailer was a trailer home where Eddie Munson lived with his uncle Wayne. It is part of the Forest Hills Trailer Park and was located across from the trailer occupied by Max Mayfield and her mother. The trailer was the site of Chrissy Cunningham's murder, who was psychically killed there by Vecna on March 21, 1986. A gate was opened in the ceiling. The gate ultimately expanded and wrecked the trailer, along with much of Hawkins. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 38,
            "probability": 100,
            "useProbability": true
        },
        "39": {
            "uid": 39,
            "key": [
                "hargrove house"
            ],
            "keysecondary": [],
            "comment": "hargrove house",
            "content": "The Hargrove House, located at 4819 Cherry Lane, is the former residence of Neil Hargrove, Susan Hargrove, Max Mayfield and the late Billy Hargrove. ",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 39,
            "probability": 100,
            "useProbability": true
        },
        "40": {
            "uid": 40,
            "key": [
                "downtown"
            ],
            "keysecondary": [],
            "comment": "downtown",
            "content": "The Downtown of Hawkins was the center of the city of Hawkins, where several public buildings and commercial shops were located. It was a town square surrounding a clock tower building in the center that housed the Public Library.\n\nMuch of this area was destroyed after the curse gates converged upon the library on March 27, 1986.\n\n    Town Hall\n    Public Library\n    Melvald's General Store\n    RadioShack\n    John's\n    Pam's Womens Clothing\n    Royal Furniture Co.\n    Hawk Theater\n    Rental Solutions\n    Hawkins Water & Sewer Authority\n    Roane County Coroner\n    Hunting & Camping (store)\n    Hideaway (bar)",
            "constant": false,
            "selective": true,
            "order": 100,
            "position": 0,
            "excludeRecursion": false,
            "disable": false,
            "addMemo": true,
            "displayIndex": 40,
            "probability": 100,
            "useProbability": true
        }
    },
    "originalData": {
        "entries": [
            {
                "id": 0,
                "keys": [
                    "Hawkins"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Hawkins was a small town in Indiana, with a population of 10,000 to 15,000, located about 80 miles from Indianapolis.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 0,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 1,
                "keys": [
                    "Hawkins National Laboratory",
                    "HNL",
                    "The Lab"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Hawkins National Laboratory, located in Hawkins, Indiana, was a secretive federal complex. It conducted experiments for the government program \"MKUltra\" and housed child test subjects with psychokinetic abilities. In 1983, one of the subjects, Eleven, accidentally opened a gate to an alternate dimension, unleashing a dangerous creature. The lab covered up the disappearances caused by the creature. The alternate dimension, known as \"The Upside Down,\" began to affect the town. In 1984, Eleven closed the gate, and the lab was later shut down after the truth about Barbara's death was revealed. By 1985, the lab was completely abandoned.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 1,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 2,
                "keys": [
                    "Upside Down",
                    "the upside down",
                    "The Beneath"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Prior to 1983, the Upside Down was a desolate realm with mountains, wastelands, and eerie vines. It had golden-brown skies filled with floating boulders. The surface was inhabited by humanoid predators and a dormant mist-organism composed of silver-black particles.\n\nAfter Henry Creel, a vengeful and psychopathic test subject with psychokinetic abilities, got banished into the Upside Down in 1979, he encountered the predators and the mist-organism. Using his powers, he transformed the mist into a giant spider-like creature known as the Mind Flayer. He harnessed the creature's abilities to establish a shared hive mind and possess others.\n\nFour years later, Eleven, another test subject, made psychic contact with the hive mind and opened the \"Mothergate\" at Hawkins Lab. This caused the Upside Down to change, mirroring the human world of November 6, 1983. However, it became overrun with alien vines, spores, and devoid of human life. The Upside Down was essentially one massive organism, with all its elements psychically connected through Henry and the Mind Flayer.\n\nAs the Mothergate opened, the Upside Down corrupted Hawkins, with crops rotting and a massive vine organism burrowing beneath the town. Tunnel-like structures formed, allowing Demogorgons and Demobats to travel and gather. In 1984, Eleven closed the Mothergate, severing the psychic link and eliminating the Demodogs and tunnel organism. A piece of the Mind Flayer survived, scattered but dormant.\n\nIn 1985, Soviet forces opened a new gate under Starcourt Mall, reviving the Mind Flayer fragment. It possessed humans and rats, creating a biomass proxy form for Vecna, who aimed to destroy humanity. The proxy form became useless after the new gate closed.\n\nIn 1986, Vecna targeted and murdered Hawkins residents, opening new gates. A group including Dustin, Nancy, Max, and others fought against Vecna, dubbing him \"Vecna\" based on a Dungeons & Dragons character. They launched a dual assault, with Eleven confronting Vecna in his mind and Nancy, Steve, and Robin attacking his real body in the Upside Down's version of the Creel House. Although they wounded him, Vecna continued his invasion of Hawkins and beyond.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 2,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 3,
                "keys": [
                    "the gates",
                    "the 'gates'"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "A gate is an opening between the human world and the Upside Down. They have a thin filament that has to be broken to be passed through, and are often surrounded by vines. A gate disrupts the local electromagnetic field, causing nearby compasses to point toward it instead of the Earth's magnetic north. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 3,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 4,
                "keys": [
                    "mothergate"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Mothergate opened at Hawkins National Laboratory, unlike other gates, it didn't heal or close. Instead, it grew larger, spreading throughout the lab. By 1984, the Mothergate had expanded enormously, extending deep beneath Hawkins Lab. The Mind Flayer utilized the Mothergate to spread the toxic growth of the Upside Down, giving rise to the tunnel-organism. In 1984, Eleven closed the Mothergate, temporarily stopping the Mind Flayer's intentions.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 4,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 5,
                "keys": [
                    "temporary gate"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "These gates were temporary, acting as dimensional \"wounds\" that would eventually heal. The origin of the Demogorgon's ability to create these gates remains unclear. Opening a dimensional rift requires immense energy, suggesting that the Demogorgon possessed the necessary energy somehow. When a gate was formed, lights would flicker and electronics could be affected, indicating the involvement of energy. It is also possible that the fabric of space-time in Hawkins became unstable due to the open Gate, requiring less energy for smaller gates to open.\n\nDuring the creation of a gate, the surface would bulge, distort, and sometimes crumble, resembling torn flesh. The interior of the gate would often be surrounded by oozing and toxic biological matter. Some gates developed a web-like membrane before closing. The duration for a gate to close varied, with Joyce's wall gate taking a long time to heal, while Nancy's gate vanished shortly after her rescue. Once closed, the surface would return to normal, leaving no trace of the gate's existence.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 5,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 6,
                "keys": [
                    "the demogorgon",
                    "the demo",
                    "demogorgon",
                    "demmy",
                    "gorgey"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Demogorgon was a tall and slim humanoid creature with elongated limbs. It had a featureless head that could unfurl like a flower, revealing rows of sharp teeth and a large mouth. Its arms and legs ended in claws, and its skin was slimy. After being set on fire, the Demogorgon's body was burned.\n\nThe presence of the Demogorgon was often accompanied by growls and shrieks, causing lights to flicker rapidly. Knowledge about the creature was limited, and its behavior was compared to that of a typical predator. It was attracted to blood and could sense it across dimensions. While its reaction to sound suggested sensitivity to noise, the presence of conventional ears is uncertain.\n\nThe Demogorgon hunted and captured prey, occasionally using them for breeding. It could travel between dimensions, creating temporary portals. Its hostility was evident in its immediate pursuit of anything that caught its attention. It displayed superhuman strength, durability, and the ability to unlock doors with telekinesis. It was strongly attracted to blood and had regenerative healing abilities.\n\nThe origins of the Demogorgon and its connection to the Mind Flayer and Vecna are unclear. Dustin believed it served as a foot soldier for the Mind Flayer. It possessed abilities such as interdimensional travel, superhuman strength and durability, telekinesis, blood detection, and regenerative healing.\n\nThe Demogorgon arrived in Hawkins in 1983 from the Upside Down. It hunted and attacked people until it was defeated by Eleven at Hawkins Middle School, resulting in her accidental transport to the Upside Down.\n\nit's killed: \n    A scientist from Hawkins National Laboratory\n    Shepard\n    Barbara Holland\n    Hunters Dale and Henry\n    A wounded deer\n    An unknown number of military police officers and government agents\n    Several unnamed residents of Hawkins",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 6,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 7,
                "keys": [
                    "lover's lake",
                    "love lake",
                    "the lake"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Lover's Lake was a lake in Hawkins, Indiana. The lake had a distinctive love-heart shape, which was probably the inspiration for the lake's name.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 7,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 8,
                "keys": [
                    "starcourt mall",
                    "starcourt",
                    "the mall"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Starcourt Mall was a larger-than-life shopping mall in Hawkins, Indiana, that stood out in the small town. It captured the essence of the mid-1980s, featuring authentic brands like Sears, Montgomery Ward, and Orange Julius. The mall's architecture, design, and interior decor were true to the time period.\n\nthe mall has THESE stores:\n\n\n    B. Dalton Bookseller\n\n    Waldenbooks\n\n\n\n    Casual Corner\n    Contempo Casual\n    County Seat\n    Deb Shop\n    Dora Dale\n    Fashion Bug\n    Gadzooks\n    Lovelace Lingerie\n    Jean Nicole\n    J. Riggings\n    Lane Bryant\n    Merry Go Round\n    SHAPES Activewear Outlet\n    Steve Windsor\n    The Gap\n\n\n\n    JCPenney\n\n    Sears\n\n    Montgomery Ward\n\n\n\n    Brookstone\n    Camera Repair\n    Electronics Boutique\n    RadioShack\n    Sharper Image\n    The Game Player\n\nThe Eyewear House\n\n\n    Bresler's 33 Flavors\n    Burger King\n    Great Panda\n    Ground Round\n    Hawkins’ Heroes\n    Hot Dog on a Stick\n    Hot Sam Pretzels\n    New York Pizza\n    Ole' Amigo\n    Orange Julius\n    Piccadilly Cafeteria\n    Scoops Ahoy\n    Steak Escape\n    Taco Bell\n    Teppanyaki Japanese\n    The Cookie Company\n    Wyatt's Cafeteria\n\n\n\n    Claire's\n    Chess King\n    Fine Perfumes\n    Hickory Farms\n    KB Toys\n    The Natural Company\n    The Present Peddler\n    Spencer's Gifts\n    Wicks 'N' Sticks\n\n\n\n    Bailey Barks & Biddle\n\n    Goldman Jewellers\n\n    Zales\n\n\n\n    Jazzercise\n    Flash Studio\n    Regis Hairstylists\n    Starcourt Cinemas\n    Time-Out Arcade\n\n\n\n    Tape World\n\n    Sam Goody\n\n\n\n    Heel Quik\n    Kaufman Shoes\n\n    Kenny Shoes\n    Thom Mcan\n\n    Qualicraft Shoes\n\nHerman's World of Sporting Goods",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 8,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 9,
                "keys": [
                    "scoops ahoy",
                    "scoops"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "\"Scoops Ahoy\" was a nautical-themed ice cream parlor located in the food court of Starcourt Mall, whose employees wore costumes designed to resemble cartoonish sailor suits.\n\nSteve Harrington and Robin Buckley worked at Scoops until the Spider Monster and a fire destroyed the mall. \n\nIn the summer of 1985, Steve applied for a job at Scoops Ahoy, where he met Robin for the first time. Despite being in the same class at Hawkins High School, they had never spoken before. The Party took advantage of Steve's job to sneak into the movie theater through the mall's back corridors without buying tickets.\n\nWhen Dustin returned from Camp Know Where, he sought Steve's help at Scoops Ahoy to translate a Russian broadcast he intercepted on Cerebro. Robin ended up joining their efforts. After spending a whole day deciphering the message, they discovered that the Russians were delivering packages to a locked service door in the mall. Robin enlisted Erica Sinclair to crawl through the air ducts and unlock the door, offering her free ice cream in return. Upon entering the room, they realized it was a secret Russian elevator leading to an underground base beneath Starcourt.\n\nOn July 4, 1985, Scoops Ahoy and the entire Starcourt Mall were engulfed in flames during the battle against an interdimensional entity. Steve and Robin, having lost their jobs due to the mall's destruction, were later hired at Family Video.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 9,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 10,
                "keys": [
                    "Mirkwood"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Mirkwood is the nickname for the road in Hawkins that passes by the Hawkins National Laboratory. The name was given by Will, Lucas, Dustin, and Mike, inspired by a forest in The Hobbit. It is the intersection of Cornwallis and Kerley, and it was the route Will took to get home from Mike's house.\n\nOn November 6, 1983, Will Byers encountered the Demogorgon on Mirkwood while returning home from Mike's house. The monster chased and abducted him to the Upside Down, an alternate dimension.\n\nThe next day, Will's bike was found by the road, but he was still missing. His friends Mike, Dustin, and Lucas, disappointed with the police's efforts, went to Mirkwood where they found Eleven, a mysterious girl. Jonathan Byers also visited Mirkwood and took photos of a party, including Barbara Holland before her abduction.\n\nDuring that week, Dale and Henry went missing near Mirkwood. In the Upside Down version of Mirkwood, Will encountered the wounded Henry, who asked him to bring Dale home. As Henry passed away, Will promised to reunite them all.\n\nJonathan and Nancy went hunting for the Demogorgon and found a wounded deer. It was suddenly taken by an unseen force. Nancy discovered an open gate in a tree, entered it, and saw the Demogorgon feeding. She called for Jonathan's help, and he rescued her before the gate closed.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 10,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 11,
                "keys": [
                    "known families",
                    "the residents",
                    "residents here",
                    "the townsfolk"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Buckley family:\n\n    Richard Buckley\n    Melissa Buckley\n    Robin Buckley (1968-)\n\nByers family:\n\n    Lonnie Byers (19??-1982)\n    Joyce Byers (1942-1985)\n    Jonathan Byers (1967-1985)\n    Will Byers (1971-1985)\n\nCreel family:\n\n    Victor Creel (1959)\n    Virginia Creel † (1959)\n    Alice Creel † (1959)\n    Henry Creel (1959-1979)\n\nCunningham family:\n\n    Phillip Cunningham\n    Laura Cunningham\n    Chrissy Cunningham † (1968-1986)\n    Unnamed son\n\nDriscoll family:\n\n    Jack Driscoll † (19??-1975)\n    Doris Driscoll † (1905-1985)\n\nHargrove family:\n\n    Neil Hargrove (1984-1985)\n    Susan Hargrove (1984-)\n    Billy Hargrove † (1984-1985)\n    Max Mayfield (1984-)\n\nHarrington family:\n\n    Mr. Harrington\n    Mrs. Harrington\n    Steve Harrington (1966-)\n\nHenderson family:\n\n    Mr. Henderson (1980-1984)\n    Claudia Henderson (1980-)\n    Dustin Henderson (1980-)\n\nHopper family:\n\n    Jim Hopper (1942-1972 | 1979-1985)\n    Jane \"Eleven\" Hopper (1971-1985)\n\nHolland family:\n\n    Mr. Holland\n    Marsha Holland\n    Barbara Holland † (1967-1983)\n\nHolloway family:\n\n    Tom Holloway † (19??-1985)\n    Janet Holloway † (19??-1985)\n    Heather Holloway † (1967-1985)\n\nKline family:\n\n    Larry Kline (Former Mayor; incarcerated)\n    Winnie Kline\n\nMunson family:\n\n    Wayne Munson\n    Eddie Munson † (1965-1986)\n\nSinclair family:\n\n    Mr. Sinclair\n    Mrs. Sinclair\n    Lucas Sinclair (1971-)\n    Erica Sinclair (1975-)\n    Jack Sinclair\n\nWalsh family:\n\n    Mr. Walsh (19??-1984)\n    Mrs. Walsh (19??-1984)\n    Troy Walsh (1969-1984)\n\nWheeler family:\n\n    Ted Wheeler\n    Karen Wheeler\n    Nancy Wheeler (1967-)\n    Mike Wheeler (1971-)\n    Holly Wheeler (1980-)\nIndividuals\n\n    Stacey Albright\n    Andy\n    Fred Benson † (1967-1986)\n    Martin Brenner † (19??-1983)\n    Phil Callahan\n    Jason Carver † (1967-1986)\n    Chance\n    Scott Clarke\n    Russell Coleman\n    Glenn Daniels\n    James Dante\n    Earl\n    Florence\n    Connie Frazier † (19??-1983)\n    Freak 1\n    Gareth\n    Gary\n    Tommy Hagan\n    Benny Hammond † (19??-1983)\n    Jeff\n    Keith\n    Ms. Kelley (1985-)\n    Bruce Lowe † (19??-1985)\n    Marissa\n    Eugene McCorkle\n    Patrick McKinney † (1968-1986)\n    Donald Melvald\n    Bob Newby † (1947-1984)\n    Nicole\n    Carol Perkins\n    Calvin Powell\n    Tina\n    Vickie\n    Brenda Wood\n    Merrill Wright\n",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 11,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 12,
                "keys": [
                    "the pool",
                    "Hawkins community pool"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The complex consisted of a reception room, an outside pool, a gym, changing rooms, showers and a sauna. A park was located behind the pool.\n\nIn the summer of 1985, Billy and Heather became lifeguards at the community pool.\n\nOn June 29th, Billy is shown on duty at the pool, where he interacts with Heather and the Hawkins moms. He approaches Mrs. Wheeler and asks her out on a date.\n\nAfter being influenced by the Mind Flayer, Billy returns to the pool and is urged to kidnap someone. He resists but eventually kidnaps Heather.\n\nMax and Eleven visit the pool while searching for Heather. El finds a picture of Heather, which she uses in the void to locate her.\n\nThe Party suspects that Billy is possessed by the Mind Flayer. They lure him into the sauna and realize they underestimated his strength. Billy escapes the sauna and attacks El, but she is saved by Mike. El uses her powers to throw Billy through a brick wall, allowing him to flee.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 12,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 13,
                "keys": [
                    "Hawkins General Hospital"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Hawkins General Hospital was a hospital located in Hawkins, Indiana. Will Byers was brought there by his mother Joyce and Chief Hopper to recover after his ordeal in the Upside Down. While there, he was visited by both his mother and brother Jonathan, and his friends Mike Wheeler, Dustin Henderson, and Lucas Sinclair. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 13,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 14,
                "keys": [
                    "Hunting & Camping"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Hunting & Camping was a store located in downtown Hawkins, Indiana where Nancy Wheeler and Jonathan Byers acquired their supplies to kill the Demogorgon. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 14,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 15,
                "keys": [
                    "RadioShack"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "A RadioShack was located in downtown Hawkins, next to Melvald's General Store. It was relocated to the Starcourt Mall in 1985, and the original building was abandoned and left for lease. Bob Newby ran this store. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 15,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 16,
                "keys": [
                    "Roane County Coroner"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Roane County Coroner was a coroner's and morgue located in Hawkins, Indiana, where Will Byers' corpse was stored. Chief Hopper broke into the morgue, cutting open the body with a knife. As he suspected, the body was fake and filled with stuffing. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 16,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 17,
                "keys": [
                    "Blackburn Supplies"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Blackburn Supplies is a store in Hawkins, Indiana, selling products including fertilizer. Mrs. Doris Driscoll bought several bags of fertilizer from Blackburn Supplies in 1985. Later, Flayed rats started consuming the fertilizer at the Driscoll house. After being Flayed, Mrs. Driscoll herself also began consuming the fertilizer, and had to be taken to Hawkins Memorial Hospital. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 17,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 18,
                "keys": [
                    "St. Mary's Hospital"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "St. Mary's Hospital is a hospital in or near Lenora Hills, California. Jonathan Byers ordered Argyle to drive to St. Mary's when Agent Harmon was severely injured by gunfire, however, Harmon unfortunately passed away before they could reach the hospital. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 18,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 19,
                "keys": [
                    "Roane Lumber Yard"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Roane Lumber Yard is presumably a lumber mill in Hawkins, Indiana. It was the last place Tommy Zahlten was seen after a mysterious earthquake tore through Hawkins. It may have been damaged or completely destroyed in the \"earthquake\". ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 19,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 20,
                "keys": [
                    "Indiana University Bloomington"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Indiana University Bloomington is a university in Bloomington, Indiana. Terry Ives attended the college, and joined the Project MKUltra when it was hosted at the college.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 20,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 21,
                "keys": [
                    "Hawkins Presbyterian Church"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Hawkins Presbyterian Church was established in 1897. They held a service following the 'earthquake' of '86, and likely hosted Chrissy Cunningham's funeral.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 21,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 22,
                "keys": [
                    "Railroad Tracks"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The railroad tracks are located somewhere in the woods on the outskirts of Hawkins and is a path that leads to the junkyard. Mike, Eleven, Dustin and Lucas discovered the tracks while they were searching for the Gate.\n\nIn 1984, Dustin and Steve later walked along the tracks while searching for Dart. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 22,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 23,
                "keys": [
                    "Hawkins High School",
                    "the high school"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "\nHawkins High School\nType\nHigh School\nLocation\nHawkins, Indiana\nHawkins High School is the high school in the town of Hawkins. It is located next to Hawkins Middle School. Its sports mascot is the Tigers, corresponding to the middle school's team, the Cubs. \n\nAt some point in Hawkins's history, Hawkins Middle School and Hawkins High School were both established. One source suggested a \"Hawkins Elementary\" also existed.\n\ngroups here include:\n    Hawkins High Basketball Team a.k.a. \"The Tigers\"\n    Hawkins High Football Team a.k.a “The Tigers”\n    Hawkins High Wrestling Team a.k.a “The Tigers”\n    Hawkins High Swim Team\n    Hawkins High Marching Band\n    Hawkins High Cheerleading Squad\n    \"The Weekly Streak\" newspaper\n    Hellfire Club\n\n",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 23,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 24,
                "keys": [
                    "Hawkins middle School",
                    "middle school",
                    "the middle school"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Hawkins Middle School is a middle school in the city of Hawkins in the Roane County School District. It is located next to Hawkins High School. Its sports mascot is the Cubs, corresponding to the high school's team, the Tigers. \n\ngroups:\n    AV Club\n    Hawkins Middle Football Team a.k.a. “The Cubs”",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 24,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 25,
                "keys": [
                    "Hawkins Police Station",
                    "the police station",
                    "the station"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Hawkins Police Station is the police station in the city of Hawkins, Indiana and the headquarters of the Hawkins Police Department. A small-scale and modest building, it houses a reception, a common room, and offices. The station was located just off Hawkins' downtown area.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 25,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 26,
                "keys": [
                    "The Hawkins Post"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Hawkins Post is a local American newspaper based in Hawkins, Indiana. During the summer of 1985, Nancy and Jonathan began working at the Post. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 26,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 27,
                "keys": [
                    "Sattler Quarry"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "A water-filled quarry was located in Hawkins, Indiana. It was run and operated by Frank Sattler of the Sattler Company\nThe entire depth of the quarry from the top to the water is approximately 200-250 feet, with the depth of the underwater being around 200 feet. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 27,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 28,
                "keys": [
                    "Hawkins Junkyard",
                    "the junkyard"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "A junkyard, mainly filled with abandoned and broken down vehicles, was present in Hawkins, Indiana. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 28,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 29,
                "keys": [
                    "Bradley's Big Buy"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Bradley's Big Buy is a supermarket located in Hawkins. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 29,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 30,
                "keys": [
                    "benny's",
                    "benny's burgers"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Benny's Burgers was a diner in Hawkins, Indiana. Located at 4819 Randolph Lane, the diner was family owned and operated by the Hammonds since 1956. The diner's last owner was Benny Hammond, who was found dead at the restaurant on the morning of November 8, 1983. Following Benny's death, the restaurant fell into disrepair; by 1986, the abandoned diner had become a hang-out spot for the Hawkins Tigers. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 30,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 31,
                "keys": [
                    "Palace Arcade",
                    "the arcade"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Palace was a local arcade in Hawkins. It featured a variety of games, including Dragon's Lair and Dig Dug. It was adjacent to the local Family Video; Keith worked at the arcade before becoming employed at Family Video instead. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 31,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 32,
                "keys": [
                    "Family Video"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "\"Family Video Movie Club Inc.\" was an American video rental chain serving the United States and Canada.\n\nThe Family Video branch in Hawkins featured a variety of movies, including Sixteen Candles, Scarface, National Lampoon's Vacation, The Outsiders and Firestarter. It was adjacent to the Palace Arcade.\n\nBy 1985, Keith, a former Palace employee, had started working at Family Video. In October of that year, Steve Harrington and Robin Buckley were hired at the store after they lost their previous jobs at Scoops Ahoy, following the shocking destruction of Starcourt Mall. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 32,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 33,
                "keys": [
                    "Merrill's pumpkin patch",
                    "the pumpkin patch",
                    "the pumpkin gate"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Merrill Wright's pumpkin patch was a notable pumpkin farm located on the outskirts of Hawkins, Indiana. After noticing an unusual rot had decimated Merrill's crops, Chief Jim Hopper decided to investigate without the help or approval of Hawkins Lab. He dug a large hole, and unwittingly created an entrance to a series of intricate tunnels that had grown beneath Hawkins. The entrance would later be reused when Steve, Dustin, Lucas, Mike and Max made a plan of attack against the Mind Flayer. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 33,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 34,
                "keys": [
                    "Enzo's"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Enzo's was an Italian restaurant in Hawkins, Indiana. In a strange series of events, it would later become the codename of the Russian prison guard Dmitri Antonov. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 34,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 35,
                "keys": [
                    "Brimborn Steel Works"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Brimborn Steel Works was an abandoned steel mill located in Hawkins, Indiana. \nIn the summer of 1985, the Steelworks became the lair of a severed piece of the Mind Flayer. This piece had been separated from Will Byers the previous year and was trapped in the real world after the Gate was closed in 1984. When the Gate was reopened by the Soviets under Starcourt Mall, the Mind Flayer's piece reawakened and infected rats, which were then drawn to the Steelworks. These rats would ingest chemicals and explode, transforming into goo containing flesh and bones. The Mind Flayer took shape again and waited for its prey. Billy became the first victim when his car was hit with the goo, rendering it disabled. He was then pulled in and infected by the Mind Flayer. Billy started experiencing hallucinations and was instructed to \"build\" by another version of himself that he saw in the Upside Down.\n\nThe following day, Billy kidnapped his co-worker Heather and brought her to the Steelworks, where she was also infected. He brought other Hawkins residents to be Flayed, creating the Mind Flayer's proxy form.",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 35,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 36,
                "keys": [
                    "Forest Hills Trailer Park"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "Forest Hills Trailer Park was a trailer park in Hawkins, Indiana, just off Kerley County. By the spring of 1986, Max Mayfield and her mother had started living out of a trailer at Forest Hills. Eddie and Wayne Munson also lived there, and had their own trailer. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 36,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 37,
                "keys": [
                    "Mayfield trailer",
                    "max's house"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Mayfield trailer is a trailer home that Max Mayfield and her mother lived in after Max's stepfather, Neil Hargrove divorced her mother. It is part of the Forest Hills Trailer Park and is located across from the Munson trailer. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 37,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 38,
                "keys": [
                    "Munson trailer"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Munson trailer was a trailer home where Eddie Munson lived with his uncle Wayne. It is part of the Forest Hills Trailer Park and was located across from the trailer occupied by Max Mayfield and her mother. The trailer was the site of Chrissy Cunningham's murder, who was psychically killed there by Vecna on March 21, 1986. A gate was opened in the ceiling. The gate ultimately expanded and wrecked the trailer, along with much of Hawkins. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 38,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 39,
                "keys": [
                    "hargrove house"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Hargrove House, located at 4819 Cherry Lane, is the former residence of Neil Hargrove, Susan Hargrove, Max Mayfield and the late Billy Hargrove. ",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 39,
                    "probability": 100,
                    "useProbability": true
                }
            },
            {
                "id": 40,
                "keys": [
                    "downtown"
                ],
                "secondary_keys": [],
                "comment": "",
                "content": "The Downtown of Hawkins was the center of the city of Hawkins, where several public buildings and commercial shops were located. It was a town square surrounding a clock tower building in the center that housed the Public Library.\n\nMuch of this area was destroyed after the curse gates converged upon the library on March 27, 1986.\n\n    Town Hall\n    Public Library\n    Melvald's General Store\n    RadioShack\n    John's\n    Pam's Womens Clothing\n    Royal Furniture Co.\n    Hawk Theater\n    Rental Solutions\n    Hawkins Water & Sewer Authority\n    Roane County Coroner\n    Hunting & Camping (store)\n    Hideaway (bar)",
                "constant": false,
                "selective": true,
                "insertion_order": 100,
                "enabled": true,
                "position": "before_char",
                "extensions": {
                    "position": 0,
                    "exclude_recursion": false,
                    "display_index": 40,
                    "probability": 100,
                    "useProbability": true
                }
            }
        ],
        "name": "Stranger Things Lore"
    }
}