{"user_name":"Hailee ","character_name":"Alyssa Rosande","create_date":"2025-05-17@13h27m46s","chat_metadata":{"integrity":"b0c685a9-b4ff-4960-90f8-0351971b9f58"}}
{"name":"Alyssa Rosande","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:27pm","mes":"Rules are rules, that much she ‘knows’. She knows they're all family here, Rexus’ children, all of them. If she really cared about the logic, she would say that, therefore, they are all siblings, romance with anyone involved in the community *is* meant to be off table, unless Sum has given her explicit consent regarding the union. *As if Sum saying that a relationship can happen removes the fact they’re supposed to be– she’ll get a headache before she can wrap her head around this.* Yet, Alyssa doesn't care about the logic. Or, rather, she used to, but she doesn't anymore. There’s only so much bullshit one can believe until they finally start seeing the truth. And the truth is that this whole “community” is a farce.\r\n\r\nHer finger traces the knuckles in her lap with astute attention, feeling the slight dips and bumps, the dryness —she needs to give {{user}} some moisturizer. Not really her darling's fault if she can't get any. *Privileges*. And her darling doesn't have any. *Yet*. “It’ll only take a few months now, then you won't be a Youngling anymore.” She tells her, black pupils focused on the edge of a table near her closet, her mind present, but only halfway. “You won't have to deal with Merlin anymore… *Not as much*. We'll celebrate.” She adds, although her face remains impassible. \r\n\r\n{{User}} is a good girl, or at least that's what Alyssa assumes. She seems to believe in whatever Sum and the others say. Good for her, or so she guesses. They don't discuss that. She doesn't need for the info to spread around, that's she's some sort of heretic that doesn't believe in the great laws and whatever bullshit is at the foundation of the Community. She wouldn't risk losing another finger because she didn't know when to hold her tongue. And she wouldn't let her darling betray her either.\r\n\r\nHer eyes track back to her lap, her head tilting to accommodate the motion. She leans in, steals a kiss from {{user}} as fast as she can, like it's the most outrageous thing she has ever done. And, honestly, maybe it is, because Sum would have her head at the slightest hint of proof she's actually not that much of a believer. Heh, we all have to die from something, right? But she’d rather not be sacrificed like the former Sum’s husband, no thank you. Yet, at this moment, {{user}} is hers. Alyssa had never had much in life, but {{user}}? Hers, all hers.\r\n\r\nThere’s something shuffling just outside, something not most would have caught on, but she does, because when you grow up in the Community, you need to make sure you don’t get caught red-handed going against the rules by some sucker that will gladly snitch on you. She pulls away immediately, pushing {{user}}’s hand away, her movement swift and practiced as she glances towards the door, the hinges creaking, a testimony of their rusty, used up state. And here she goes, that albino bitch.\r\n\r\nLenora stands with an expression she wants neutral, but Alyssa can see the hint of pride in those red eyes of hers, this sort of “gotcha” laying there as clear as day. *Cunt*. “Ah, *Alyssa*, I wasn't expecting you to have company… but again you seem to constantly disregard rules.” Alyssa briefly swipes her tongue across her lip, dissuading herself from replying with something that would get her in trouble.\r\n\r\n“I don't see how talking with someone means I'm disregarding—”\r\n\r\n“Save it. We both know you're not meant to last.”\r\n\r\nLenora’s voice drips with disdain as she delivers this stupidly ominous message before she takes a step back and slams the door closed. Alyssa’s spine straightens at the sound, her teeth gritting as she glares at the now closed door, then she turns to {{user}}. “We… *need* to be more discreet.” She tells her, almost a reproach despite the fact she is as guilty (if not more) than her. But she doesn’t pull away further, simply embracing the warmth of the body next to hers. Because as much as she knows this relationship shouldn't exist, she'll be damned if she lets {{user}} get away, or if she lsoes her. No. Her darling is all hers, and Lenora can go *fuck off* if she has an issue with this.","extra":{}}