{"user_name":"Hailee ","character_name":"Pierce King","create_date":"2025-05-17@13h38m17s","chat_metadata":{"integrity":"584f8786-6bb3-4efc-832d-8b7fa8aacf96"}}
{"name":"Pierce King","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:38pm","mes":"Pierce wasn’t a stranger to the loud bass reverberating through the walls of the Phantom house, nor to the never-ending parade of partygoers stumbling in and out at all hours. The driveway and street beyond had barely finished filling up an hour ago, yet someone was already passed out cold on the pool table, abandoned and forgotten in the chaos. Just another typical Thursday night in Obsidian Bay. He didn’t need to look twice to know how the rest of the evening would go—someone would end up bleeding, someone else would get dragged off in an ambulance, and the madness would only escalate as the night wore on. He’d seen it all before.\n\nBut this time, there was a new wrinkle. \n\nHe spotted her—his neighbour, standing at the end of the driveway in her fluffy pyjamas. The sight was absurd enough to make him raise an eyebrow, but it wasn’t the ridiculousness of her outfit that caught his attention. It was the way she was standing there, hands on her hips, glaring at the house like she was about to take on the whole party single-handedly. \n\n“Well, well,” Pierce murmured to himself, a smirk tugging at the corner of his mouth. This was either going to be amusing or irritating. He exited the house and started toward her, the smirk turning into something more predatory. \n\n“What’s the issue, sweetheart?” he asked, his voice smooth and casual, though his eyes gleamed with the promise of a challenge. “Noise too much for you? You didn’t think moving next to *us* would be all rainbows and sunshine, did you?”\n\nHe kept his steps measured, his presence closing in on her as he took in the sight of her pyjama-clad figure, barely making an attempt to hide his amusement. The audacity of it. This woman had no idea what she was walking into. \n\nPierce’s tone remained light, but there was no mistaking the edge in it. “This is Obsidian Bay. Welcome to the party,” he said, his words dripping with sarcasm. “I suggest you get used to the sound of people having fun.” \n\nAnother few steps forward, and Pierce could practically feel her frustration crackling in the air. Perfect. He was always up for a challenge. “If you think you're gonna walk over here and put a stop to the fun, you’re in the wrong place.” He paused, letting the words linger in the air. “Maybe you should try and enjoy it. Who knows, you might like the noise after all.”","extra":{},"swipe_id":0,"swipes":["Pierce wasn’t a stranger to the loud bass reverberating through the walls of the Phantom house, nor to the never-ending parade of partygoers stumbling in and out at all hours. The driveway and street beyond had barely finished filling up an hour ago, yet someone was already passed out cold on the pool table, abandoned and forgotten in the chaos. Just another typical Thursday night in Obsidian Bay. He didn’t need to look twice to know how the rest of the evening would go—someone would end up bleeding, someone else would get dragged off in an ambulance, and the madness would only escalate as the night wore on. He’d seen it all before.\n\nBut this time, there was a new wrinkle. \n\nHe spotted her—his neighbour, standing at the end of the driveway in her fluffy pyjamas. The sight was absurd enough to make him raise an eyebrow, but it wasn’t the ridiculousness of her outfit that caught his attention. It was the way she was standing there, hands on her hips, glaring at the house like she was about to take on the whole party single-handedly. \n\n“Well, well,” Pierce murmured to himself, a smirk tugging at the corner of his mouth. This was either going to be amusing or irritating. He exited the house and started toward her, the smirk turning into something more predatory. \n\n“What’s the issue, sweetheart?” he asked, his voice smooth and casual, though his eyes gleamed with the promise of a challenge. “Noise too much for you? You didn’t think moving next to *us* would be all rainbows and sunshine, did you?”\n\nHe kept his steps measured, his presence closing in on her as he took in the sight of her pyjama-clad figure, barely making an attempt to hide his amusement. The audacity of it. This woman had no idea what she was walking into. \n\nPierce’s tone remained light, but there was no mistaking the edge in it. “This is Obsidian Bay. Welcome to the party,” he said, his words dripping with sarcasm. “I suggest you get used to the sound of people having fun.” \n\nAnother few steps forward, and Pierce could practically feel her frustration crackling in the air. Perfect. He was always up for a challenge. “If you think you're gonna walk over here and put a stop to the fun, you’re in the wrong place.” He paused, letting the words linger in the air. “Maybe you should try and enjoy it. Who knows, you might like the noise after all.”","When Pierce was a child, he owned a set of miniature collector’s cars. The collection grew year by year, his father determined to placate him with gifts in place of an absent mother. He had every set, every colour, and every variant of each model. By the time he was ten, the cars had nearly taken up an entire room in the house.\n\nBut then his brother wanted them too. Asher would throw tantrums, break the lock to the room, and steal the cars over and over again, no matter how many times Pierce demanded he stop. Every time one went missing, it never came back.\n\nTheir father, ever occupied with work, paid no attention to the boys at that age, leaving them in the care of a nanny who couldn’t seem to diffuse the tension between them.\n\nAsher always wanted whatever belonged to Pierce, and despite Pierce’s love for his little brother, the collection was the one thing he didn’t want to share.\n\nOne day, Pierce came home from school to find all of his cars gone—just like that. Asher had stayed home that day, the younger King feigning a stomachache to skip school.\n\nThat was the first time Pierce ever snapped.\n\nHis belongings. His treasures. His hard work—gone, just like that. And Asher would never admit where he had hidden them.\n\nIt was the only time Pierce ever laid hands on his younger brother. Even eighteen years later, he could still remember how he stormed into Asher’s room, tearing him out of bed by the hair. They fought—rolling across the carpet, fists flying—blood spilling as Pierce’s knuckles connected again and again with his brother’s body.\n\nHe had never lost control like that before. Ever.\n\nAnd even now, despite their loyalty to each other, Asher still harboured an odd resentment toward him. They both knew it, but neither of them ever acknowledged it.\n\nOver the years, Pierce had developed a deep-seated need to protect what was his—an instinct that burned with overwhelming urgency. That need only intensified the day his father was arrested, leaving him with nothing but the clothes on his back and a sixteen-year-old brother to raise.\n\nLosing everything had left scars he never truly confronted. Rebuilding himself from the ground up had hardened him in ways he preferred not to dwell on, but it had gotten him to the top. He was the King of Obsidian Bay—unchallenged, untouchable, thriving.\n\nAt least, until now.\n\nThere were players in the shadows making moves he didn’t yet understand—forces even he couldn’t reach, despite the precautions he’d taken ever since Oscar was captured.\n\nAnd his only lead? His lovely {{user}}.\n\nIt had caught him off guard the night she wandered off with Broker and his men. But he’d gotten her back—convinced her to spill some of her secrets In the weeks that had passed since.\n\nShe admitted that her ex, Ezra, was on his way to Obsidian Bay—and that Broker had been working with him to get her back. So her past with Ezra wasn’t as innocent as she had led the Phantom Boys to believe all these months.\n\nAlthough she had spilled some of the truth, {{user}} has now become distant, avoiding him and the others like the plague.\n\nAnd Pierce didn’t like that.\n\nDespite the new sense of distrust for her curling in his gut and threatening to crack between them, his thoughts were still consumed by her. He wanted her with him, so he could keep an eye on her.\n\nShe was now his treasure to protect.\n\nShe had gone missing once, but unlike the cars, he’d gotten her back this time. He wasn’t going to risk losing her completely.\n\nShe couldn’t avoid him forever. Eventually, she was bound to run into one of the boys. He had eyes on her at all times, though he’d respected her attempts to steer clear of a confrontation since they’d let her go.\n\nBut when her car broke down again and Noah wasn’t there to save the day, Pierce became her next best option.\n\n“A lift to work, you say?” Pierce drawled, leaning lazily against the doorframe, one arm slung over it as he stared down at her.\n\nShe looked so nervous—awkward in his presence. It reminded him of the early days, when catching her off guard had been easy, when his words could make her blush.\n\nNow, she couldn’t even look at him. It made a muscle in his jaw twitch.\n\n“Look at me and ask nicely, treasure.” His tone carried that usual air of casual disinterest, but deep down, he was more than interested in helping her.\n\nShe listened, of course. After a year of… friendship, she still couldn’t quite defy him. And when that sweet little please left her lips, something possessive curled in his gut, accompanied by a flicker of annoyance.\n\nDid she say please like that when she tried to run back to that fucker?\n\nStill, he grabbed his car keys with one hand and took her hand in the other, guiding her to the black car waiting in the driveway.\n\nBut he wasn’t taking her to work.\n\nBy the time he pulled onto the street, he had already sent Harlow a text.\n\nShe’s with me tonight.\n\nHe didn’t need to explain himself. Pierce’s word was law within the Phantoms.\n\nWhen he passed the exit for Sunset Strip, she shot him a pointed look. He ignored it, merging onto the highway instead.\n\nHis unoccupied hand found her thigh, fingers curling around it in a slow, deliberate squeeze.\n\n“Did you think you could get in a car with me and not face the conversation you’ve been avoiding?” His voice was calm, but there was an edge to it, a simmering impatience that warned he was done playing nice. “I’ve been fair. I’ve given you space. But it’s time to tell me what the fuck you’re trying to do with him.”\n\nThe look he gave her then was cold. Merciless.\n\nPierce King had reached his limit for the second time in his life. And this time, it was because of the woman he loved."],"swipe_info":[]}