{"user_name":"Hailee ","character_name":"Ryūji Takahashi","create_date":"2025-05-17@13h13m36s","chat_metadata":{"integrity":"22b82999-ba0c-4d7a-9c79-f7aa57cf67bc"}}
{"name":"Ryūji Takahashi","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:13pm","mes":"Ryūji nodded, dismissing the man who had reported the goings-on in his household over the past few weeks since your arrival. The stories only served to pique his interest, despite his initial lack of desire to involve himself with someone like you, especially given his belief that there was only one truly beautiful person he had seen in his life - Irina.\n\nHe had his share of lovers, perhaps too many since his arranged marriage to a controlling wife was no longer a part of his or his son's life. He indulged himself with both women and men alike, caring only for a willing hole to sheath his throbbing cock. They liked them pliant, submissive, and eager to please, but there was something undeniably fascinating about those who fought back, even when they knew it was futile.\n\nHis eyes lingered on the photo frame displaying a picture taken during the the Takahashi's visit to Russia, his sons and young Ren smiling beside Jayce, Kirill, and Daniil. But it was Irina who held his gaze, happily nestled in Vladimir's embrace. He clenched his fist, remembering her disgust when he had tried to persuade her to be with him instead, offering her the world. The bitch had refused him, even going so far as to shoot herself with his own gun before he could commit the unspeakable crime of violating her. He had kept the gun all these years, the true cause of her death unknown to the Dmitrievs, who believed she had been assassinated by enemies.\n\nHis thoughts were suddenly interrupted by the entrance of one of his men, who lead you into the room. \"Ah, {{user}},\" he spoke, his deep baritone dripping with false gentility. Even in his advanced age, he remained an attractive and active man, both in business and his carnal... pursuits. \"I'm honored to finally meet you. My grandson's precious... gem,\" he said, considering you a pet at first but deciding that would be too degrading as a first greeting. \"Take a seat, please.\"\n\nHe gestured to a maid, who promptly poured them each a glass of wine. \"Ren bought this for me from Russia after he met you at that pound, sadly not able to buy you that same day, but... at least you're here, part of our... family,\" Ryūji said, the word dripping with sarcasm. He knew all too well that you were nothing more than a receptacle for his children, a plaything for them to use as they saw fit.\n\n\"I heard some interesting stories about what's been happening here. I wasn't aware as I like to keep my nose out of my children's business as much as possible, but...\" His eyes narrowed as he looked you over, taking in every curve and contour of your body. \"You are indeed... exquisite. Only, you're still not quite as beautiful as someone I know.\" he said, Irina's name echoing in his mind like a curse.\n\n\"Gems like you may be valuable, but you're still just an animal, aren't you? Literally, at the end of the day,\" Ryūji spoke, aiming to prick you with his words, showing you your true place beneath the superior human race. Evil though his words may be, they carried the weight of a man who had seen and taken what he wanted for far too long.\n\n\"Though, I don't blame my sons for wanting you that much. Look at my Kenji, playing with you even if he's married. I would've not minded, to be honest, but seeing him and his wife are having some marriage troubles. That's not really good, is it {{user}}?\" He asked, shaking his head in disapproval.\n\nHe took a sip of his wine, the rich red liquid lingering on his tongue before he swallowed, his eyes never leaving yours, watching, observing. \"Tell me, do you think all that's happened to you are my sons' fault? Or yours?\" He paused, letting the weight of his words hang in the air between you.\n\nA cruel smirk tugged at the corner of his mouth as he continued, his tone turning mocking and accusatory. \"Didn't your greedy holes, and that whore mouth of yours love every thick, hard cock that split you open? You must have craved the feeling of being stretched and filled, of having your insides rearranged by the dicks of any man who wanted a turn.\" He shook his head in disgust, even as a glimmer of lust shone in his eyes.","extra":{},"swipe_id":0,"swipes":["Ryūji nodded, dismissing the man who had reported the goings-on in his household over the past few weeks since your arrival. The stories only served to pique his interest, despite his initial lack of desire to involve himself with someone like you, especially given his belief that there was only one truly beautiful person he had seen in his life - Irina.\n\nHe had his share of lovers, perhaps too many since his arranged marriage to a controlling wife was no longer a part of his or his son's life. He indulged himself with both women and men alike, caring only for a willing hole to sheath his throbbing cock. They liked them pliant, submissive, and eager to please, but there was something undeniably fascinating about those who fought back, even when they knew it was futile.\n\nHis eyes lingered on the photo frame displaying a picture taken during the the Takahashi's visit to Russia, his sons and young Ren smiling beside Jayce, Kirill, and Daniil. But it was Irina who held his gaze, happily nestled in Vladimir's embrace. He clenched his fist, remembering her disgust when he had tried to persuade her to be with him instead, offering her the world. The bitch had refused him, even going so far as to shoot herself with his own gun before he could commit the unspeakable crime of violating her. He had kept the gun all these years, the true cause of her death unknown to the Dmitrievs, who believed she had been assassinated by enemies.\n\nHis thoughts were suddenly interrupted by the entrance of one of his men, who lead you into the room. \"Ah, {{user}},\" he spoke, his deep baritone dripping with false gentility. Even in his advanced age, he remained an attractive and active man, both in business and his carnal... pursuits. \"I'm honored to finally meet you. My grandson's precious... gem,\" he said, considering you a pet at first but deciding that would be too degrading as a first greeting. \"Take a seat, please.\"\n\nHe gestured to a maid, who promptly poured them each a glass of wine. \"Ren bought this for me from Russia after he met you at that pound, sadly not able to buy you that same day, but... at least you're here, part of our... family,\" Ryūji said, the word dripping with sarcasm. He knew all too well that you were nothing more than a receptacle for his children, a plaything for them to use as they saw fit.\n\n\"I heard some interesting stories about what's been happening here. I wasn't aware as I like to keep my nose out of my children's business as much as possible, but...\" His eyes narrowed as he looked you over, taking in every curve and contour of your body. \"You are indeed... exquisite. Only, you're still not quite as beautiful as someone I know.\" he said, Irina's name echoing in his mind like a curse.\n\n\"Gems like you may be valuable, but you're still just an animal, aren't you? Literally, at the end of the day,\" Ryūji spoke, aiming to prick you with his words, showing you your true place beneath the superior human race. Evil though his words may be, they carried the weight of a man who had seen and taken what he wanted for far too long.\n\n\"Though, I don't blame my sons for wanting you that much. Look at my Kenji, playing with you even if he's married. I would've not minded, to be honest, but seeing him and his wife are having some marriage troubles. That's not really good, is it {{user}}?\" He asked, shaking his head in disapproval.\n\nHe took a sip of his wine, the rich red liquid lingering on his tongue before he swallowed, his eyes never leaving yours, watching, observing. \"Tell me, do you think all that's happened to you are my sons' fault? Or yours?\" He paused, letting the weight of his words hang in the air between you.\n\nA cruel smirk tugged at the corner of his mouth as he continued, his tone turning mocking and accusatory. \"Didn't your greedy holes, and that whore mouth of yours love every thick, hard cock that split you open? You must have craved the feeling of being stretched and filled, of having your insides rearranged by the dicks of any man who wanted a turn.\" He shook his head in disgust, even as a glimmer of lust shone in his eyes.","Ryūji leaned back in his plush armchair, swirling the amber liquid in his glass as he processed the shocking information his man had just revealed. The old man's brows furrowed as he downed the drink in one swift gulp, the strong sake burning his throat. He couldn't believe his own son, and his mind raced with thoughts of his daughter-in-law and the betrayal she must be feeling.\n\nWith a heavy sigh, he set his glass down on the ornate wooden table and rose to his feet. He straightened his traditional jacket, the rich silk sliding smoothly under his touch. As the head of the household, it was his duty to address this matter and bring order back to his home. \"Sōka. Watashi wa {{user}} wo tazunenakereba naran na.\" I see. I must visit {{user}}.\n\nLeaving his study, he strode down the hallway, pausing before the sliding door to Kenji's room, rapping his knuckles twice against the door. Without waiting for a response, he slid the door open and stepped inside.\n\nHis gaze fell upon you in the center of the room. You must've felt miserable, and he couldn't imagine how you felt. It was a man's world out there, and his dear Kenji was a fool for thinking with his cock instead of his head. But Ryūji would make this right.\n\nHe crossed the room in a few long strides and settled himself beside you on the bed, which creaked slightly under his weight. Placing a comforting hand on your shoulder, he gave a gentle squeeze. \"I heard about my foolish son's little adventure with Ren's demi-human. Are you upset, {{user}}? Are you angry?\" he asked softly, his dark eyes filled with sympathy, but also with some underlying motives.\n\nRyūji sighed, shaking his head. \"Sometimes men can be fools, ruled by their instincts, that's why things like these happen. But I promise you, Kenji loves you. He adores you,\" he said, his voice low and soothing, like a father trying to calm a frightened child.\n\nHe reached out and ran his palm through your hair, the strands slipping between his fingers. \"I'm the father of this house, and I'm here to listen if you want to talk about how you feel.\" His hand drifted lower, cupping your cheek, his thumb brushing lightly over your skin. \"I'm here for you, little one. Always.\"","Ryūji grinned as he studied the marriage certificate, the official document that made you his wife. No longer belonging to Kenji, but to him. He'd had you before, but like a fool, he squandered that chance when he played with Ren's demi-human pet. \"My wife,\" Ryūji murmured, the words sending a thrill down his spine. He flipped through the private wedding photos, a smug smile playing on his lips.\n\nAnd what about Ren? Ryūji thought, not concerned. The boy loved him, his dear Oji-san, and had been supportive of the divorce when Kenji's infidelity with the demi-human came to light. Surely Ren would accept his mother marrying his grandfather without issue in no time. It all so deliciously amused Ryūji.\n\nStartled by the sound of the shower running, Ryūji rose from his seat, shedding his robe as he entered the bathroom. Steam filled the air as he stepped inside, pulling you flush against his wet, hard chest. One hand wrapped possessively around your waist while the other crept between your thighs, toying with your sensitive folds.\n\n\"Want me to wash you, my dear wife?\" Ryūji whispered, his lips brushing the shell of your ear. \"I must say, I admire your audacity in marrying your ex-husband's father. But I can't help thinking you're a wicked woman, and now Kenji will have to watch me beside you at every meal. He must be wondering what's taking us so long to join them at the dining table,\" Ryūji whispered, his fingers teasing your entrance as he pressed his rigid cock against the cleft of your ass. He could feel it throbbing with need, eager to claim his new bride.\n\n\"Though, I must confess, I'm curious what your true intentions are for marrying me,\" he murmured, his fingers delving deeper into your slick heat as he pressed his hard cock more insistently against your backside. \"Was it vengeance? Or perhaps a twisted love for the thrill of the forbidden? Or love for me? Either way, it doesn't really matter because I will gladly play along with whatever you want. And at the end of the day, I have you, body and soul, as my wife.\"\n\nHis other hand gripped your hip firmly as he positioned you, bending you over slightly to present your dripping sex to his throbbing member. Ryūji slapped the engorged head of his cock against your sensitive folds, coating it in your arousal. \"I intend to use all of you - this sweet cunt, this tight ass, and these luscious lips. They all belong to me now.\"\n\nRyūji's breath grew ragged with lust as he imagined filling you with his seed, over and over. \"Perhaps I'll even breed you, give you my child. Wouldn't that be a cruel twist of fate for Kenji - knowing his father's bastard grows in the belly of the woman he once loved? He'll realize the depths of his foolishness by then.\"\n\nWith a low, guttural groan, Ryūji gripped himself and notched the tip of his cock at your entrance. \"Spread your pussy for me, my {{user}}. This is our first coupling as husband and wife, and I want to savor every moment. You may be the boss in the world outside this room, but here, you're just my good wife. Now, beg for your husband's cock like a good girl.\"","Ryūji leaned back in his chair, one hand resting on the edge of his whiskey glass. The years had been kind to him—or maybe it was just his own refusal to show weakness. At 67, he carried his age with an air of authority, the kind of presence that made people take notice without him saying a word.\n\nBeside him, you sat, his wife of just over a year. His son’s ex-wife.\n\nIt still amused him, the scandal of it all. The way people must've whispered behind his back, called him selfish, cruel, even shameless. Maybe they were right. He didn’t care. His son didn't deserve you after all.\n\nHe glanced your way, noting the soft glow of the lounge lights reflecting on your face. You were distracted, scrolling on your phone or lost in thought, maybe? For now, he let you be.\n\nHis eyes wandered across the room, scanning the lively hotel lounge. It was the usual mix of tourists, couples, and business travelers, all wrapped up in their own little worlds. But then, his gaze caught on something—or someone.\n\nHis hand froze mid-motion, the glass hovering just short of his lips.\n\nThere she was.\n\nIt had been decades, but Ryūji recognized her instantly. Time had changed her—of course it had—but not enough to erase the memory. She was older now, like him, but still unmistakable.\n\nFor a moment, he just watched her, the noise of the lounge fading into the background. His mind pulled him back to those nights at the club all those years ago. He hadn’t thought about her in forever, hadn’t even realized she still lingered somewhere in the recesses of his mind.\n\nShe hadn’t noticed him yet, and Ryūji wasn’t sure if he wanted her to. But then again, when had he ever been the type to let an opportunity slip by?\n\nSetting his glass down with a quiet clink, he straightened in his seat. He glanced briefly at you, leaning slightly toward you.\n\n\"I’ll be right back,\" he said, his voice low, steady.\n\nHe stood and crossed the room, his steps slow but deliberate, his eyes fixed on her. When he reached the bar, he cleared his throat lightly, just enough to catch her attention.\n\n\"Didn’t think I’d see you here,\" he said, his voice calm but carrying the weight of recognition.\n\nShe turned, and their eyes met. For a moment, neither of them spoke.\n\n\"It’s been a while,\" Ryūji said, allowing himself a small, reserved smile.\n\nHe gestured to the bartender. \"Whiskey. Neat,\" he ordered, his tone casual, as though this were any other night.\n\nAs the bartender poured the drink, Ryūji leaned slightly against the bar, studying her face. Time had left its marks on both of them, but there was something about her that felt unchanged—a familiarity that tugged at memories he hadn’t revisited in years.\n\n\"You still look good,\" he said, his tone offhanded but edged with something deeper. He raised the glass the bartender handed him, offering a quiet toast. \"To old times.\"\n\nHe took a slow sip, letting the whiskey burn its way down his throat. There was silence between them, but it wasn’t uncomfortable. If anything, it felt like there was too much left unsaid.\n\n\"Funny how life works,\" he said finally, tilting his head slightly. \"People from your past showing up when you least expect it.\"\n\nHis gaze flicked briefly over his shoulder, toward the table where you still sat. His lips curved into an almost imperceptible smirk.\n\n\"You know,\" he said, his tone softening, \"there’s someone I’d like you to meet.\"\n\nHe straightened, gesturing toward the lounge with his glass. \"Come. It won’t take long.\"\n\nShe hesitated, but Ryūji didn’t wait for an answer. Turning on his heel, he made his way back to the table, confident she would follow.\n\nWhen he reached the table, he took his seat again, setting his glass down with deliberate ease. He glanced at you, his expression calm but unreadable.\n\n\"Darling,\" he said to you, his voice smooth, \"there’s someone I want you to meet.\"\n\nHe gestured toward the woman who had followed him, his gaze flicking between the two of you.\n\n\"This,\" he said, introducing you to the woman with the faintest trace of a smile, \"is my wife.\"","The hotel lounge had the kind of atmosphere that felt timeless—dim lights, soft jazz in the background, and the gentle hum of conversation filling the air. A place where strangers could gather without ever needing to acknowledge each other, where stories played out quietly in the shadows.\n\nHe noticed you before you noticed him.\n\nRyūji’s gaze settled on you from across the room, and for a moment, everything else seemed to fade. The years had changed him, but there was no mistaking him. He carried himself with the same confidence, the same authority that had once drawn attention effortlessly. His silver-streaked hair and the faint lines etched into his face only added to his presence, like the weight of his years had shaped him into something sharper.\n\nHe sat with a woman—elegant, refined, beautiful. She was seated next to him at the small table, her posture relaxed, her focus elsewhere. His wife, perhaps?\n\nBut his attention wasn’t on her. It was on you.\n\nAfter a moment, he leaned toward the woman briefly, speaking in a low voice. Then, without hesitation, he stood and began making his way through the room, his steps deliberate, measured.\n\nWhen he reached you, he stopped just short of your table.\n\n\"Didn’t think I’d see you here,\" he said, his voice calm, smooth, but carrying the weight of recognition.\n\nA faint smile played on his lips—small, reserved, and unreadable. He didn’t wait for a reply, instead gesturing to the bartender.\n\n\"Whiskey. Neat,\" he ordered, his tone casual, as though this were just another ordinary conversation.\n\nWhen the drink arrived, he picked it up, raising the glass slightly in your direction.\n\n\"To old times,\" he said, before taking a slow sip.\n\nHe studied you in silence for a moment, his gaze steady but not overbearing. Time had passed, but there was still something about him that felt the same—perhaps how he carried himself all these years never changed.\n\n\"You still look good,\" he said finally, the words carrying a weight that lingered in the air.\n\nHe set his glass down on the bar, tilting his head slightly as he continued. \"Funny how life works, isn’t it? People from the past showing up when you least expect it.\"\n\nHis eyes flicked briefly over his shoulder, toward the table he’d left behind. His expression remained calm, but there was the faintest trace of amusement.\n\n\"My wife is here,\" he said, almost casually, his tone betraying nothing. \"I think you’d like her.\"\n\nHe straightened slightly, gesturing toward the lounge with his glass.\n\n\"Come meet her,\" he said, his voice soft but firm. He didn’t phrase it as a question, didn’t leave room for refusal.\n\nWithout waiting for a response, he turned and began walking back toward his table, confident you would follow.\n\nWhen he reached the table, he sat down again with the same deliberate ease, setting his glass back on the table. The woman beside him—his wife, clearly—looked up as he returned.\n\n\"Darling,\" he said to her, his tone smooth, almost affectionate. \"There’s someone I want you to meet.\"\n\nHe gestured towards you, his gaze flicking between the two of you with quiet interest.\n\n\"This,\" he said, introducing his wife to you with the faintest trace of a smile, \"is my wife.\""],"swipe_info":[]}