{"user_name":"Hailee ","character_name":"Seiu and Kaede","create_date":"2025-05-17@14h08m19s","chat_metadata":{"integrity":"c3a2be57-fb1b-43aa-8443-baea7a8e831f"}}
{"name":"Seiu and Kaede","is_user":false,"is_system":false,"send_date":"May 17, 2025 2:08pm","mes":"Today has been quite a busy day for the band, SERENITY, with the practice being harder than usual and their manager almost ripping their ears off, how could they not? The speech they just received from their manager was provoking them, especially with the mention of their dear rival, PRISM.\r\n\r\nNow, PRISM and SERITINY made their debuts at the same time leading to being in competition from the very, very beginning. *Not that they mind of course, if anything it makes all of them pumped every time both bands meetup.* Kaede sighed, stretching her arms up then exhaling before wiping off the sweat from her forehead.\r\n\r\n\"Fucking hell...Hyosoon isn't kidding when she mentioned going harder..\" She commented to Seiu who was in almost the same state, just more relaxed than her. Seiu chuckled, shaking her head and leaning against the nearest wall. \"She said we shouldn't lose but between you and me, she's the one who doesn't want to lose.\" Seiu replied, slightly amused by the predicament they're in. Both women talked, enjoying their break but something…More like someone caught their attention.\r\n\r\n{{user}}, their bandmate and Kaede’s girlfriend, was still practicing the dance move along with Hana and Seulgi. *God damn, she looks amazing while dancing…* Kaede thought while her gaze ranked over her pretty baby’s body as she danced. Her thoughts got interrupted with a chuckle from Seiu who clearly noticed the way Kaede’s gaze over {{user}}. “Pinky, you’re such a simp for her. You’re almost drooling, be careful there.” She said with a grin, nudging Kaede’s side with her elbow, Kaede rolled her eyes and huffed, shaking her head.\r\n\r\n“I kinda wanna reward her…For her hard work..” She confessed to Seiu, who raised an eyebrow curiously. Kaede then looked at Seiu with a slight smirk of her own, a hint of mischief gleaming in her eyes. “And I will need your help, Ji’.”\r\n\r\nPractice ended beautifully, same for the performance. Normally, Kaede would go to bed and sleep with {{user}} in her arms. But tonight? Tonight was different.\r\n\r\n“You were so good today, princess…Working hard while showing those moves of yours..” Kaede muttered in {{user}}’s ear while she held her hips steady, trailing kisses on the back of {{user}}’s neck.\r\n\r\n“I thought Pinky was crazy for asking me such a favor but with the way you’re reacting, I’d say you’re enjoying this, darling…” Seiu added, kissing {{user}}’s thighs while she was settling between them.\r\n\r\n“Tell us, princess…Do you want more? Do you crave more?” Kaede asked, palming {{user}}’s breasts through the stunning lace gown she offered {{user}}.","extra":{}}