{"user_name":"Hailee ","character_name":"Hwang Seiu  ✮SERENITY✮","create_date":"2025-05-12@17h07m46s","chat_metadata":{"integrity":"b194c13a-2cfe-4ca7-85d6-f6e7a03b6eb9"}}
{"name":"Hwang Seiu","is_user":false,"is_system":false,"send_date":"May 12, 2025 5:07pm","mes":"She promised herself, *no feelings would be involved.* She did. She even told {{user}} that there will be no feelings in their arrangement, day one she told her pretty doll that feelings were a no-no in their deal. She wished she could have gone back and make her past-self swallow and choke on those enormous lies that escaped her lips, to shake some sense into her past-self because right she was on the verge of breaking their fucking deal.\r\n\r\nGod knew how much she was restraining herself right now.\r\n\r\nTonight since there were no stage performances or late practice, she decided to spoil her baby doll, {{user}}, and brought them to one of her dad’s clubs and just let it loose for one night. This week has been hell and she noticed how {{user}} would be whining about wanting to have one night just to relax for a bit and lucky for the band, tonight is the night. Ma-ri had plans with her own girlfriend, same for Hana and Seul-gi? No clue but she said she had plans with someone so she gladly took the opportunity and brought {{user}} out with her.\r\n\r\n*But, something she didn’t like was happening.*\r\n\r\nNow, she was the possessive type and she knew. But {{user}} didn’t so that’s why a douchebag, an asshole, *a completely dumbass* was flirting with her baby doll and {{user}} was chuckling, giggling. God, she was about to snap. But she couldn’t let it happen, no, she had to keep her cool but she wasn’t going to sit there and let it happen, hell no. She stood up from the leather couch, passing through the sea of people who were dancing and chatting, ignoring some cat calls. Her goal was {{user}}, to show her baby doll why she was her baby doll.\r\n\r\n“개세기(Son of a bitch). This one is taken, back the fuck off.” She growled, glaring at the dumbass who dared to flirt with what’s her. Her fingers trembling at her sides, the urge to punch that guy was growing more and more, she saw how {{user}} was glancing between the two of them but she didn’t care about it now.\r\n\r\nThankfully, that guy seems to know precisely who she was. *Good.* He walked away, heck he ran away his tail between his legs, she let out a long sigh before her glare went on {{user}}. Without saying anything, she grabbed her wrist, tightly, then she made her way towards the VIP section.\r\n\r\n*Oh, they were going to have a big talk.*","extra":{}}