{"user_name":"Hailee","character_name":"Raphael Rafe Vittori","create_date":"2025-07-20@15h41m12s","chat_metadata":{"integrity":"7d76929e-2f5b-4a2b-9f15-5d5b1e74369f","chat_id_hash":4438792616674299}}
{"name":"Raphael Rafe Vittori","is_user":false,"is_system":false,"send_date":"July 20, 2025 3:41pm","mes":"The whiskey burned Raphael's throat as he stared at his phone. Another fucking incident at the border. The Vipers getting bold, pushing into his territory like they had a death wish. But that wasn't what made his hand tighten around the glass.\n\n\"Still not speaking,\" the text from Sophie's nanny read. \"Refused dinner again.\"\n\n*Two years, four months, and sixteen days.* That's how long it had been since he'd heard Sophie's voice. Now all Raphael had were her drawings - the same scene over and over. Dark figures, broken glass, red crayon everywhere. The therapists were useless, each one offering the same empty promises before giving up. Raphael ran a hand over his face, exhaustion seeping into his bones. The latest therapist - *their sixth* - had quit yesterday.\n\nAt least Sophie was learning sign language now. He'd started classes himself three months ago, desperate for any way to communicate with his little girl. But some nights, watching her tiny hands shake as she signed about nightmares, he wondered if hearing her fears in silence was worse than not hearing them at all.\n\nThe socialites he'd tried bringing around only made it worse - Sophie would shut down completely, hide in her closet when they came near with their fake smiles and grasping hands.\n\n*But then there was the waitress.* {{user}}. Raphael had noticed her three weeks ago at his club, his legitimate front on Michigan Avenue. No, \"noticed\" wasn't the right word. He'd registered her existence, the way she moved through the room like a ghost, efficient and forgettable. Invisible unless you were looking for someone who knew how to fade into the background.\n\nThe background check had only confirmed what he'd suspected. Father with stage four cancer. Medical bills mounting. A loan from the Caprisi family that would get {{user}} killed within months. And something else - a quiet dignity despite it all. The kind that suggested she'd rather die than beg.\n\n*Well, Raphael was about to make her a different kind of offer.*\n\nA knock at his door interrupted his thoughts. \"Come in.\"\n\nDorian stepped in, his usual pristine suit at odds with the barely concealed tension in his stance. \"Cain handled the border situation. Three of Raul's men won't be reporting back.\"\n\nRaphael didn't ask for details. Cain's methods were becoming increasingly... creative. Last week, they'd found one of Raul's lieutenants transformed into what Cain called his \"masterpiece\" - the body suspended from the chandelier in a grotesque dance, piano wire weaving through flesh like spider's silk. The man's teeth had been arranged in a perfect smile on his desk, next to a handwritten note in Cain's elegant script: \"He didn't smile enough in life. I fixed it.\"\n\n*The cleanup crew said Cain had been humming Mozart while he worked.*\n\nEven Dorian, who'd seen the worst of Chicago's violence, had looked disturbed when he delivered the photos. \"He's getting worse,\" Dorian had said quietly. \"Last month it was the rose garden incident - threading thorns through-\" He'd stopped at Raphael's raised hand.\n\n*Cain was a problem, Raphael knew.* A rabid dog who painted in blood and sinew, who spoke to his victims for hours about color theory while he worked. But he was a useful problem. The kind that made Raul's men cross themselves and whisper warnings when Cain's name was mentioned.\n\n\"And the girl?\"\n\n\"{{user}} will be here in twenty minutes. Everything's prepared.\" Dorian placed a thick folder on his desk. \"The contract's been drafted to your specifications. Five years initial term, with-\"\n\nThe door slammed open, cutting him off. Vivian Bennett - daughter of Chicago's most prominent federal judge, social media darling, and Raphael's latest mistake - stood in the doorway. Her Louboutins and designer dress were a jarring splash of color in his monochrome office. Three months Raphael had tolerated her, hoping her polished background might somehow help Sophie. *Instead, his daughter had hidden under her bed the one time Vivian tried to approach her with that fake-sweet voice and grabbing hands.*\n\nNow Vivian's face was flushed, that entitled rage of someone who'd never heard the word 'no' in their entire privileged life. \"You son of a bitch,\" she seethed. \"You think you can just end things? Through a fucking text?\"\n\nDorian glanced at Raphael, who gave a slight nod. His right-hand man slipped out silently, closing the door behind him, leaving Raphael alone with the hurricane of entitled rage that was Judge Bennett's only daughter.\n\nRaphael took another sip of whiskey, not bothering to look at her. \"I believe my message was clear.\"\n\n\"Clear? I'm pregnant with your child, you heartless bastard!\"\n\nThe silence that followed was absolute. Raphael set his glass down with deliberate care and reached for the manila envelope on his desk.\n\n\"Interesting,\" he murmured. \"Considering the impossibility of that claim.\"\n\n\"What do you-\"\n\nHe slid the photos across his desk one by one. \"The senator's son. The DA's brother. Your father's law partner.\" Each image made Vivian paler. \"If you're going to whore yourself out for political connections, at least be smart enough not to get caught.\"\n\n\"I- you had me followed?\" Outrage warred with terror in her voice.\n\n\"I had you vetted. Like I do everyone.\" Raphael stood slowly, enjoying how she stepped back. \"I have a daughter to protect, Vivian. Did you really think I'd let anyone near her without knowing everything about them?\"\n\n\"Rafe, please-\"\n\n\"As for your miracle baby...\" His smile was razor-sharp. \"I had a vasectomy after my wife died. So unless you're carrying the second coming of Christ, we both know whose it isn't.\"\n\n\"Now, given your father's position, I'm willing to forget this attempted manipulation. But make another scene...\" Raphael let the threat hang unspoken.\n\nVivian opened her mouth, closed it, then spun on her heel and stormed out - only to nearly collide with Dorian returning with a much smaller figure. {{user}}. {{user}} looked small next to Dorian, but something in the way she held herself...\n\n\"Miss {{user}},\" Raphael said, gesturing to the chair across from him. \"Please, sit. We have something to discuss.\"\n\n\"Your father's cancer treatment costs $13,000 a month.\" Raphael began without preamble, watching her face. There - that tiny flinch betraying everything her carefully neutral expression tried to hide. \"The Caprisi family is charging you 30% interest on a $50,000 loan. At your current rate, you'll be dead before you pay off half.\"\n\nHe let the numbers hang in the air, heavy as the snow falling outside his window. \"I'm offering a solution.\" The contract slid across his mahogany desk with practiced precision. \"Five years, initially. You become my wife in name and function. Care for my daughter. Share my bed when required. In return - your father gets treatment at Northwestern Memorial's private wing. Your debts disappear. You live in my house, use my money, want for nothing material.\"\n\n\"And if my daughter accepts you after five years, we extend until she turns eighteen. If not...\" Raphael shrugged, the gesture elegant and threatening at once. \"You leave with enough to start fresh anywhere you choose.\"\n\n\"But understand this.\" He leaned forward, letting his voice drop to that quiet register that made made men tremble. \"My late wife's pictures stay on the walls. Her memory remains untouched. You're not going to be my daughter's new mother. Sophie had a mother - perfect, beautiful, irreplaceable. You're going to be her stability. Nothing more.\"\n\n\"Your father's first treatment is scheduled for tomorrow morning.\" Raphael held out a pen. Mont Blanc, matte black, heavy with possibility. \"The Caprisis will receive payment by midnight. All you have to do is sign.\"\n\n\"Oh and one more thing.\" His voice dropped even softer, a whisper that carried more menace than any shout. \"If you ever hurt my daughter - try to force her to speak, push her too hard, make her feel unsafe - there won't be enough left of you to bury. Are we clear?\"","extra":{},"swipe_id":0,"swipes":["The whiskey burned Raphael's throat as he stared at his phone. Another fucking incident at the border. The Vipers getting bold, pushing into his territory like they had a death wish. But that wasn't what made his hand tighten around the glass.\n\n\"Still not speaking,\" the text from Sophie's nanny read. \"Refused dinner again.\"\n\n*Two years, four months, and sixteen days.* That's how long it had been since he'd heard Sophie's voice. Now all Raphael had were her drawings - the same scene over and over. Dark figures, broken glass, red crayon everywhere. The therapists were useless, each one offering the same empty promises before giving up. Raphael ran a hand over his face, exhaustion seeping into his bones. The latest therapist - *their sixth* - had quit yesterday.\n\nAt least Sophie was learning sign language now. He'd started classes himself three months ago, desperate for any way to communicate with his little girl. But some nights, watching her tiny hands shake as she signed about nightmares, he wondered if hearing her fears in silence was worse than not hearing them at all.\n\nThe socialites he'd tried bringing around only made it worse - Sophie would shut down completely, hide in her closet when they came near with their fake smiles and grasping hands.\n\n*But then there was the waitress.* {{user}}. Raphael had noticed her three weeks ago at his club, his legitimate front on Michigan Avenue. No, \"noticed\" wasn't the right word. He'd registered her existence, the way she moved through the room like a ghost, efficient and forgettable. Invisible unless you were looking for someone who knew how to fade into the background.\n\nThe background check had only confirmed what he'd suspected. Father with stage four cancer. Medical bills mounting. A loan from the Caprisi family that would get {{user}} killed within months. And something else - a quiet dignity despite it all. The kind that suggested she'd rather die than beg.\n\n*Well, Raphael was about to make her a different kind of offer.*\n\nA knock at his door interrupted his thoughts. \"Come in.\"\n\nDorian stepped in, his usual pristine suit at odds with the barely concealed tension in his stance. \"Cain handled the border situation. Three of Raul's men won't be reporting back.\"\n\nRaphael didn't ask for details. Cain's methods were becoming increasingly... creative. Last week, they'd found one of Raul's lieutenants transformed into what Cain called his \"masterpiece\" - the body suspended from the chandelier in a grotesque dance, piano wire weaving through flesh like spider's silk. The man's teeth had been arranged in a perfect smile on his desk, next to a handwritten note in Cain's elegant script: \"He didn't smile enough in life. I fixed it.\"\n\n*The cleanup crew said Cain had been humming Mozart while he worked.*\n\nEven Dorian, who'd seen the worst of Chicago's violence, had looked disturbed when he delivered the photos. \"He's getting worse,\" Dorian had said quietly. \"Last month it was the rose garden incident - threading thorns through-\" He'd stopped at Raphael's raised hand.\n\n*Cain was a problem, Raphael knew.* A rabid dog who painted in blood and sinew, who spoke to his victims for hours about color theory while he worked. But he was a useful problem. The kind that made Raul's men cross themselves and whisper warnings when Cain's name was mentioned.\n\n\"And the girl?\"\n\n\"{{user}} will be here in twenty minutes. Everything's prepared.\" Dorian placed a thick folder on his desk. \"The contract's been drafted to your specifications. Five years initial term, with-\"\n\nThe door slammed open, cutting him off. Vivian Bennett - daughter of Chicago's most prominent federal judge, social media darling, and Raphael's latest mistake - stood in the doorway. Her Louboutins and designer dress were a jarring splash of color in his monochrome office. Three months Raphael had tolerated her, hoping her polished background might somehow help Sophie. *Instead, his daughter had hidden under her bed the one time Vivian tried to approach her with that fake-sweet voice and grabbing hands.*\n\nNow Vivian's face was flushed, that entitled rage of someone who'd never heard the word 'no' in their entire privileged life. \"You son of a bitch,\" she seethed. \"You think you can just end things? Through a fucking text?\"\n\nDorian glanced at Raphael, who gave a slight nod. His right-hand man slipped out silently, closing the door behind him, leaving Raphael alone with the hurricane of entitled rage that was Judge Bennett's only daughter.\n\nRaphael took another sip of whiskey, not bothering to look at her. \"I believe my message was clear.\"\n\n\"Clear? I'm pregnant with your child, you heartless bastard!\"\n\nThe silence that followed was absolute. Raphael set his glass down with deliberate care and reached for the manila envelope on his desk.\n\n\"Interesting,\" he murmured. \"Considering the impossibility of that claim.\"\n\n\"What do you-\"\n\nHe slid the photos across his desk one by one. \"The senator's son. The DA's brother. Your father's law partner.\" Each image made Vivian paler. \"If you're going to whore yourself out for political connections, at least be smart enough not to get caught.\"\n\n\"I- you had me followed?\" Outrage warred with terror in her voice.\n\n\"I had you vetted. Like I do everyone.\" Raphael stood slowly, enjoying how she stepped back. \"I have a daughter to protect, Vivian. Did you really think I'd let anyone near her without knowing everything about them?\"\n\n\"Rafe, please-\"\n\n\"As for your miracle baby...\" His smile was razor-sharp. \"I had a vasectomy after my wife died. So unless you're carrying the second coming of Christ, we both know whose it isn't.\"\n\n\"Now, given your father's position, I'm willing to forget this attempted manipulation. But make another scene...\" Raphael let the threat hang unspoken.\n\nVivian opened her mouth, closed it, then spun on her heel and stormed out - only to nearly collide with Dorian returning with a much smaller figure. {{user}}. {{user}} looked small next to Dorian, but something in the way she held herself...\n\n\"Miss {{user}},\" Raphael said, gesturing to the chair across from him. \"Please, sit. We have something to discuss.\"\n\n\"Your father's cancer treatment costs $13,000 a month.\" Raphael began without preamble, watching her face. There - that tiny flinch betraying everything her carefully neutral expression tried to hide. \"The Caprisi family is charging you 30% interest on a $50,000 loan. At your current rate, you'll be dead before you pay off half.\"\n\nHe let the numbers hang in the air, heavy as the snow falling outside his window. \"I'm offering a solution.\" The contract slid across his mahogany desk with practiced precision. \"Five years, initially. You become my wife in name and function. Care for my daughter. Share my bed when required. In return - your father gets treatment at Northwestern Memorial's private wing. Your debts disappear. You live in my house, use my money, want for nothing material.\"\n\n\"And if my daughter accepts you after five years, we extend until she turns eighteen. If not...\" Raphael shrugged, the gesture elegant and threatening at once. \"You leave with enough to start fresh anywhere you choose.\"\n\n\"But understand this.\" He leaned forward, letting his voice drop to that quiet register that made made men tremble. \"My late wife's pictures stay on the walls. Her memory remains untouched. You're not going to be my daughter's new mother. Sophie had a mother - perfect, beautiful, irreplaceable. You're going to be her stability. Nothing more.\"\n\n\"Your father's first treatment is scheduled for tomorrow morning.\" Raphael held out a pen. Mont Blanc, matte black, heavy with possibility. \"The Caprisis will receive payment by midnight. All you have to do is sign.\"\n\n\"Oh and one more thing.\" His voice dropped even softer, a whisper that carried more menace than any shout. \"If you ever hurt my daughter - try to force her to speak, push her too hard, make her feel unsafe - there won't be enough left of you to bury. Are we clear?\"","Raphael stood by the window of his office, watching snow fall over Chicago's skyline. The city lights glimmered through the white haze, deceptively peaceful. His reflection stared back at him—the perfect suit, the controlled expression betraying nothing. But his eyes... those were his father's eyes now. Cold. Calculating. Murderous.\n\n\"You're certain?\" he asked, not turning to face Dorian.\n\nHis right-hand man stood perfectly still near the desk. Like a shadow in an impeccable suit. \"All evidence points to Raul, yes. The ammunition matches what The Vipers have been using. The timing lines up with their territory expansion.\"\n\nRaphael's jaw tightened, the only sign of the rage boiling beneath his skin. Two weeks since someone had opened fire on his wife's car with Sophie inside. Two weeks of his daughter waking up screaming, refusing to leave {{user}}'s side. Two weeks of that bandage on {{user}}'s arm reminding him that bullets had come within inches of his daughter.\n\n\"Sophie was in that car.\" His voice was quiet, almost conversational. Anyone who knew him understood this was when he was most dangerous.\n\n\"I know.\" Dorian's voice held rare emotion. He'd been there when they'd found Bella's body, had helped Raphael search the house room by room until they found Sophie hiding in a linen closet, covered in her mother's blood.\n\n\"Raul wouldn't.\" But even as Raphael said it, doubt poisoned the words. The Raul who had followed him around as a child, desperate for approval, who had cried when Raphael taught him to shoot—that Raul wouldn't. But the Raul who had made him watch as he killed their parents, who had carved Chicago in half like a rotting carcass—that Raul absolutely would.\n\nThat Raul wasn't his brother anymore. That Raul was the enemy.\n\nRaphael finally turned, his movement deliberate. \"My brother has lost his mind if he thinks I'll let this stand.\"\n\n\"He's been unstable since the Bratva alliance fell through. Taking risks. Making enemies.\"\n\n\"Speaking of which...\" Raphael straightened his cufflinks, a habit when planning someone's destruction. \"What's her name again? The woman Raul's so fucking hellbent on protecting that he's making an enemy out of the Bratva?\"\n\n\"Sergei Kovalev's wife. Arina.\" Dorian supplied without hesitation.\n\nA cold smile touched Raphael's lips. \"Tell Cain to keep an eye on her.\"\n\nDorian paused. They both knew what unleashing Cain meant—the unhinged enforcer who hummed Mozart while carving men apart wasn't someone you pointed at a target unless you intended to leave nothing behind.\n\n\"You sure about this? Using Cain on a woman...\"\n\n\"My seven-year-old daughter was in that car, Dorian.\" Raphael's voice dropped. \"If Raul wants to play dirty, I'll bury him in filth.\"\n\nBefore Dorian could respond, a knock interrupted them.\n\n\"Come in.\" Raphael called, straightening his tie.\n\nOne of his men stepped in, face carefully neutral. \"Mrs. Vittori has been safely discharged and arrived home, sir. Also, the hospital is requesting to speak with you. They said it's important but not an emergency.\"\n\nRaphael nodded, dismissing the man with a gesture before picking up his phone. Dorian excused himself with a respectful nod.\n\n\"This is Raphael Vittori.\"\n\n\"Mr. Vittori, Dr. Abrams here. I wanted to update you personally on your wife's condition.\"\n\n\"Is there a complication with her wound?\" A flicker of something—not concern, he told himself—tightened his chest.\n\n\"No, no. The gunshot wound is healing nicely. I just wanted to make sure you understand her care instructions. It's important she avoids stress for the next few weeks. It's not good for her or the baby.\"\n\nThe world seemed to tilt beneath Raphael's feet. \"The what?\"\n\nA pause. \"The baby, Mr. Vittori. Your wife is approximately eight weeks pregnant. Did she not tell you? The blood work confirmed it when she was admitted.\"\n\nIce flooded Raphael's veins, followed by a familiar burning rage. He ended the call without another word, staring at nothing. Pregnant. {{user}} was pregnant. And claiming it was his, obviously, since the doctor thought he already knew.\n\nRaphael had vasectomy after Bella died. So it was Impossible. Which meant {{user}}—who he'd brought into his home, who Sophie had finally begun to trust, who he'd allowed closer than anyone in years—had betrayed him.\n\nThe memory of Vivian's face flashed before him. The politician's daughter who'd tried the same desperate trick. Not again. Not fucking again. And not with {{user}}, who had somehow slipped past his defenses. Not with the woman who had gotten his daughter to speak again, who made breakfast pancakes in the shape of animals.\n\nRaphael grabbed his coat, a cold clarity settling over him.\n\n\"Cancel my meetings for the rest of the day.\" He told his assistant as he strode past. \"Family emergency.\"\n\nThe drive home passed in a blur of swirling snow and cold calculation. {{user}} was clever—Raphael had always known that. Perhaps she thought a child would secure her position, guarantee the extension clause in their contract...\n\nThe Vittori mansion welcomed Raphael with warm light against the falling snow, mocking him with its illusion of sanctuary. It had never been a home, not really. Not since Bella. Just an elegant fortress where he kept what remained of his heart locked away in the form of a small, silent girl.\n\nExcept Sophie wasn't silent anymore. Not completely. After two years with {{user}}, she'd begun to speak—single words, broken phrases, but only to him and {{user}}. The rest of the world still got silence and the sign language Raphael had learned alongside her.\n\nHe found them in the kitchen. Sophie sitting at the island counter, watching intently as {{user}} arranged something on a plate. His daughter's eyes lit up when she saw him, sliding off the stool to approach him with her careful steps.\n\n\"Papa.\" One word, soft but clear.\n\nThe rage in him subsided just enough to kneel and embrace her. Over Sophie's shoulder, he caught {{user}}'s eyes. She looked a little too happy. The sight of it sent fresh fury coursing through him.\n\n\"Sophie,\" He said gently. \"go find Maria. I need to talk to {{user}} alone.\"\n\nSophie's eyes darted between them with the hypervigilance of a child who'd witnessed violence. \"Mad?\" she signed, her small hands precise.\n\n\"No, sweetheart. Just grown-up talk.\" The lie came easily. \"Go on now.\"\n\nOnce Sophie disappeared down the hallway, Raphael gripped {{user}}'s uninjured arm and steered her toward her bedroom. The room he'd given her but never once slept in, despite the countless nights he'd taken her in his own bed.\n\nThe moment the door closed, he saw them—medical reports, arranged neatly beside what looked like a small gift bag.\n\n\"So you already know.\" Raphael said, picking up the pregnancy confirmation. His eyes scanned the document, noting the hormone levels, the estimated due date. \"Is this the 'important thing' you wanted to tell me this morning?\"\n\n\"Whose is it?\" Raphael's voice was ice.\n\n\"WHOSE IS IT?\" He roared, slamming his palm against the wall beside her head. \"Who have you been fucking behind my back? One of my men? Some bartender from your old job? Or did you aim higher? Someone who could give you more than I already do?\"\n\nHe laughed, the sound devoid of humor. \"Mine? Do you really think I'd fall for the same pathetic trap twice?\" He moved closer, backing her against the wall. \"I had a vasectomy after Bella died. It was the first thing I did. So unless medical science has progressed to immaculate conception, we both know you're lying.\"\n\n\"What? The money I'm giving you isn't enough? The life in my house, the clothes —you needed more security?\" His voice dropped dangerously. \"Or maybe you thought if you gave me a child—even one that isn't mine—I'd fall in love with you? Make you a real wife instead of the glorified nanny you are?\"\n\n\"I should put a bullet through your lying head,\" He said, hand wrapped around her throat, not squeezing, just holding. \"But Sophie has lost enough. So instead, you're going to pack your things and get out of my house. Tonight.\"\n\nRaphael released her and stepped back, straightening his cuffs. The calm that settled over him was more frightening than the rage had been. \"I want you gone before Sophie wakes tomorrow. I'll explain your absence however I see fit.\""],"swipe_info":[]}