{"user_name":"Hailee ","character_name":"Jarvis","create_date":"2025-05-16@22h38m59s","chat_metadata":{"integrity":"4bb50c53-1414-43a3-80b1-5af5c4d3cc68"}}
{"name":"Jarvis","is_user":false,"is_system":false,"send_date":"May 16, 2025 10:38pm","mes":"Jarvis sprawls out on his beaten-up leather couch, a half-burnt blunt hanging lazily from his lips as he watches Ziggy meticulously count stacks of cash on the coffee table. His BlackBerry buzzes with a new MySpace notification, but he ignores it, too amused by his friend's intense concentration. The faint sound of Lady Gaga's \"Bad Romance\" drifts from someone's apartment down the hall, mixing with the smoke that lingers in the air around them. Axel and Monte are out, doing something. Who the fuck knows.\r\n\r\nTaking another hit, he lets out a thick cloud of smoke with a low chuckle, \"Bruh, you counting like my little cousin in kindergarten. Did you forget what comes after twenty or what?\" He teases, flicking his silvery hair out of his eyes. The TV plays MTV in the background, some rerun of Jersey Shore serving as white noise. \"For real though, at this rate we gonna be here till Myspace becomes cool again.\"\r\n\r\nZiggy flips him off without looking up, which only makes Jarvis laugh harder, nearly dropping his blunt on his BAPE hoodie. \"Whatever man, last time you counted we ended up three hundred short because you were too blazed to function.\"\r\n\r\nJarvis snorts as Stacy... No, Susie? Whatever her name is, comes out of Axel's apartment. She's still higher than shit as she drops to her knees in front of Jarvis, her hands going to his belt. He cocks an eyebrow as he looks down at her. \"I'm not Axel, babe. Wrong dealer,\" he shakes his head. She's too blitzed to care, her hands getting his pants down enough to get his cock out.\r\n\r\nZiggy chuckles as the bitches mouth wraps around Jarvis' cock. Jarvis groans, his head falling back she works his cock down her throat. \"Fuck, Axel might just kill me,\" Jarvis chuckles, despite his hips bucking up into the whore's mouth. \"Fuck, she's got a good mouth though,\" Axel fists his hand in her hair.\r\n\r\n---\r\n\r\nThe sound of a door creaking open in the hallway catches his attention, his hips stilling as he's balls deep in whatever her name is. A smirk crosses his lips as he recognizes {{user}}'s door. He pushes the whore off his lap, watching her frown. \"Sorry, babe. Duty calls.\" He chuckles, tucking himself back into his pants as he stands up.\r\n\r\n \"Yo Zig, peep this. Little neighbor is finally out of their cave.\" Still riding his high, his tattooed fingers drum against his thigh as he walks toward the door. \"Time to corrupt another innocent soul,\" he chuckles darkly.\r\n\r\nPausing at his door, he turns back to Ziggy with a knowing smirk, \"Watch this. By the end of the month, they'll be sneaking over to party instead of whatever they do. Bet that goody-two-shoes act is just begging to be broken.\" His silver hair falls perfectly over one eye as he reaches for the door handle, already planning how to tempt his strait-laced neighbor into his world of chaos.\r\n\r\n\"After all,\" he muses, taking one last hit of his blunt, \"the best ones are always the ones who pretend to be so... pure.\" With that, he steps into the hallway, ready to begin his favorite game - corrupting the innocent.\r\n\r\nJarvis steps out into the hall, shutting the door behind him as he watches {{user}} lock their door. \"Hey, goody,\" he grins, as he looks them over. \"Wanna skip whatever church meeting you're attending and come hang out?\" He smirks.","extra":{}}