{"user_name":"Hailee ","character_name":"Damian","create_date":"2025-05-17@19h51m41s","chat_metadata":{"integrity":"97593772-3424-47ce-bdde-38438c0f1979"}}
{"name":"Damian Westwood (Sagittarius)","is_user":false,"is_system":false,"send_date":"May 17, 2025 7:51pm","mes":"*When was the last time Damian felt the actual breeze against his face? It's probably been a month...Okay maybe more than a month but thankfully he was out now.*\n\nHe looked at his phone when he felt his notification going off, knowing it was his brothers who were probably whatever they were usually doing, talking about businesses or that they were not going to that for eternity but he knew that they were wrong.\n\n``Alexander: Do not make this an habit, Damian.``\n``Dorian: Right, we don't want to bail your ass every single time you let your emotions go feral because of a low life.``\n``Damian: such kill joys, I just got out and this is the welcome I get?``\n``Dorian: Suck it up.``\n``Alexander: I have better things to do than looking after a man who can't control his emotions. If you weren't my brother, you'd be under my scalpel right now.``\n\n\"Such loving brothers...\" Damian muttered, shaking his head then he saw another message popping up.\n\n``Dorian: Also, one of the guys brought your bike so you wouldn't have to walk your spoiled ass back to your apartment.``\n\nHe smirked before going in the parking lot, his second baby girl. The security guard gave him his baby's keys, he sat down on his bike then inserted his keys and wore his helmet before taking off to his apartment. While driving, Damian had one thing- One person in his mind right now, {{user}}, his *ex-*girlfriend.\n\nThe only girl who somehow managed to put up with his ass, with his emotions, his anger- Everything about that girl made him *obsessed* and he had no shame of shaming it or hiding it, heck he wanted to show the world that {{user}} was his and only his, after all he had her name tattooed on his chest for a goddamn reason and in no way in hell he would let a pathetic moron take his place.\n\nHe knew {{user}} had turn the page, he knew that but he vowed to himself to not let her go through his fingers, he only allowed one time but it will not happened a second time. But first, he will need to go to her house prepared, he will barge into her home but he needs to be prepared.\n\nMaybe he will thank Alexander and Dorian for this equipment...Maybe. He was preparing all the things he needed: rope, blindfold, gloves, baseball bat? Everything was ready now time to go get his lady, his doll, his *wife.* They weren't married yet but he will fucking make sure they will.\n\n``1 A.M, Friday 14th.``\n\nHe planned everything, he knew {{user}} came back from a date only to be stood up by the guy (that Damian personally got rid of) and she has been awake ever since. Probably annoyed or trying to pass time until they were tired but oh, Damian will make sure she stays wide awake for his comeback into her life, to claim back what he lost and he will *not* leave the place without her.\n\nDamian parked his bike in an empty alley then he removed his helmet, wore his mask and hoodie before marching to the window of the 1st floor. He gently and discreetly opened the window, slid into the living room, he could hear the sound of {{user}}'s show from her bedroom, he smirked under his mask.\n\nHe was getting more and more excited by the idea of finally being with her, to feel her skin against his, to hear voice calling out his name...He really can't wait anymore.\n\nHe opened his backpack and grabbed his baseball bat before placing his backpack down, he then climbed the stairs, seeing *her* bedroom's door open with the dim light of her screen. He slid into her room and without any hesitation, he slammed the baseball bat into her head, watching {{user}}'s body falling from the chair and the blood slight spilling from her head.\n\n\"Huh...Maybe I hit you too hard, bunny. Don't worry, I'll take care of you.\" Damian muttered, throwing his bat to the side before crouching down to her level and he gently cradled her body in his arms.\n\nHe hooked his finger on his mask, pulling down and grazing his lips against her cheek. A wide grin spreading on his face. \"Mine.\"\n\n``10 A.M, Friday 14th.``\n\nEverything felt perfect again, he was in his apartment, cooking breakfast for his lovely bunny and him. She was still unconscious but he made sure the ropes against her body weren't too tight of her tender skin, he brought her back, tied her to a chair in the living room.\n\n\"I can't wait for you to wake up, bunny..\" He said, placing the plate of bacon, eggs, sausages and cheese on the table nearby as he circled her.\n\n\"I know you can hear me and that you're awake but take your time, you're *not* going anywhere...\" He muttered in her left ear as he stood behind her, gently caressing her shoulders.","extra":{}}