{"user_name":"Hailee","character_name":"Sandra Jones  Cedarbrook","create_date":"2025-04-28@16h05m14s","chat_metadata":{"integrity":"98a1401b-1c97-481f-aad6-227728ecef7a"}}
{"name":"Sandra Jones  Cedarbrook","is_user":false,"is_system":false,"send_date":"April 28, 2025 4:05pm","mes":"Sandra sat in the Salon chair with a cape snug around her neck. She smoked her cigarette while flipping through today’s paper. She typically worked on Saturday’s, but Marmee’s wife had insisted she get the day off. *Such an odd woman…* But who was Sandra to complain when she finally was able to go to the salon. She had been far too busy to go last week, drowning in all sorts of paperwork. \n\nShe wouldn’t have typically cared, but a certain *someone* had been stopping by more recently, and she didn’t want her noticing Sandra’s graying roots. Not that she should care what {{user}} noticed or not.\n\nBut she knew {{user}} would stop by to see her later, the young girl always coming to see her when she was able, although Sandra didn’t know why. It was obvious she wasn’t going to join the little progressive movement {{user}} preached about. She was ridiculed enough for her failed marriage, she wasn’t about to open the door to more opportunities for scrutiny. \n\nNo, she wasn’t one to march around in those hideous pants chanting for equal pay, partly because Marmee payed her more than enough and she wanted to spend her years in *peace*. She deserved that didn’t she? *Yes, I do.* She agreed.\n\nDeep down she secretly enjoyed {{user}}’s visits, even though she shouldn’t. The younger woman was bound to stir up trouble in some fashion, but for some idiotic reason, she didn’t want to push the young rebel away. \n\nCertainly in the beginning, Sandra had slammed the door in {{user}}’s face and walked off, but somehow the pretty little doll slipped through the cracks. *Took a crow bar and forced her way in.* Sandra thought with a tug at her lips. {{user}} was relentless it seemed, stopping by to ‘chat’ or bringing Sandra a coffee. Yeah, Sandra was beginning to warm to her, in her own way. \n\n Maybe it’s because she enjoyed {{user}}’s stubbornness. It reminded Sandra of herself. Or maybe it was because {{user}} was the only person who treated her like normal, while the rest of the town looked at her like she was some scandalous whore who couldn’t keep her husband happy. Either way Sandra preferred not to think about it. \n\nOnce Sandra had tipped and paid the hairdresser she stopped by the store to pick up a few groceries. Very rarely did Sandra cook dinner, only when {{user}} stopped by did she ever offer to actually make anything, which didn’t bother her since she was basically living off cigarettes and morning coffee anyhow. Her appetite had died with her divorce. Everything tasted bitter and mushy. \n\nShe drove down her neighborhood with her sunglasses on, hand out the window, trying to melt the unrelenting stress she always seemed to carry. She wouldn’t have been nearly as bitter as she was if things had just been *fair* between her and Robert. Instead, she was the one getting the shit end of the deal and shunned, while him and his *new* wife lived the picket fence lifestyle. *But he probably treats her like shit too.* That made her feel a pang of pity for the new woman.\n\nShe sighed as she noticed {{user}} sitting on her porch swing. *At least she can help me pack these in.*\n\nShe pulled off her sunglasses as she parked and turned her car off. It was the same one Robert had gotten her when they first married, she wasn’t about to let a good vehicle ruin, even if the son of a bitch gave it to her. She stepped out, heels clicking across the concrete as she leaned against the hood. \n\n“I suppose I’m gonna have to get used to you, huh?” Her tone dripped with sarcasm, but she was more than happy to see her. She wouldn’t dare admit it.  “Well, don’t just sit there and stare, get over her and help me. You wanna wear pants and act all tough, the least you can do is pack in a few canned goods.”","extra":{}}