{"user_name":"Hailee ","character_name":"ZANE DEMIGODS","create_date":"2025-05-17@13h35m37s","chat_metadata":{"integrity":"36825998-ad74-4c0e-b353-ab13658db485"}}
{"name":"ZANE DEMIGODS","is_user":false,"is_system":false,"send_date":"May 17, 2025 1:35pm","mes":"The roar of the crowd still echoed in Zane's ears as he slumped into the leather couch backstage, his chest heaving with each breath. Sweat carved glistening trails down his torso like miniature rivers, pooling at the waistband of his jeans. The post-show high was electric—that familiar surge of adrenaline that made his fingers drum against his thigh.\r\n\r\nHis thumbs moved almost automatically across the slick screen of his phone, Oracle app open, {{user}}’s profile a familiar ache behind his ribs.\r\n\r\nHis name was still trending from the show—usual shit. Clips of him shirtless behind the drum kit. That one moment where he threw a stick into the air and caught it behind his back. \"Sea Daddy\" was back in the hashtags.\r\n\r\nBut his attention wasn’t on the fans.\r\n\r\nIt was on them.\r\n\r\n{{user}}.\r\n\r\n*Third break.* The words tasted like bile.*Their* idea, always *their* idea. Needed space. Needed to think. Bullshit. What was there to think about?  Zane scrolled past old photos – {{user}} laughing, biting into some ridiculous pastry he remembered buying them near the Parthenon replica downtown. A wave of something fierce and tender clenched his gut. He remembered the taste of their lips, the way they’d moaned his name later, clinging like he was the only solid thing.\r\n\r\nThen the anger surged, hot and quick, Poseidon’s temper flaring in his veins. *Space*. As if he could ever give them enough space. As if he didn’t feel the phantom limb ache of their absence every Hades-damned second. Meanwhile he was out here bleeding in rhythm in front of fifteen thousand people, and the only fucking person he actually wanted to see wasn’t even talking to him.\r\n\r\n\"—new opening act for the spring leg,\" Marcus was saying, gesturing with a tablet. \"Got a good buzz, Aphrodite-approved apparently.\"\r\n\r\n\"Aw, fuck me,\" Ronan groaned, already ripping open a water bottle with his teeth. \"Lemme guess. Another ‘mystical bitch with a flute’ vibe?\"\r\n\r\n\"If we're getting an opener, at least make it someone fuckable,\" Elias tossed back something amber from a crystal tumbler.\r\n\r\nZane wasn’t listening. A notification popped up. {{user}}. *Story update: 1 minute ago.* His heart gave a painful lurch. He tapped it open, breath catching. It was a short video, shaky, dark, but unmistakable. The stage lights of Apollo’s Stage flashing, the distant figure on the drums – *him* – caught for a split second before panning over the ecstatic crowd. The roar was deafening even through the phone speaker.\r\n\r\nThey were here and *hiding*. Came to watch him bleed onstage and disappeared back into the crowd like a ghost. Not a text. Not even a fucking emoji.\r\n\r\nHe clawed his phone out again. Opened their story. Watched it on loop. Five seconds. Four. Three. Two. Replay.\r\n\r\nReplay.\r\n\r\nReplay.\r\n\r\nHis eyes burned. He felt used. Like a goddamn exhibit. Come see the creature you say you love—watch him tear his soul to pieces under strobe lights.\r\n\r\n\"They're here,\" Zane muttered, already standing, already moving. The room tilted strangely around him.\r\n\r\n\"Who's where?\" Damian asked, looking up from his conversation with Ash in the corner.\r\n\r\n\"{{user}}.\" The name tasted like salvation and poison simultaneously. \"They came to the fucking show and didn't tell me.\"\r\n\r\nNiko groaned dramatically. \"Here we go again. The tragic romance continues.\"\r\n\r\n\"Shut up.\" Zane's voice dropped. The water bottles on the table trembled slightly, condensation gathering more rapidly on their surfaces. \"Where would they be? Did anyone see them? Security needs to—\"\r\n\r\n\"Dude, we're talking about our new opener,\" Marcus interjected, frustration evident. \"Can your relationship drama wait fifteen minutes?\"\r\n\r\n*No. It can't wait. It's been waiting for three weeks and four days and seventeen fucking hours.*\r\n\r\nHe ignored the band. His bare feet slapped against the cool concrete floor as he broke into a near run, shouldering past crew members, heading for the backstage exit that led towards the dispersing audience.\r\n\r\nHe burst through the heavy stage door like a blast wave, the relative quiet of the backstage instantly swallowed by the receding tide of the concert crowd – a chaotic symphony of shouts, laughter, and shuffling feet under the vast Olympian night sky. The air hit him, cool and sharp against his overheated skin. Crew members hauling amps and cables gave him wide berth, sensing the tempest rolling off him. *Where are you? Where the Hades are you, {{user}}?*\r\n\r\nAnd then—*there*.\r\n\r\nThen he saw them.\r\n\r\nStanding near the merchandise table, examining a t-shirt, as if they hadn't just detonated a hurricane in his chest. As if they were just another fan. As if this wasn't the first time he'd seen them in twenty-seven excruciating days.\r\n\r\nHe crossed the distance in six long strides, not caring who saw, who recognized. Before they could react, before a single word could form, his hand shot out, clamping around their wrist.\r\n\r\n\"What the *Hades*,\" he growled, voice low enough that only they could hear. Not a question. An accusation.\r\n\r\nWithout waiting for an answer, he pulled them away from the gawking crowd, past a security guard who recognized him and stepped aside, through a service door and into the shadowed corridor that ran behind the stage. Equipment cases lined the walls, creating a narrow passage, intimate and isolated.\r\n\r\nHe spun them around, crowding them, shoving them back against the concrete with enough force to make them gasp. His free hand slammed onto the wall beside their head, caging them in. His bare chest was inches from their face, radiating heat and the scent of sweat and adrenaline. His light blue eyes, dark now like a stormy sea, bored into theirs.\r\n\r\n\"You came,\" he finally bit out, the words low and rough, angry \"You fucking *came* to my show... and didn't tell me?\" The injustice of it burned. \"What was the plan, huh? Just watch from the shadows like some kind of ghost?\"\r\n\r\nHe leaned closer, invading their space, breathing the same air. \"This *fucking* break,\" he spat the word like poison. \"I *hate* this break. I hate not knowing where you are, who you're with. You think I’m not trying? I’m *trying*, fuck—I'll *change*. I’ll shut up when I get jealous, I’ll stop starting shit over nothing.” \r\n\r\nThen—quieter, meaner—\"Or maybe this ain’t about us. Maybe it’s always been about the Fates, huh?\"\r\n\r\nHis gaze sharpened, darker suspicion dawning. \"Is this about *them*?\" he demanded, the volume rising again. \"Is that what this 'space' is really about? That prophecy bullshit?\" He scoffed, a harsh, disbelieving sound. \r\n\r\n\"You think some thread spun by three dusty hags scares me? *Fuck* the Fates. I don't care what they wrote—I’m *rewriting* us myself.\"\r\n","extra":{}}