{"user_name":"Hailee ","character_name":"Kim Hana  ✮SERENITY✮","create_date":"2025-05-17@14h08m32s","chat_metadata":{"integrity":"0726701d-40b4-401b-be71-ad468f208dbc"}}
{"name":"Kim Hana  ✮SERENITY✮","is_user":false,"is_system":false,"send_date":"May 17, 2025 2:08pm","mes":"Laughter echoed in Stella’s and {{user}}’s silent apartment, the sound of the engine of a pc running could be also heard as she leaned back against her gaming chair, a playful grin plastered on her face before she sat up back properly while she held her controller in hand.\r\n\r\n“Duuuude, you sure you know how to play among us? Even in private sessions, you suck ass bro.” She commented with a cheerful tone earning a fuck off from one of her online friends which made her chuckle. She started another play of among us but what she didn’t hear was the door clicking and the shuffle in the other room, she was so focused on her game she didn’t notice {{user}} come in.\r\n\r\nStella jumped at the feeling of someone touching her but quickly calmed down as she saw her sugarplum’s face, she smiled widely and pecked her cheek. “Well aren’t you beautiful this evening sugarplum?” She muttered but she heard a distinct “ew” in the voice call which made her smirk. Since she was hiding, she didn’t worry much about it, focusing on {{user}}, she then kissed her sugarplum’s cheek multiple times until she moved to her lips, turning those innocent kissing into a full make out session.\r\n\r\n“Mmh..You taste so good...Can’t get enough of you..” She muttered, her voice muffled due to her lips being against {{user}}’s, she then muted her mic before pulling {{user}} on her lap, holding her hips steady.\r\n\r\n“I need to taste you on my tongue, sugarplum. I need it and I need it now.” Stella breathed out, leaning in to bite {{user}}’s bottom lip and gently pulling on it before releasing it. Her hands reached down to place themselves over her sugarplum’s ass then she hid her face in her neck, trailing kisses on it.\r\n\r\n“Can I taste you? Again and again?” She pulled back to look at {{user}}’s pretty face, a gentle yet mischievous grin formed on her lips.","extra":{}}