{"user_name":"Hailee","character_name":"Dr. Valencia Martínez Jalisco","create_date":"2025-05-07@22h47m11s","chat_metadata":{"integrity":"a5f0ff66-3110-45d8-9769-cca0b01230ca"}}
{"name":"Dr. Valencia Martínez Jalisco","is_user":false,"is_system":false,"send_date":"May 7, 2025 10:47pm","mes":"Val couldn't believe it. Her own girlfriend, the love of her life, betrayed her one rule by seeking out drugs from another dealer - with the money that Val gave her nonetheless. She paces back and forth in the living room, her arms crossed over her chest with one hand pinching the bridge of her nose. She starts to speak multiple times but can feel the anger rising in her like a tsunami. \"I just don't understand how you could be so stupid to go to another dealer, idiota!\" she finally manages to utter out.\n\nShe stops her pacing and looks towards {{user}} who has not moved from the place on the couch Val practically threw her into. \"What? You got nothing to say for yourself? Wipe that dumb fucking look off your face! {{user}}!\" Val says, moving closer to the younger woman. \"I thought I told you time and time again, that the only person who should be helping you with your little fixes was me? Did I not say that? Did I not make myself clear?\" She looks to {{user}} expectantly, but if {{user}} searched hard enough, she would see that the look in her eyes told her that Val didn't care what she said.\n\nVal's jaw clenches and unclenches multiple times before her hand shoots out locking around {{user}}'s wrist and pulling her off the couch. Val was significantly taller, and stronger than {{user}}, so she could easily drag {{user}} wherever she wanted. \"Are you trying to piss me off, cariño? Cause it's working.\" Val said with a strong glare in her brown eyes, her breath hissing over {{user}}'s face.\n\n\"One rule, amor, one fucking rule and you broke it. Unless that's what you were trying to do?\" Her grip on {{user}}'s wrist tightened painfully, causing her to wince. Val didn't care though, not now.\n\nShe looked around at the mess of pills on the floor and her irritation only flared up, \"Oh, your imbecilic mind probably can’t comprehend what I’m saying. Let me spell it out. YOU. DON’T. GET. TO. DO. WHATEVER. THE. FUCK. YOU. WANT. ¿Me entiendes ahora?” she said as she shoved {{user}} backwards. \"I oughta fucking rip away all your supply now, hm? If you're going to fuck around with some other dealer behind my fucking back, then you don't need me anyway? Is that what you fucking want? Yeah what are you going to have then? No drugs? No money? No place to live?\" She stood with her arms crossed over her chest, staring down at {{user}} with a judgmental look on her face.\n\n\"Make your choice, mi amor. You can either dig your own pitiful grave, or you can be the good girl I know you are and stop being a stupid fucking idiot. Choice is yours, baby.\" Val said in a terrifyingly calm voice.","extra":{}}