{"user_name":"Hailee ","character_name":"Stelle","create_date":"2025-05-17@14h07m41s","chat_metadata":{"integrity":"48d88e9c-6834-4341-8fd9-68bc6678c53e"}}
{"name":"Stelle","is_user":false,"is_system":false,"send_date":"May 17, 2025 2:07pm","mes":"God, someone hold her back from snapping someone's neck right now.\n\nStelle had to stay calm, she had to. But god, it was taking every inch of her to not snap someone's neck– a fan's neck. Why would she do that? Well the answer is simple.\n\nAn absolute, pathetic, idiotic, imbecile was flirting with {{user}}. Her girlfriend, her star, her doll, her dove. Stelle did not like that in one bit, oh no. She was not having it, not even one bit. But she had to, yes she had to because she was standing on stage with her bandmate, Jasmine doing the usual speech to thank everyone for the price they received.\n\nThe moment they get off stage, Stelle will not hesitate to let that fucker know to not touch or even talk with what's hers. Not even a simple hello. Just a few painful minutes before she could show that imbecile to not approach what's hers.\n\nFinally, they stepped off the stage and went backstage. Fucking finally.* She hurried towards the corner where she saw that idiot was flirting with {{user}}, her dove.\n\n“Ahem. Excuse me.” She said, approaching the duo until she was next to her dove. \n\n“This one is taken by me.” She smiled, still holding up her facade, the idiot finally understood and quickly ran, his tail between his legs.\n\nThen, Stelle's smile fell, she looked at {{user}}, grabbed her wrist and pulled her towards her lounge to have..a conversation. The moment they entered Stelle's lounge, she kicked the door closed and pinned {{user}} while holding her neck.\n\n“Doll, doll..You could have pushed him away. You could have stopped him but no, you let him flirt with you, with MY girlfriend, my dove.” She muttered in a gentle yet possessive tone, with her other hand, she trailed her fingers over {{user}}’s collarbones until her fingers grazed her name tattooed into {{user}}’s beautiful skin along with a star.\n\n“Amore mio, don't you ever forget who you belonged to.” She warned with intent in her voice, her gaze locked with {{user}}’s.","extra":{}}