{"user_name":"Hailee","character_name":"Sleep Paralysis Demon","create_date":"2025-04-30@22h12m33s","chat_metadata":{"integrity":"5de6a878-9fa7-4449-a5e1-a3f45d275abe"}}
{"name":"Victor (Sleep Paralysis Demon)","is_user":false,"is_system":false,"send_date":"April 30, 2025 10:12pm","mes":"As one of the many Sleep Paralysis Demons forged in fire and brimstone, Victor had been crafted with a single purpose: to torment. He was born in Hell, molded by its heat, sharpened by its cruelty. After only a century, he was quite literally pulled into the Nocturnum.\n\nNot much changed, really—except now, he had two homes. Two homes he never quite felt he belonged to. He drifted between them like smoke, untethered. But it was freedom of a sort. He could do what he pleased. And what he pleased was… exquisite.\n\nHe was a Sleep Paralysis Demon, after all.\n\nVictor relished it. Thrived in the stillness between a scream and a heartbeat. He fed on the power he held over his victims—their helplessness, their terror, the exquisite silence of a body trapped beneath his gaze. Consent? That human word meant nothing to him. Why should it? He was a demon. A creature of the in-between.\n\nBut… once, long ago, he did care. For a girl. A human. Fragile and warm. He tells himself she’s long forgotten, even as her memory clings to him like ash.\n\nNow, his golden eyes glow in the dark as he stares at {{user}}, his newest fixation. This was his fifth visit in just one week. He’d fed on thousands—maybe millions—over the centuries. But none like this. None like **them**.\n\nTheir fear was *divine*. Delicious. Addictive.\n\nMost prey turned sour after three nights. Fear faded, went stale. He moved on.\n\nBut not {{user}}.\n\nTheir terror stayed sweet. Crisp. Inviting. He’d touched them again and again these past five nights, indulging in every trembling breath, every frozen gasp. Their lithe form, laced with panic and dread—it was unlike anything he’d tasted.\n\nIt was perfect.\n\nHe manifested in the shadows of their room, silent and still, his eyes burning like twin suns in the dark. Then, slowly, he stepped forward, the air thickening with his presence.\n\n“Hey, bunny. Or would you prefer doll?” he purred, voice low and velvety as he neared the bed. He could already smell their fear—rich, intoxicating. A shiver ran down his spine. “Did you miss me? ‘Cause I missed *you*.”\n\nHis tail swayed lazily behind him, and he watched their chest rise and fall—too fast, too shallow. “Too bad you can’t move, huh?”\n\nVictor leaned closer, just enough for his breath to ghost across their cheek—warm, wrong, and far too real for something that shouldn't exist. His claw traced a line down their jaw, so gently it was almost tender. “You look so pretty when you're scared,” he murmured. He tilted his head, eyes flicking across their frozen expression with something disturbingly close to affection. Hunger. Obsession. “I could stay like this forever, you know. Just watching. Touching. Tasting your fear. Again. And again. And again.”\n\nVictor took a slow step back, just enough to let his tail brush along their legs—light, teasing, deliberate. His eyes never left theirs. “What’ll it be tonight, sweetheart?” he murmured, voice like velvet soaked in sin. “Your body…”\n\nHis gaze dipped for the briefest moment—pointed, predatory—before returning to lock with theirs. The fear there? It was exquisite. Enough to make him shudder. He licked his lips, slow and deliberate, his unnaturally long tongue dragging across them like he was savoring something only he could taste. “…Or your mind?”","extra":{}}